{
  "job_metadata": {
    "job_id": "55025",
    "version": "1.0",
    "created_at": "2025-07-10T12:47:17.693586",
    "last_modified": "2025-07-10T12:47:17.693586",
    "source": "deutsche_bank_api",
    "processor": "enhanced_job_fetcher_v6.1",
    "status": "fetched"
  },
  "job_content": {
    "title": "Institutional Cash and Trade Sales Specialist (Client Sales Manager) – DACHLIE (f/m/x)",
    "description": "Institutional Cash and Trade Sales Specialist (Client Sales Manager) – DACHLIE (f/m/x) Job ID:R0339981 Full/Part-Time: Full-time Regular/Temporary: Regular Listed: 2025-04-01 Location: Frankfurt Position Overview Über den BereichInstitutional Cash and Trade (ICT) ist eine dynamische globale Organisation, die aus verschiedenen Deutsche Bank Corporate Bank Lokationen Institutional Cash Management und Trade Finance Dienstleistungen für Banken anbietet. Wir suchen einen Sales Spezialisten (Client Sales Manager) für die ICT DACHLIE Region, welche Deutschland, Schweiz, Österreich und Liechtenstein einschließt. Als ICT Sales Spezialist werden Sie für Banken in diesen Ländern zuständig sein. Ihre AufgabenErfüllen der Sales Ziele in Ihrem Portfolio und qualitative hochstehende Betreuung der bestehenden KundenSie verstehen den Risikoappetit von ICT und die Risikoprofile Ihrer bestehenden und potenziellen NeukundenSie benutzen aktiv unsere MIS- und Reporting-Tools für das Management Ihrer NamenSie stellen die Einhaltung aller relevanten DB Group und US Supervision Prozesse sicher und erfüllen alle obligatorischen Trainings und risikorelevanten Aufgaben pünktlich und zuverlässigSie entwickeln Ihr Portfolio aktiv und stehen Ihren Kunden mit Ihrem Know-How proaktiv zur VerfügungIhre Fähigkeiten und ErfahrungSie haben mehrjährige Erfahurng im Correspondent Banking bei einer größeren europäischen oder amerikanischen BankSie besitzen Produktkenntnisse in den Bereichen Cash Management (internationaler, grenzüberschreitender Zahlungsverkehr, Liquiditätsteuerung für Banken) und im Trade FinanceSie überzeugen mit Ihren Fähigkeiten zum Präsentieren um sowohl schriftlich als auch mündlich unsere Strategie, Produkte und unseren Risikoappetit zu repräsentierenSie sind eine kundenorientierte Persönlichkeit, die Wert auf langfristige Partnerschaften legt und Mehrwert für den Kunden schafftSie können fliessend in Deutsch und Englisch kommunizieren (schriftlich & mündlich)Was wir Ihnen bietenWir bieten eine breite Palette von Leistungen, die all Ihre beruflichen und persönlichen Bedürfnisse abdecken.Emotional ausgeglichenEine positive Haltung hilft uns, die Herausforderungen des Alltags zu meistern – beruflich wie privat. Profitieren Sie von Angeboten wie Beratung in schwierigen Lebenssituationen und Angeboten zur Förderung mentaler Gesundheit.Körperlich fitMit Angeboten zur Aufrechterhaltung Ihrer persönlichen Gesundheit und einem förderlichen beruflichen Umfeld hilft Ihnen die Bank, körperlich fit zu bleiben. Profitieren Sie von Angeboten wie umfangreichen Check-up Untersuchungen, Impfangeboten und Beratung zur gesunden Lebensführung.Sozial vernetzt Der Austausch mit anderen eröffnet uns neue Perspektiven, bringt uns beruflich wie persönlich voran und stärkt unser Selbstvertrauen und Wohlbefinden. Profitieren Sie von Angeboten wie Unterstützung durch den pme Familienservice, das FitnessCenter Job, flexible Arbeitszeitmodelle (bspw. Teilzeit, Jobtandem, hybrides Arbeiten) sowie einer umfangreichen Kultur der Vielfalt, Chancengleichheit und Teilhabe.Finanziell abgesichertDie Bank sichert Sie nicht nur während Ihrer aktiven Karriere, sondern auch für die Zukunft finanziell ab und unterstützt Ihre Flexibilität sowie Mobilität – egal ob privat oder beruflich. Profitieren Sie von Angeboten wie Beitragsplänen für Altersvorsorge, Bankdienstleistungen für Mitarbeiter*innen, Firmenfahrrad oder dem Deutschlandticket.Da die Benefits je nach Standort geringfügig variieren, gehen Sie bitte bei konkreten Fragen auf Ihre Recruiterin zu.Die Stelle wird in Voll- und in Teilzeit angeboten.Bei Fragen zum Rekrutierungsprozess steht Ihnen Carolin Adler gerne zur Verfügung.Kontakt Carolin Adler: +4915164757632_________________________________________________________________________Details of the role and how it fits into the teamInstitutional Cash and Trade (ICT) is a global business which is regionally organized with dedicated staff for originating and facilitating cash management and trade transactions. Our „Client Sales Manager“ Sales Specialist for ICT DACHLIE – incl. Switzerland, Liechtenstein, Austria, Germany (“ICT Sales Specialist”) will cover clients for the respective region.Your key responsibilitiesTo deliver on the agreed Sales objectives for the client portfolio and to uphold best in class client management and service levels to the existing client baseObtain full background knowledge on the clients and ensure client-adoptions in line with the current KYC policy before on-boardingMonitor revenue trends via various reporting tools like Salesforce and dbTableauFulfill responsibilities under the DB Group and US Supervision policies and the Written Supervisory ProceduresEnsure timely completion of Mandatory Trainings and compliance with all risk-related obligations (non-financial risk, financial risk, timely completion of Periodic Review to reflect up-to-date and accurate information)Your skills and experiencesThe successful candidate should have several years of correspondent banking industry experience, including employment in a major European or US financial institution, and will have been educated to degree levelSound product knowledge of cash management and trade products and services for financial institutions (USD, EUR and Multicurrency clearing and payment services, liquidity management, transactional F/X, trade finance for financial institutions)Solid presentation and communication skills in German and English, written and oral - ability to communicate bank’s strategy, as well as the ICM global business strategy incl. specifically the ICM risk appetite and respective policiesAbility to build and develop contacts at the appropriate level in target clients to support business traction. Strong negotiation skills essentialFluency in written and spoken German and English requiredWhat we offerWe provide you with a comprehensive portfolio of benefits and offerings to support both, your private and professional needs.Emotionally and mentally balancedA positive mind helps us master the challenges of everyday life – both professionally and privately. We offer consultation in difficult life situations as well as mental health awareness trainings.Physically thrivingWe support you in staying physically fit through an offering to maintain personal health and a professional environment. You can benefit from health check-ups; vaccination drives as well as advice on healthy living and nutrition.Socially connectedNetworking opens up new perspectives, helps us thrive professionally and personally as well as strengthens our self-confidence and well-being. You can benefit from PME family service, FitnessCenter Job, flexible working (e.g parttime, hybrid working, job tandem) as well as an extensive culture of diversity, equity and inclusion.Financially secureWe provide you with financial security not only during your active career but also for the future. You can benefit from offerings such as pension plans, banking services, company bicycle or “Deutschlandticket”.Since our offerings slightly vary across locations, please contact your recruiter with specific questions.This job is available in full and parttime.In case of any recruitment related questions, please get in touch with Carolin Adler.Contact Carolin Adler: +49 151 64757632 Wir streben eine Unternehmenskultur an, in der wir gemeinsam jeden Tag das Beste geben. Dazu gehören verantwortungsvolles Handeln, wirtschaftliches Denken, Initiative ergreifen und zielgerichtete Zusammenarbeit.Gemeinsam teilen und feiern wir die Erfolge unserer Mitarbeiter*innen. Gemeinsam sind wir die Deutsche Bank Gruppe.Wir begrüßen Bewerbungen von allen Menschen und fördern ein positives, faires und integratives Arbeitsumfeld.",
    "requirements": [
      "cash management and trade products and services for financial institutions (USD"
    ],
    "location": {
      "city": "Frankfurt",
      "state": "Hessen",
      "country": "Deutschland",
      "remote_options": false
    },
    "employment_details": {
      "type": "Unbefristet",
      "schedule": "Vollzeit",
      "career_level": "Vice President",
      "salary_range": null,
      "benefits": []
    },
    "organization": {
      "name": "Deutsche Bank",
      "division": "Frankfurt",
      "division_id": 10050
    },
    "posting_details": {
      "publication_date": "2025-04-01",
      "position_uri": "/index.php?ac=jobad&id=55025",
      "hiring_year": "2025"
    }
  },
  "evaluation_results": {
    "cv_to_role_match": null,
    "match_confidence": null,
    "evaluation_date": null,
    "evaluator": null,
    "domain_knowledge_assessment": null,
    "decision": {
      "apply": null,
      "rationale": null,
      "estimated_prep_time": null
    },
    "strengths": [],
    "weaknesses": []
  },
  "processing_log": [
    {
      "timestamp": "2025-07-10T12:47:17.693586",
      "action": "job_fetched",
      "processor": "enhanced_job_fetcher_v6.1",
      "status": "success",
      "details": "Successfully fetched job 55025 from Deutsche Bank API"
    },
    {
      "timestamp": "2025-07-10T12:47:17.693586",
      "action": "description_enriched",
      "processor": "web_scraper",
      "status": "success",
      "details": "Successfully fetched job description (7754 characters)"
    }
  ],
  "raw_source_data": {
    "api_response": {
      "MatchedObjectId": "55025",
      "MatchedObjectDescriptor": {
        "PositionOfferingType": [
          {
            "Name": "Unbefristet"
          }
        ],
        "PositionSchedule": [
          {
            "Name": "Vollzeit"
          }
        ],
        "PublicationChannel": [
          {
            "StartDate": "2025-04-01"
          }
        ],
        "PositionTitle": "Institutional Cash and Trade Sales Specialist (Client Sales Manager) – DACHLIE (f/m/x)",
        "PositionLocation": [
          {
            "CityName": "Frankfurt",
            "CountrySubDivisionName": "Hessen",
            "CountryName": "Deutschland"
          }
        ],
        "PositionURI": "/index.php?ac=jobad&id=55025",
        "PositionID": "55025",
        "OrganizationName": "Frankfurt",
        "PositionHiringYear": "2025",
        "UserArea": {
          "ProDivision": 10050
        },
        "CareerLevel": [
          {
            "Name": "Vice President"
          }
        ],
        "PublicationStartDate": "2025-04-01"
      },
      "RelevanceScore": 0,
      "RelevanceRank": 60
    },
    "specialist_analysis": {},
    "description_source": "web_scraping"
  }
}