{
  "job_metadata": {
    "job_id": "59386",
    "version": "1.0",
    "created_at": "2025-07-10T11:53:31.677314",
    "last_modified": "2025-07-10T11:53:31.677314",
    "source": "deutsche_bank_api",
    "processor": "enhanced_job_fetcher_v6.1",
    "status": "fetched"
  },
  "job_content": {
    "title": "Information Security Expert – Chief Security Office External Engagement (f/m/x)",
    "description": "Information Security Expert – Chief Security Office External Engagement (f/m/x) Job ID:R0360263 Full/Part-Time: Full-time Regular/Temporary: Regular Listed: 2025-06-13 Location: Frankfurt Position Overview *English version below*Details zur Rolle und wie sie ins Team passt Die Mission des Chief Security Office (CSO) ist, das Geschäft, die Kunden, die Vermögenswerte und die Mitarbeiter der Deutschen Bank zu schützen. Das External Engagement Team des CSO ist weltweit verantwortlich für die Steuerung der Interaktion mit wichtigen Interessengruppen – einschließlich Regulierungsbehörden, Kunden, Analysten, Investoren und Boards. Unsere Arbeit trägt dazu bei, Vertrauen aufzubauen und zu erhalten und dadurch das Geschäft der Bank zu unterstützen. Als Teil des Teams arbeiten Sie eng mit Fachexperten und dem Senior Management zusammen, um Berichte und Präsentationen für diese wichtigen Interessengruppen zu entwickeln und umzusetzen. Ihre HauptverantwortlichkeitenInhalte für die Interaktion mit wichtigen Interessengruppen des CSO recherchieren, schreiben und bearbeiten.Leitung von Workshops mit Fachexperten und dem Senior Management, um neue Inhalte zu entwickeln, zu verfeinern und fertigzustellen.Entwicklung von Agenda, Hauptbotschaften und Storyline, Briefing der Fachexperten, Entwurf und Erstellung von Präsentationen und Berichte, Steuerung der Timelines.Updates und Briefings für das Senior Management vorbereiten und durchführen.Kontinuierliche Aktualisierung und Verbesserung unserer Knowledge Base.Ihre Fähigkeiten und ErfahrungenStarke organisatorische und Projektmanagementfähigkeiten in multidisziplinären Konstellationen. Fähigkeit, sowohl unabhängig als auch kollaborativ in virtuellen globalen Teams Ergebnisse zu erzielen.Gutes Verständnis der relevanten globalen regulatorischen Umgebung, einschließlich der Berichtsanforderungen für Informationssicherheit.Hohe Qualität auch unter Zeitdruck und mit sich verändernden Prioritäten. Flexibler und professioneller Umgang auch mit mehreren kritischen Aufgaben gleichzeitig.Fähigkeit, vertrauensvolle Partnerschaften aufzubauen. Erfahrung in der Zusammenarbeit mit und Unterstützung von Senior Managements.Starke konzeptionelle und Story-Telling-Fähigkeiten. Nachweisbare Erfahrung in der erfolgreichen Kommunikation komplexer Themen, idealerweise in Englisch und Deutsch (schriftlich/mündlich).Freude an der Arbeit in einem dynamischen globalen Umfeld und ausgeprägtes Interesse an technischer Innovation.Idealerweise gute Kenntnisse in Informationssicherheit und verwandten Themen.Fähigkeit, valide Informationsquellen zu identifizieren und große Mengen an Informationen schnell zu analysieren.Eine begeisterungsfähige, neugierige und positive Einstellung. Bereitschaft, Verantwortung zu übernehmen. Pragmatische Arbeitsweise und hohe Zuverlässigkeit.Beherrschung digitaler Kommunikationstools, einschließlich Microsoft 365.Was wir Ihnen bietenWir bieten eine breite Palette von Leistungen, die all Ihre beruflichen und persönlichen Bedürfnisse abdecken.Emotional ausgeglichenEine positive Haltung hilft uns, die Herausforderungen des Alltags zu meistern – beruflich wie privat. Profitieren Sie von Angeboten wie Beratung in schwierigen Lebenssituationen und Angeboten zur Förderung mentaler Gesundheit.Körperlich fitMit Angeboten zur Aufrechterhaltung Ihrer persönlichen Gesundheit und einem förderlichen beruflichen Umfeld hilft Ihnen die Bank, körperlich fit zu bleiben. Profitieren Sie von Angeboten wie umfangreichen Check-up Untersuchungen, Impfangeboten und Beratung zur gesunden Lebensführung.Sozial vernetztDer Austausch mit anderen eröffnet uns neue Perspektiven, bringt uns beruflich wie persönlich voran und stärkt unser Selbstvertrauen und Wohlbefinden. Profitieren Sie von Angeboten wie Unterstützung durch den pme Familienservice, das FitnessCenter Job, flexible Arbeitszeitmodelle (bspw. Teilzeit, Jobtandem, hybrides Arbeiten) sowie einer umfangreichen Kultur der Vielfalt, Chancengleichheit und Teilhabe.Finanziell abgesichertDie Bank sichert Sie nicht nur während Ihrer aktiven Karriere, sondern auch für die Zukunft finanziell ab und unterstützt Ihre Flexibilität sowie Mobilität – egal ob privat oder beruflich. Profitieren Sie von Angeboten wie Beitragsplänen für Altersvorsorge, Bankdienstleistungen für Mitarbeiter*innen, Firmenfahrrad oder dem Deutschlandticket.Da die Benefits je nach Standort geringfügig variieren, gehen Sie bitte bei konkreten Fragen auf Ihre Recruiterin zu.Die Stelle wird in Voll- und in Teilzeit angeboten.Bei Fragen zum Rekrutierungsprozess steht Ihnen Ayse Kartal-Isik gerne zur Verfügung.Kontakt Ayse Kartal-Isik: +‍49 69 910-42410************************************************Details of the role and how it fits into the team The Chief Security Office's (CSO) mission is to protect Deutsche Bank's business, clients, assets, and employees. CSO´s External Engagement Team is globally responsible to manage interactions with key stakeholders including regulators, clients, analysts, investors and boards. Our delivery is essential to build and maintain trust and through that enable and support the bank´s business. As part of the team, you will be working closely with Subject Matter Experts and senior management to develop reports and presentations for these key stakeholders.Your key responsibilities Research, write and edit content for the Chief Security Offices´ key stakeholder engagements.Lead workshops with SMEs and senior management to develop, review and finalize new content.Develop the agenda, key messages and storyline, brief SMEs, draft and finalize presentations & reports, manage delivery timelines.Prepare and hold senior management updates and briefings.Contribute to the continuous update and enhancement of our knowledge base.Your skills and experiences Strong conceptual and storytelling skills. Demonstrable experience in successfully communicating complex subjects, ideally in English and German (written/oral).Thrive in a fast-paced global environment, keeping up with technical innovation. Ideally, you have good knowledge of information security and related topics.Ability to identify valid sources and analyse large volumes of information quickly.Good understanding of the relevant global regulatory environment, including the public reporting requirements for Information Security.High-quality approach, also under time pressure and with evolving priorities. Flexible and professional handling of multiple critical tasks simultaneously.Ability to establish trustful partnerships. Experience in working with and supporting senior management.An enthusiastic, curious, and positive attitude. Willingness to take on responsibility with a hands-on approach and high reliability.Strong organizational and project management skills in multi-disciplinary settings. Ability to achieve results both independently and collaboratively in virtual global teams.Proficiency in digital communication tools including Microsoft 365.What we offerWe provide you with a comprehensive portfolio of benefits and offerings to support both, your private and professional needs.Emotionally and mentally balancedA positive mind helps us master the challenges of everyday life – both professionally and privately. We offer consultation in difficult life situations as well as mental health awareness trainings.Physically thrivingWe support you in staying physically fit through an offering to maintain personal health and a professional environment. You can benefit from health check-ups; vaccination drives as well as advice on healthy living and nutrition.Socially connectedNetworking opens up new perspectives, helps us thrive professionally and personally as well as strengthens our self-confidence and well-being. You can benefit from PME family service, FitnessCenter Job, flexible working (e.g parttime, hybrid working, job tandem) as well as an extensive culture of diversity, equity and inclusion.Financially secureWe provide you with financial security not only during your active career but also for the future. You can benefit from offerings such as pension plans, banking services, company bicycle or “Deutschlandticket”.Since our offerings slightly vary across locations, please contact your recruiter with specific questions.This job is available in full and parttime.In case of any recruitment related questions, please get in touch with Ayse Kartal-IsikContact Ayse Kartal-Isik: +‍49 69 910-42410 Wir streben eine Unternehmenskultur an, in der wir gemeinsam jeden Tag das Beste geben. Dazu gehören verantwortungsvolles Handeln, wirtschaftliches Denken, Initiative ergreifen und zielgerichtete Zusammenarbeit.Gemeinsam teilen und feiern wir die Erfolge unserer Mitarbeiter*innen. Gemeinsam sind wir die Deutsche Bank Gruppe.Wir begrüßen Bewerbungen von allen Menschen und fördern ein positives, faires und integratives Arbeitsumfeld.",
    "requirements": [
      "information security and related topics.Ability to identify valid sources and analyse large volumes of information quickly.Good understanding of the relevant global regulatory environment",
      "working with and supporting senior management.An enthusiastic",
      "successfully communicating complex subjects"
    ],
    "location": {
      "city": "Frankfurt",
      "state": "Hessen",
      "country": "Deutschland",
      "remote_options": false
    },
    "employment_details": {
      "type": "Unbefristet",
      "schedule": "Vollzeit",
      "career_level": "Vice President",
      "salary_range": null,
      "benefits": []
    },
    "organization": {
      "name": "Deutsche Bank",
      "division": "Frankfurt",
      "division_id": 10052
    },
    "posting_details": {
      "publication_date": "2025-06-13",
      "position_uri": "/index.php?ac=jobad&id=59386",
      "hiring_year": "2025"
    }
  },
  "evaluation_results": {
    "cv_to_role_match": null,
    "match_confidence": null,
    "evaluation_date": null,
    "evaluator": null,
    "domain_knowledge_assessment": null,
    "decision": {
      "apply": null,
      "rationale": null,
      "estimated_prep_time": null
    },
    "strengths": [],
    "weaknesses": []
  },
  "processing_log": [
    {
      "timestamp": "2025-07-10T11:53:31.677314",
      "action": "job_fetched",
      "processor": "enhanced_job_fetcher_v6.1",
      "status": "success",
      "details": "Successfully fetched job 59386 from Deutsche Bank API"
    },
    {
      "timestamp": "2025-07-10T11:53:31.677314",
      "action": "description_enriched",
      "processor": "web_scraper",
      "status": "success",
      "details": "Successfully fetched job description (8880 characters)"
    }
  ],
  "raw_source_data": {
    "api_response": {
      "MatchedObjectId": "59386",
      "MatchedObjectDescriptor": {
        "PositionOfferingType": [
          {
            "Name": "Unbefristet"
          }
        ],
        "PositionSchedule": [
          {
            "Name": "Vollzeit"
          }
        ],
        "PublicationChannel": [
          {
            "StartDate": "2025-06-13"
          }
        ],
        "PositionTitle": "Information Security Expert – Chief Security Office External Engagement (f/m/x)",
        "PositionLocation": [
          {
            "CityName": "Frankfurt",
            "CountrySubDivisionName": "Hessen",
            "CountryName": "Deutschland"
          }
        ],
        "PositionURI": "/index.php?ac=jobad&id=59386",
        "PositionID": "59386",
        "OrganizationName": "Frankfurt",
        "PositionHiringYear": "2025",
        "UserArea": {
          "ProDivision": 10052
        },
        "CareerLevel": [
          {
            "Name": "Vice President"
          }
        ],
        "PublicationStartDate": "2025-06-13"
      },
      "RelevanceScore": 0,
      "RelevanceRank": 45
    },
    "specialist_analysis": {},
    "description_source": "web_scraping"
  }
}