{
  "job_metadata": {
    "job_id": "64808",
    "version": "1.0",
    "created_at": "2025-07-06T18:49:49.914943",
    "last_modified": "2025-07-06T18:49:49.914943",
    "source": "deutsche_bank_api",
    "processor": "enhanced_job_fetcher_v6.1",
    "status": "fetched"
  },
  "job_content": {
    "title": "DWS - Business Functional Analyst (E-invoicing) (m/w/d)",
    "description": "DWS - Business Functional Analyst (E-invoicing) (m/w/d) Job ID:R0390307 Full/Part-Time: Full-time Regular/Temporary: Temporary Listed: 2025-06-30 Location: Frankfurt Position Overview Über die DWSHeutzutage sind die Märkte einer ganzen Reihe von Risiken ausgesetzt - aber auch einer ganzen Reihe von Chancen. Die Chance, anders zu innovieren. Die Chance, verantwortungsvoll zu investieren. Und die Chance, etwas zu verändern.Kommen Sie zu DWS und werden Sie Teil eines branchenführenden Unternehmens mit globaler Präsenz. Hier werden Sie bestärkt, ehrgeizige Programme zu leiten, um die Zukunft des Investierens zu gestalten und unsere Kunden, lokale Gemeinschaften und die Umwelt zu unterstützen.Wir suchen kreative Denker und Innovatoren, um die Chancen von morgen zu nutzen und die bestmögliche Grundlage für die finanzielle Zukunft unserer Kunden zu schaffen. Aus diesem Grund sind wir \"Investors for a new now\".Im Gegenzug bieten wir Ihnen die Plattform, die Sie brauchen, um etwas zu bewirken, indem Sie mit einigen der größten Vordenker der Branche zusammenarbeiten.Das ist Ihre Chance, Ihre Ziele zu erreichen und eine außergewöhnliche Karriere zu führen. Das ist Ihre Chance, in Ihre Zukunft zu investieren.Lesen Sie hier mehr über DWS und wer wir sind (www.dws.com/de-de/)Team- / Divisionbeschreibung EMEA Trailer and Management Fee & US Billing Unit - Verantwortungsbereich:Das Global Invoice Verification Team als Teil des Geschäftsbereichs Investment Operations (DWS COO Division) spielt eine zentrale und kritische Rolle in der Wertschöpfungskette für globale Publikums-; Spezialfonds sowie Mandate der DWS.Das Team ist zuständig für die:Abwicklung von Rechnungen von globalen Vendoren und Dienstleistern in Zusammenarbeit mit PWC, den operativen Fachabteilungen und Global Financekorrekte Parametrisierung, Berechnung, Prüfung der Verbindlichkeiten im DWS-eigenen System VPS, SimCorp Dimension (SCD); Revenue Manager; DB-Buyer und ihrer Instruktion mit Schnittstellen zu SAPR3 oder SAP4Hanadie Verarbeitung von Rückstellungen und forcast Reports inklusive der Datenlieferungen an die DWS-Finanzabteilungdie Validierung und Zahlung verschiedener RechnungenIm Rahmen des Tagesgeschäfts unterstützt das Team verschiedene Front-, Middle- und Back-Office Bereiche innerhalb der DWS. Eine Zusammenarbeit mit diversen externen und internen, globalen Stakeholdern, wie Relationship Managern, Finance, Steuern, Vertragsmanagement, Verwahrstellen und Beratern ist Bestandteil der täglichen Aufgaben.Das Team ist global aufgestellt und beschäftigt Mitarbeitende an den Standorten in Frankfurt, Luxembourg, USA, den Philippinen, sowie Indien.Rollenbeschreibung Als Business Functional Analyst (Functional Role Title: Operations Specialist) (E-invoicing) (m/w/d), zeigen Sie sich im Projekt verantwortlich für den effizienten Aufsatz wiederkehrender In- und Outbound e-invoicing Prozesse, Kontrollen und Reporting. Sie arbeiten mit Subject Matter Experts, allen globalen Stakeholdern und dem DWS IT Department die Systemlandschaft und das TOM aus und gewähleisten das Erreichen der gemeinsam gesteckten Ziele innerhalb der vorgegebenen Zeitlinien.Zu Ihren Aufgaben zählen:Projektverantwortung für den “long term e-invoicing inbound & outbound DWS e-invoices ” ProzessDefinition, operatives und technisches Setup der e-invoicing Regularie in Kooperation mit allen Operations Units, Frankfurt Finance, Frankfurt Illiquid Alternative Investment, Frankfurt TAX Unit, Finanzämtern, IT und allen weiteren Stakeholdern.Screening des Deutschen und Europäischen Marktes nach „E-Invoicing new format transformation systems“ in Kooperation mit global DWS Procurement, Finance & ITOnboarding und Testing der potentiellen neuen SoftwareDesign, Abstimmung und Konzeption des BRDs für notwendige Anpassungen interner SystemeSie fungieren als Schnittstelle zwischen den Operations- und IT Subject Matter ExpertsEnge Zusammenarbeit mit IT-EntwicklernEinholung und Gewährleisung der nachhaltigen, strategischen Zustimmung von IT Architecture und von allen zuständigen Enscheidungsträgern zum Projektumfang und dem long-term Setup, in Übereinstimmung mit DB-stretegischem Fokus.Analyse, Organisation, Digitalisierung und Implementierung von “e-invoice verification operations BAU-process centralization” in Kooperation mit den DWS Global Fee & Billing “Golden Source VPS” und DWS Global SAP4H Transformation ProjektenEntwicklung eines automatisierten Oversight Prozesses (KPI, KRI, MIS, Dashboards, Mailticket-tool)Organisieren der Prozessdokumentation (), des Trainings im Team mit operativen Subject Matter Experts und Durchführung des abnehmenden internal AuditsDefinieren und dokumetnieren eines Business Continuity PlansGewährleistung der Verfügbarkeit aller erforderlichen Testate von Legal, Risk, Compliance und Internal Audit.Abstimmung und Koordination interner und externer Kommunikation mit DWS Coverage, Relationship Management, Product, German Vendors und allen anderen Stakeholdern die non DB-Buyer Rechnungen an die DWS sendenPrüfung potentieller Ausweitung des e-invoicing auf EMEA und anderer globaler DWS EntitiesEntwicklung und Implementierung eines skallierbaren und global multiplizierbaren ProzessesKooperation mit der Unternehmenssteuerabteilung unter Berücksichtigungn der finalen Zielsetzung und der rechtlichen Anfordeurng der Imlementierung eines „ real time tax reporting“Automatisierung und Implementierung eines Autobuchung & -reconprocesses als Schnittstelle zwischen Operations/Finance/Steuerabteilung & FinanzamtProjektdokumentationWir suchen:Erfolgreich abgeschlossenes wirtschaftswissenschaftliches Studium, idealerweise mit Schwepunkt IT oder vergleichbare Ausbildung und BerufserfahrungErfahrung im Bereich Operations, Finance und Projekt Management im Asset Management BereichBuchhalterische Kenntnisse, vorzugsweise im Bereich der Fonds- oder FinanzbuchhaltungProdukt- und Systemkenntnisse (SimCorp Dimension/Aladdin/SAP)Entwicklerkenntnisse und Erfahrung in globalen IT Schnittstellen- und SystemitegrationsprojektenExcelente Kenntnisse in MS Office-AnwendungenAusgeprägte lösungs- und serviceorientierte Kommunikationsfähigkeiten, sehr gutes Deutsch und Englisch in Wort und SchriftErfahrung im Umgang mit internen und externen Kunden sowie Dienstleistern im ProjektenHilfsbereitschaft und TeamfähigkeitGroße Lernbereitschaft und Aufgeschlossenheit, neue Wege zu gehenAufgeschlossenheit und Fähigkeit, innerhalb des Teams Informationen auszutauschen sowie Fachwissen und Kompetenz zu vermittelnEin hohes Maß an Eigeninitiative sowie wohlüberlegter, selbstbewusster EntscheidungsfindungLösungsorientierte Bereitschaft den Status Quo zu verbessern und messbare Resultate zu erzielenPotential für Weiterentwicklung und hohes VerantwortungsbewusstseinDiese Stelle ist auf zwei Jahre befristet. Eine erfolgreiche Einstellung erfolgt unter dem Functional Role Title: Operations Specialist (m/w/d)Ausschreibungszeitraum: 23.6.2025 bis auf weiteresWir bieten Ihnen:Ohne den Ehrgeiz unserer Mitarbeiter wären unsere Erfolge nicht möglich. Und es ist uns wichtig, dass Sie gerne zur Arbeit kommen – gesund, glücklich und wertgeschätzt. Bei der DWS haben Sie Zugriff auf eine Reihe von Benefits, aus denen Sie wählen können und die speziell auf Ihren Lebensstil abgestimmt sind. Egal, ob Sie sich für die Gesundheitsversorgung oder betriebliche Vergünstigungen interessieren oder über Ihre Altersvorsorge nachdenken, es ist für jeden etwas dabei.Einige unserer Benefits:Leistungen zur körperlichen und geistigen Gesundheit, einschließlich (aber nicht beschränkt auf) der gesetzlichen Krankenversicherung (BKK), Krankengeld und Support-Hotlines für MitarbeiterFamilienfreundliche Leistungen, einschließlich großzügiger Elternzeitpakete (unterstützt alle Varianten von Familienformen) und Unterstützung bei der Suche nach Kinderbetreuungsmöglichkeiten, einschließlich des DWS-eigenen KindergartenservicesEine Vielzahl an Pensionsplänen, persönlichen Budgetkonten zur Ermöglichung von Sabbaticals oder vorzeitigem Ruhestand sowie vermögenswirksamen LeistungenDie Möglichkeit, unsere CSR-Strategie zu unterstützen, die sich auf die Bekämpfung des Klimawandels und die Erreichung größerer sozialer Gerechtigkeit konzentriert. Sie können an unsere Partnerorganisationen spenden oder sich an Corporate-Volunteering-Möglichkeiten in Ihren lokalen Gemeinden beteiligen, indem Sie uns vor Ort unterstützenLeistungen zur Mobilität, beispielsweise ein subventioniertes Deutschlandticket sowie Angebote zu Firmenwagen und JobRadDas aktuelle Hybrid-Arbeitsmodell der DWS ist darauf ausgelegt, die Balance zwischen persönlicher Zusammenarbeit und Engagement im Büro zu finden, die den Kern unserer Arbeitskultur ausmacht. Wir setzen uns für die Unterstützung flexibler und hybrider Arbeitsvereinbarungen auf der ganzen Welt ein. Abhängig von dem Standort oder der Stelle, auf die Sie sich bewerben, wird die Aufteilung zwischen der Arbeit im Büro und der Arbeit zu Hause im Rahmen Ihres Bewerbungs- und Interviewprozesses besprochen.Wir werden unsere Arbeitsumgebungen und -methoden weiterhin überprüfen und weiterentwickeln, um bestmögliche Arbeitsbedingungen für unsere Mitarbeiter zu schaffen.Wenn Sie aus irgendeinem Grund, einschließlich oder im Zusammenhang mit einer Behinderung oder einem langfristigen Gesundheitszustand, Anpassungen oder Änderungen am Bewerbungsprozess benötigen, wenden Sie sich bitte an Ihren Recruiter und teilen Sie uns mit, welche Unterstützung Sie möglicherweise benötigen. Beispiele für Anpassungen sind die Änderung des Interviewformats oder die Bereitstellung von Unterstützung in den Räumlichkeiten der DWS. Dies hat keine Auswirkungen auf Ihre Bewerbung und Ihr Rekrutierungsteam wird die Optionen mit Ihnen besprechen. Wir streben eine Unternehmenskultur an, in der wir gemeinsam jeden Tag das Beste geben. Dazu gehören verantwortungsvolles Handeln, wirtschaftliches Denken, Initiative ergreifen und zielgerichtete Zusammenarbeit.Gemeinsam teilen und feiern wir die Erfolge unserer Mitarbeiter*innen. Gemeinsam sind wir die Deutsche Bank Gruppe.Wir begrüßen Bewerbungen von allen Menschen und fördern ein positives, faires und integratives Arbeitsumfeld.",
    "requirements": [],
    "location": {
      "city": "Frankfurt",
      "state": "Hessen",
      "country": "Deutschland",
      "remote_options": false
    },
    "employment_details": {
      "type": "Befristet",
      "schedule": "Vollzeit",
      "career_level": "Assistant Vice President",
      "salary_range": null,
      "benefits": []
    },
    "organization": {
      "name": "Deutsche Bank",
      "division": "Frankfurt",
      "division_id": 4
    },
    "posting_details": {
      "publication_date": "2025-06-30",
      "position_uri": "/index.php?ac=jobad&id=64808",
      "hiring_year": "2025"
    }
  },
  "evaluation_results": {
    "cv_to_role_match": null,
    "match_confidence": null,
    "evaluation_date": null,
    "evaluator": null,
    "domain_knowledge_assessment": null,
    "decision": {
      "apply": null,
      "rationale": null,
      "estimated_prep_time": null
    },
    "strengths": [],
    "weaknesses": []
  },
  "processing_log": [
    {
      "timestamp": "2025-07-06T18:49:49.914943",
      "action": "job_fetched",
      "processor": "enhanced_job_fetcher_v6.1",
      "status": "success",
      "details": "Successfully fetched job 64808 from Deutsche Bank API"
    },
    {
      "timestamp": "2025-07-06T18:49:49.914943",
      "action": "description_enriched",
      "processor": "web_scraper",
      "status": "success",
      "details": "Successfully fetched job description (10191 characters)"
    }
  ],
  "raw_source_data": {
    "api_response": {
      "MatchedObjectId": "64808",
      "MatchedObjectDescriptor": {
        "PositionOfferingType": [
          {
            "Name": "Befristet"
          }
        ],
        "PositionSchedule": [
          {
            "Name": "Vollzeit"
          }
        ],
        "PublicationChannel": [
          {
            "StartDate": "2025-06-30"
          }
        ],
        "PositionTitle": "DWS - Business Functional Analyst (E-invoicing) (m/w/d)",
        "PositionLocation": [
          {
            "CityName": "Frankfurt",
            "CountrySubDivisionName": "Hessen",
            "CountryName": "Deutschland"
          }
        ],
        "PositionURI": "/index.php?ac=jobad&id=64808",
        "PositionID": "64808",
        "OrganizationName": "Frankfurt",
        "PositionHiringYear": "2025",
        "UserArea": {
          "ProDivision": 4
        },
        "CareerLevel": [
          {
            "Name": "Assistant Vice President"
          }
        ],
        "PublicationStartDate": "2025-06-30"
      },
      "RelevanceScore": 0,
      "RelevanceRank": 13
    },
    "specialist_analysis": {},
    "description_source": "web_scraping"
  }
}