{
  "job_metadata": {
    "job_id": "63625",
    "version": "1.0",
    "created_at": "2025-07-10T12:15:04.820462",
    "last_modified": "2025-07-10T12:15:04.820462",
    "source": "deutsche_bank_api",
    "processor": "enhanced_job_fetcher_v6.1",
    "status": "fetched"
  },
  "job_content": {
    "title": "Senior Manager Indirect Tax Financial Services (d/m/w)",
    "description": "Senior Manager Indirect Tax Financial Services (d/m/w) Job ID:R0387373 Full/Part-Time: Full-time Regular/Temporary: Regular Listed: 2025-05-27 Location: Frankfurt Position Overview Bereich & TeamGroup Tax kümmert sich um die steuerlichen Angelegenheiten der Deutschen Bank. Das USt-Team ist Bestandteil von Group Tax. Das USt-Team ist verantwortlich für die umsatzsteuerliche Beratung der Geschäftsbereiche und Infrastrukturfunktionen in Deutschland für nationale und internationale Sachverhalte, erfüllt die umsatzsteuerlichen Meldeverpflichtungen der Bank und betreut die steuerliche Betriebsprüfung und Rechtsbehelfsverfahren. Zur Verstärkung unseres USt-Teams suchen wir einen erfahrenen USt-Berater und -Manager (m/w/d). Wir sind ein Team von erfahrenen Umsatzsteuerspezialisten, die die Deutsche Bank in der Region Deutschland in sämtlichen umsatzsteuerlichen Belangen betreut.Ihre AufgabenSie überwachen aktuelle Gesetzesvorhaben und daran anschließend die Entwicklung und Implementierung der erforderlichen Umsetzung in der Bank, leisten Unterstützung bei der Implementierung in die IT und führen Trainings im Bereich USt durchSie analysieren und bewerten steuerliche Risiken und Chancen und führen USt-Due-Diligence-Prüfungen durch und unterstützen bei steuerlichen Betriebsprüfungen. Dabei arbeiten Sie mit internen und externen Stakeholdern, einschließlich Steuerbehörden zusammenAls zentraler Ansprechpartner für USt-Themen verstehen Sie den gesamten Buchungszyklus eines Produkts angefangen von den operativen Systemen bis hin zur SteuererklärungSie arbeiten mit bei Projekten zur Konzeption bzw. Anpassung von Geschäftsprozessen unter Einhaltung umsatzsteuerlicher Anforderungen sowie zur Weiterentwicklung der Digitalisierung der USt-FunktionAuch die Definition und Weiterentwicklung umsatzsteuerlicher Prozesse im ERP-System sowie die Überwachung der Umsatzsteuer-Compliance sowie die kontinuierliche Dokumentation der verwendeten IT-Applikationen zählen zu Ihrer VerantwortungIhr ProfilAbgeschlossenes Studium der Betriebswirtschaft, Rechtswissenschaften oder eine vergleichbare Qualifikation. Steuerberater-Qualifikation wünschenswert.Mehrjährige Berufserfahrung in der USt-Beratung mit fundierten Kenntnissen des nationalen und internationalen Mehrwertsteuerrechts, idealerweise im Financial Services SektorHervorragende Problemlösungskompetenz mit ausgeprägten analytischen Fähigkeiten und einer strukturierten ArbeitsweiseExzellente Kommunikations- und PräsentationsfähigkeitenTeamfähigkeit und eine hohe KundenorientierungFließende Deutsch- und Englischkenntnisse in Wort und SchriftWas wir Ihnen bietenWir bieten eine breite Palette von Leistungen, die all Ihre beruflichen und persönlichen Bedürfnisse abdecken.Emotional ausgeglichenEine positive Haltung hilft uns, die Herausforderungen des Alltags zu meistern – beruflich wie privat. Profitieren Sie von Angeboten wie Beratung in schwierigen Lebenssituationen und Angeboten zur Förderung mentaler Gesundheit.Körperlich fitMit Angeboten zur Aufrechterhaltung Ihrer persönlichen Gesundheit und einem förderlichen beruflichen Umfeld hilft Ihnen die Bank, körperlich fit zu bleiben. Profitieren Sie von Angeboten wie umfangreichen Check-up Untersuchungen, Impfangeboten und Beratung zur gesunden Lebensführung.Sozial vernetztDer Austausch mit anderen eröffnet uns neue Perspektiven, bringt uns beruflich wie persönlich voran und stärkt unser Selbstvertrauen und Wohlbefinden. Profitieren Sie von Angeboten wie Unterstützung durch den pme Familienservice, das FitnessCenter Job, flexible Arbeitszeitmodelle (bspw. Teilzeit, Jobtandem, hybrides Arbeiten) sowie einer umfangreichen Kultur der Vielfalt, Chancengleichheit und Teilhabe.Finanziell abgesichertDie Bank sichert Sie nicht nur während Ihrer aktiven Karriere, sondern auch für die Zukunft finanziell ab und unterstützt Ihre Flexibilität sowie Mobilität – egal ob privat oder beruflich. Profitieren Sie von Angeboten wie Beitragsplänen für Altersvorsorge, Bankdienstleistungen für Mitarbeiter*innen, Firmenfahrrad oder dem Deutschlandticket.Da die Benefits je nach Standort geringfügig variieren, gehen Sie bitte bei konkreten Fragen auf Ihre Recruiter / Ihre Recruiterin zu.Die Stelle wird in Voll- und in Teilzeit angeboten.Bei Fragen zum Rekrutierungsprozess steht Ihnen Evangelia Tseliou gerne zur Verfügung.Kontakt Evangelia Tseliou: +49 69 910-45463 Wir streben eine Unternehmenskultur an, in der wir gemeinsam jeden Tag das Beste geben. Dazu gehören verantwortungsvolles Handeln, wirtschaftliches Denken, Initiative ergreifen und zielgerichtete Zusammenarbeit.Gemeinsam teilen und feiern wir die Erfolge unserer Mitarbeiter*innen. Gemeinsam sind wir die Deutsche Bank Gruppe.Wir begrüßen Bewerbungen von allen Menschen und fördern ein positives, faires und integratives Arbeitsumfeld.",
    "requirements": [],
    "location": {
      "city": "Frankfurt",
      "state": "Hessen",
      "country": "Deutschland",
      "remote_options": false
    },
    "employment_details": {
      "type": "Unbefristet",
      "schedule": "Vollzeit",
      "career_level": "Vice President",
      "salary_range": null,
      "benefits": []
    },
    "organization": {
      "name": "Deutsche Bank",
      "division": "Frankfurt",
      "division_id": 8
    },
    "posting_details": {
      "publication_date": "2025-05-27",
      "position_uri": "/index.php?ac=jobad&id=63625",
      "hiring_year": "2025"
    }
  },
  "evaluation_results": {
    "cv_to_role_match": null,
    "match_confidence": null,
    "evaluation_date": null,
    "evaluator": null,
    "domain_knowledge_assessment": null,
    "decision": {
      "apply": null,
      "rationale": null,
      "estimated_prep_time": null
    },
    "strengths": [],
    "weaknesses": []
  },
  "processing_log": [
    {
      "timestamp": "2025-07-10T12:15:04.820462",
      "action": "job_fetched",
      "processor": "enhanced_job_fetcher_v6.1",
      "status": "success",
      "details": "Successfully fetched job 63625 from Deutsche Bank API"
    },
    {
      "timestamp": "2025-07-10T12:15:04.820462",
      "action": "description_enriched",
      "processor": "web_scraper",
      "status": "success",
      "details": "Successfully fetched job description (4818 characters)"
    }
  ],
  "raw_source_data": {
    "api_response": {
      "MatchedObjectId": "63625",
      "MatchedObjectDescriptor": {
        "PositionOfferingType": [
          {
            "Name": "Unbefristet"
          }
        ],
        "PositionSchedule": [
          {
            "Name": "Vollzeit"
          }
        ],
        "PublicationChannel": [
          {
            "StartDate": "2025-05-27"
          }
        ],
        "PositionTitle": "Senior Manager Indirect Tax Financial Services (d/m/w)",
        "PositionLocation": [
          {
            "CityName": "Frankfurt",
            "CountrySubDivisionName": "Hessen",
            "CountryName": "Deutschland"
          }
        ],
        "PositionURI": "/index.php?ac=jobad&id=63625",
        "PositionID": "63625",
        "OrganizationName": "Frankfurt",
        "PositionHiringYear": "2025",
        "UserArea": {
          "ProDivision": 8
        },
        "CareerLevel": [
          {
            "Name": "Vice President"
          }
        ],
        "PublicationStartDate": "2025-05-27"
      },
      "RelevanceScore": 0,
      "RelevanceRank": 50
    },
    "specialist_analysis": {},
    "description_source": "web_scraping"
  }
}