{
  "job_metadata": {
    "job_id": "64451",
    "version": "1.0",
    "created_at": "2025-07-10T11:42:58.099386",
    "last_modified": "2025-07-10T11:42:58.099386",
    "source": "deutsche_bank_api",
    "processor": "enhanced_job_fetcher_v6.1",
    "status": "fetched"
  },
  "job_content": {
    "title": "Technology Operations Lead – SAP Software Logistics (f/m/x)",
    "description": "Technology Operations Lead – SAP Software Logistics (f/m/x) Job ID:R0387663 Full/Part-Time: Full-time Regular/Temporary: Regular Listed: 2025-06-17 Location: Frankfurt Position Overview *English version below*Über das TeamTDI Group Technology Infrastructure (GTI) – Application Centric Products – SAP Services:SAP Services fungiert als zentraler Service Provider für alle SAP-Plattform-Aktivitäten innerhalb der Deutschen Bank. Die Dienstleistungen werden für alle Bereiche mit SAP-Anwendungen wie Banking Germany, Finance, HR, DWS, BHW und SAP HANA erbracht.Ihre AufgabenSie werden für das SAP Transport Management verantwortlich sein, SAP-Systeminstallationen und Upgrades unterstützen und die Einhaltung von Vorschriften der Finanzindustrie sicherstellen:Management des SAP Transport Management Systems (TMS), um eine sichere und konforme Bewegung von Konfigurationen und individuellen Entwicklungen zwischen den SAP-Umgebungen zu gewährleistenPlanung, Implementierung und Verwaltung der SAP Software Logistics-Prozesse (z.B. Transport Management, Change- und Release-Management, CTS+ für nicht-ABAP)Optimierung von Transportstrategien und Sicherstellung der Einhaltung von Best PracticesÜberwachung des SAP Solution Managers (SolMan) für Systemüberwachung, Change Request Management (ChaRM) und Incident ResolutionIntegration von Audit-Anforderungen & SDLC-Prozesskontrollen in den SAP-Entwicklungs- und Deployment-WorkflowTroubleshooting und Behebung von Transportfehlern, Deployment-Problemen, Systeminkonsistenzen und Performance-ProblemenUmsetzung der Strategie zur Modernisierung des SAP Software Development Lifecycles für alle SAP-Anwendungen der Deutschen BankIhre Fähigkeiten & ErfahrungBachelor-Abschluss in Informatik, Informationstechnologie, Finanzen oder einem verwandten BereichMindestens 2 Jahre Erfahrung in SAP Software-Logistik, SAP Basis oder SAP-SystemadministrationPraktische Erfahrung mit SAP TMS, SUM, SolMan (ChaRM) und CTS+Umfassendes Verständnis von cloudbasierten SAP-Umgebungen (SAP BTP, AWS, Azure oder GCP)Verständnis von SAP HANA, SAP S/4HANA-Modulen und SAP Fiori-Anwendungen sowie Vertrautheit mit DevOps-Tools (Jenkins, Git, Ansible) für SAP-Automatisierung ist von VorteilStarke Problemlösungs- und Analysefähigkeiten sowie ausgezeichnete Kommunikationsfähigkeiten zur Zusammenarbeit mit IT-TeamsSprachkenntnisse: Englisch und DeutschWas wir Ihnen bietenWir bieten eine breite Palette von Leistungen, die all Ihre beruflichen und persönlichen Bedürfnisse abdecken.Emotional ausgeglichenEine positive Haltung hilft uns, die Herausforderungen des Alltags zu meistern – beruflich wie privat. Profitieren Sie von Angeboten wie Beratung in schwierigen Lebenssituationen und Angeboten zur Förderung mentaler Gesundheit.Körperlich fitMit Angeboten zur Aufrechterhaltung Ihrer persönlichen Gesundheit und einem förderlichen beruflichen Umfeld hilft Ihnen die Bank, körperlich fit zu bleiben. Profitieren Sie von Angeboten wie umfangreichen Check-up Untersuchungen, Impfangeboten und Beratung zur gesunden Lebensführung.Sozial vernetztDer Austausch mit anderen eröffnet uns neue Perspektiven, bringt uns beruflich wie persönlich voran und stärkt unser Selbstvertrauen und Wohlbefinden. Profitieren Sie von Angeboten wie Unterstützung durch den pme Familienservice, das FitnessCenter Job, flexible Arbeitszeitmodelle (bspw. Teilzeit, Jobtandem, hybrides Arbeiten) sowie einer umfangreichen Kultur der Vielfalt, Chancengleichheit und Teilhabe.Finanziell abgesichertDie Bank sichert Sie nicht nur während Ihrer aktiven Karriere, sondern auch für die Zukunft finanziell ab und unterstützt Ihre Flexibilität sowie Mobilität – egal ob privat oder beruflich. Profitieren Sie von Angeboten wie Beitragsplänen für Altersvorsorge, Bankdienstleistungen für Mitarbeiter*innen, Firmenfahrrad oder dem Deutschlandticket.Da die Benefits je nach Standort geringfügig variieren, gehen Sie bitte bei konkreten Fragen auf Ihre Recruiter / Ihre Recruiterin zu.Die Stelle wird in Voll- und in Teilzeit angeboten.Bei Fragen zum Rekrutierungsprozess steht Ihnen Michaela Peschke gerne zur Verfügung.Kontakt Michaela Peschke: 069-910-43951--------------------------------------------------------------------------------------------------------------------------------About the teamTDI Group Technology Infrastructure (GTI) – Application Centric Products – SAP Services:SAP Services acts as the central service provider for all SAP platforms within Deutsche Bank. Services are provided for all areas with SAP applications, such as Banking Germany, Finance, HR, DWS, BHW, and SAP HANA.Your key responsibilitiesYou will be responsible for SAP transport management, supporting SAP system installations and upgrades, and ensuring compliance with financial industry regulations:Manage SAP Transport Management System (TMS) to ensure secure and compliant movement of configurations and custom developments across SAP environmentsPlan, implement, and manage SAP Software Logistics processes (e.g., Transport Management, Change & Release Management, CTS+ for non-ABAP)Optimize transport strategies and ensure compliance with best practicesOversee SAP Solution Manager (SolMan) for system monitoring, change request management (ChaRM), and incident resolutionIntegrate Audit-Requirements & SDLC-process-controls in SAP Development & Deployment-WorkflowTroubleshoot and resolve transport failures, deployment issues, system inconsistencies, and performance issuesExecute on the strategy to modernize the SAP Software Development Lifecycle for all SAP applications in Deutsche BankYour skills & experiencesBachelor’s degree in computer science, Information Technology, Finance, or a related field2+ years of experience in SAP Software Logistics, SAP Basis, or SAP System AdministrationHands-on experience with SAP TMS, SUM, SolMan (ChaRM), and CTS+Strong understanding of cloud-based SAP environments (SAP BTP, AWS, Azure, or GCP)Understanding of SAP HANA, SAP S/4HANA modules, and SAP Fiori applications and familiarity with DevOps tools (Jenkins, Git, Ansible) for SAP automation is a plusStrong problem-solving and analytical skills and excellent communication skills to collaborate with IT teamsLanguage skills: English and GermanWhat we offerWe provide you with a comprehensive portfolio of benefits and offerings to support both, your private and professional needs.Emotionally and mentally balancedA positive mind helps us master the challenges of everyday life – both professionally and privately. We offer consultation in difficult life situations as well as mental health awareness trainings.Physically thrivingWe support you in staying physically fit through an offering to maintain personal health and a professional environment. You can benefit from health check-ups; vaccination drives as well as advice on healthy living and nutrition.Socially connectedNetworking opens up new perspectives, helps us thrive professionally and personally as well as strengthens our self-confidence and well-being. You can benefit from PME family service, FitnessCenter Job, flexible working (e.g parttime, hybrid working, job tandem) as well as an extensive culture of diversity, equity and inclusion.Financially secureWe provide you with financial security not only during your active career but also for the future. You can benefit from offerings such as pension plans, banking services, company bicycle or “Deutschlandticket”.Since our offerings slightly vary across locations, please contact your recruiter with specific questions.This job is available in full and parttime.In case of any recruitment related questions, please get in touch with Michaela Peschke.Contact Michaela Peschke: 069-910-43951 Wir streben eine Unternehmenskultur an, in der wir gemeinsam jeden Tag das Beste geben. Dazu gehören verantwortungsvolles Handeln, wirtschaftliches Denken, Initiative ergreifen und zielgerichtete Zusammenarbeit.Gemeinsam teilen und feiern wir die Erfolge unserer Mitarbeiter*innen. Gemeinsam sind wir die Deutsche Bank Gruppe.Wir begrüßen Bewerbungen von allen Menschen und fördern ein positives, faires und integratives Arbeitsumfeld.",
    "requirements": [
      "SAP Software Logistics"
    ],
    "location": {
      "city": "Frankfurt",
      "state": "Hessen",
      "country": "Deutschland",
      "remote_options": false
    },
    "employment_details": {
      "type": "Unbefristet",
      "schedule": "Vollzeit",
      "career_level": "Vice President",
      "salary_range": null,
      "benefits": []
    },
    "organization": {
      "name": "Deutsche Bank",
      "division": "Frankfurt",
      "division_id": 10052
    },
    "posting_details": {
      "publication_date": "2025-06-17",
      "position_uri": "/index.php?ac=jobad&id=64451",
      "hiring_year": "2025"
    }
  },
  "evaluation_results": {
    "cv_to_role_match": null,
    "match_confidence": null,
    "evaluation_date": null,
    "evaluator": null,
    "domain_knowledge_assessment": null,
    "decision": {
      "apply": null,
      "rationale": null,
      "estimated_prep_time": null
    },
    "strengths": [],
    "weaknesses": []
  },
  "processing_log": [
    {
      "timestamp": "2025-07-10T11:42:58.099386",
      "action": "job_fetched",
      "processor": "enhanced_job_fetcher_v6.1",
      "status": "success",
      "details": "Successfully fetched job 64451 from Deutsche Bank API"
    },
    {
      "timestamp": "2025-07-10T11:42:58.099386",
      "action": "description_enriched",
      "processor": "web_scraper",
      "status": "success",
      "details": "Successfully fetched job description (8133 characters)"
    }
  ],
  "raw_source_data": {
    "api_response": {
      "MatchedObjectId": "64451",
      "MatchedObjectDescriptor": {
        "PositionOfferingType": [
          {
            "Name": "Unbefristet"
          }
        ],
        "PositionSchedule": [
          {
            "Name": "Vollzeit"
          }
        ],
        "PublicationChannel": [
          {
            "StartDate": "2025-06-17"
          }
        ],
        "PositionTitle": "Technology Operations Lead – SAP Software Logistics (f/m/x)",
        "PositionLocation": [
          {
            "CityName": "Frankfurt",
            "CountrySubDivisionName": "Hessen",
            "CountryName": "Deutschland"
          }
        ],
        "PositionURI": "/index.php?ac=jobad&id=64451",
        "PositionID": "64451",
        "OrganizationName": "Frankfurt",
        "PositionHiringYear": "2025",
        "UserArea": {
          "ProDivision": 10052
        },
        "CareerLevel": [
          {
            "Name": "Vice President"
          }
        ],
        "PublicationStartDate": "2025-06-17"
      },
      "RelevanceScore": 0,
      "RelevanceRank": 41
    },
    "specialist_analysis": {},
    "description_source": "web_scraping"
  }
}