{
  "job_metadata": {
    "job_id": "62204",
    "version": "1.0",
    "created_at": "2025-07-10T12:00:34.364074",
    "last_modified": "2025-07-10T12:00:34.364074",
    "source": "deutsche_bank_api",
    "processor": "enhanced_job_fetcher_v6.1",
    "status": "fetched"
  },
  "job_content": {
    "title": "DWS - Experte für Banken und KVG Aufsichtsrecht (m/w/d)",
    "description": "DWS - Experte für Banken und KVG Aufsichtsrecht (m/w/d) Job ID:R0359045 Full/Part-Time: Full-time Regular/Temporary: Regular Listed: 2025-06-05 Location: Frankfurt Position Overview Über die DWSHeutzutage sind die Märkte einer ganzen Reihe von Risiken ausgesetzt - aber auch einer ganzen Reihe von Chancen. Die Chance, anders zu innovieren. Die Chance, verantwortungsvoll zu investieren. Und die Chance, etwas zu verändern.Kommen Sie zu DWS und werden Sie Teil eines branchenführenden Unternehmens mit globaler Präsenz. Hier werden Sie bestärkt, ehrgeizige Programme zu leiten, um die Zukunft des Investierens zu gestalten und unsere Kunden, lokale Gemeinschaften und die Umwelt zu unterstützen.Wir suchen kreative Denker und Innovatoren, um die Chancen von morgen zu nutzen und die bestmögliche Grundlage für die finanzielle Zukunft unserer Kunden zu schaffen. Aus diesem Grund sind wir \"Investors for a new now\".Im Gegenzug bieten wir Ihnen die Plattform, die Sie brauchen, um etwas zu bewirken, indem Sie mit einigen der größten Vordenker der Branche zusammenarbeiten.Das ist Ihre Chance, Ihre Ziele zu erreichen und eine außergewöhnliche Karriere zu führen. Das ist Ihre Chance, in Ihre Zukunft zu investieren.Lesen Sie hier mehr über DWS und wer wir sind (www.dws.com/de-de/)Team- / Divisionbeschreibung Der Bereich „Regulatory Reporting“ ist als Teil von „Global Reporting & Performance Measurement“ für die Erstellung und den Versand des aufsichtsrechtlichen Meldewesens für die gesamte DWS-Fondspalette (Active, Passive, Alternatives) zuständig. Das Leistungsspektrum umfasst die regulatorischen Verpflichtungen der DWS-Gruppe selbst und ihrer Sondervermögen. Darüber hinaus unterstützt das Regulatory Reporting institutionelle Kunden (insbesondere Banken und Versicherungen) bei der Erfüllung ihrer Meldeanforderungen. Als globale Institution deckt die DWS dabei ein breites Spektrum nationaler und internationaler Regularien und Aufsichtsbehörden ab. Als eine der größten Institutionen ihrer Art in Europa wirkt die DWS zudem durch Engagement in Branchenverbänden aktiv an der Gestaltung von Branchenstandards mit.Als Experte für Banken- und KVG-Aufsichtsrecht (m/w/d) (Functional Role Title: (Senior) Operations Specialist (m/w/d)), werden Sie:Die Gestaltung eines robusten, regelkonformen und effizienten regulatorischen Reportings der DWS sowie deren Kunden vorantreiben, mit Schwerpunkt auf das Reporting gemäß CRR, der Außenwirtschaftsverordnung (AWV), AIFMD sowie weiteren statistischen Meldeverpflichtungen der europäischen Aufsichtsbehörden (EZB, BaFin, CSSF)Aktuelle und neue Verordnungen analysieren, notwendige Anpassungsbedarfe erkennen, Anforderungen ableiten, um diese effizient und sicher umzusetzenMit Ihrer Erfahrung als Experte und Bindeglied den Fachbereich und die IT bei der technischen Umsetzung begleiten. Dabei liegt ihr Fokus auf der Implementierung einer effizienten Reporting-Lösung innerhalb der vorgegebenen regulatorischen ZeitleisteAls zentrale Kontaktperson und Experte die Interessen und Sichtweisen des DWS Regulatory Reportings zu aufsichtsrechtlichen Themen souverän und sicher gegenüber internen (z.B. Audit, Compliance) und externen Stakeholdern (z.B. nationale und internationale Aufsichtsbehörden, Verbände oder externe Wirtschaftsprüfer) vertretenDas DWS Regulatory Reporting dabei unterstützen, ein robustes Control Framework weiterzuentwickeln, indem die konsequente und einheitliche Erstellung, Pflege und Verbesserung der notwendigen Dokumentationen sowie der Kontrollen gewährleistet wirdWir suchenErfolgreich abgeschlossenes wirtschaftswissenschaftliches Studium oder BankausbildungMehrjährige Berufserfahrung bei einem Dienstleister, Beratungsunternehmen oder KVGSehr gute Kenntnisse der maßgeblichen aufsichtsrechtlichen Vorschriften wie der CRR, AIFMD und AWV, in Bezug auf das Berichts- und MeldewesenWünschenswerte Kenntnisse in Aladdin, FIS XP, WM Datenservice, Programmierkenntnisse (z.B. SQL, Python) von VorteilSehr gute Deutsch- und Englischkenntnisse in Wort und SchriftSehr gute Kenntnisse der Microsoft Anwendungen (z.B. Excel, PowerPoint)Erfolgreiche Zusammenarbeit mit virtuellen ProjektteamsAusschreibungszeitraum: 13.03.2025 bis auf weiteresWir bieten Ihnen:Ohne den Ehrgeiz unserer Mitarbeiter wären unsere Erfolge nicht möglich. Und es ist uns wichtig, dass Sie gerne zur Arbeit kommen – gesund, glücklich und wertgeschätzt. Bei der DWS haben Sie Zugriff auf eine Reihe von Benefits, aus denen Sie wählen können und die speziell auf Ihren Lebensstil abgestimmt sind. Egal, ob Sie sich für die Gesundheitsversorgung oder betriebliche Vergünstigungen interessieren oder über Ihre Altersvorsorge nachdenken, es ist für jeden etwas dabei.Einige unserer Benefits:Leistungen zur körperlichen und geistigen Gesundheit, einschließlich (aber nicht beschränkt auf) der gesetzlichen Krankenversicherung (BKK), Krankengeld und Support-Hotlines für MitarbeiterFamilienfreundliche Leistungen, einschließlich großzügiger Elternzeitpakete (unterstützt alle Varianten von Familienformen) und Unterstützung bei der Suche nach Kinderbetreuungsmöglichkeiten, einschließlich des DWS-eigenen KindergartenservicesEine Vielzahl an Pensionsplänen, persönlichen Budgetkonten zur Ermöglichung von Sabbaticals oder vorzeitigem Ruhestand sowie vermögenswirksamen LeistungenDie Möglichkeit, unsere CSR-Strategie zu unterstützen, die sich auf die Bekämpfung des Klimawandels und die Erreichung größerer sozialer Gerechtigkeit konzentriert. Sie können an unsere Partnerorganisationen spenden oder sich an Corporate-Volunteering-Möglichkeiten in Ihren lokalen Gemeinden beteiligen, indem Sie uns vor Ort unterstützenLeistungen zur Mobilität, beispielsweise ein subventioniertes Deutschlandticket sowie Angebote zu Firmenwagen und JobRadDas aktuelle Hybrid-Arbeitsmodell der DWS ist darauf ausgelegt, die Balance zwischen persönlicher Zusammenarbeit und Engagement im Büro zu finden, die den Kern unserer Arbeitskultur ausmacht. Wir setzen uns für die Unterstützung flexibler und hybrider Arbeitsvereinbarungen auf der ganzen Welt ein. Abhängig von dem Standort oder der Stelle, auf die Sie sich bewerben, wird die Aufteilung zwischen der Arbeit im Büro und der Arbeit zu Hause im Rahmen Ihres Bewerbungs- und Interviewprozesses besprochen.Wir werden unsere Arbeitsumgebungen und -methoden weiterhin überprüfen und weiterentwickeln, um bestmögliche Arbeitsbedingungen für unsere Mitarbeiter zu schaffen.Wenn Sie aus irgendeinem Grund, einschließlich oder im Zusammenhang mit einer Behinderung oder einem langfristigen Gesundheitszustand, Anpassungen oder Änderungen am Bewerbungsprozess benötigen, wenden Sie sich bitte an Ihren Recruiter und teilen Sie uns mit, welche Unterstützung Sie möglicherweise benötigen. Beispiele für Anpassungen sind die Änderung des Interviewformats oder die Bereitstellung von Unterstützung in den Räumlichkeiten der DWS. Dies hat keine Auswirkungen auf Ihre Bewerbung und Ihr Rekrutierungsteam wird die Optionen mit Ihnen besprechen.#LI-VL1 #LI-03 Wir streben eine Unternehmenskultur an, in der wir gemeinsam jeden Tag das Beste geben. Dazu gehören verantwortungsvolles Handeln, wirtschaftliches Denken, Initiative ergreifen und zielgerichtete Zusammenarbeit.Gemeinsam teilen und feiern wir die Erfolge unserer Mitarbeiter*innen. Gemeinsam sind wir die Deutsche Bank Gruppe.Wir begrüßen Bewerbungen von allen Menschen und fördern ein positives, faires und integratives Arbeitsumfeld.",
    "requirements": [],
    "location": {
      "city": "Frankfurt",
      "state": "Hessen",
      "country": "Deutschland",
      "remote_options": false
    },
    "employment_details": {
      "type": "Unbefristet",
      "schedule": "Vollzeit",
      "career_level": "Vice President",
      "salary_range": null,
      "benefits": []
    },
    "organization": {
      "name": "Deutsche Bank",
      "division": "Frankfurt",
      "division_id": 4
    },
    "posting_details": {
      "publication_date": "2025-06-05",
      "position_uri": "/index.php?ac=jobad&id=62204",
      "hiring_year": "2025"
    }
  },
  "evaluation_results": {
    "cv_to_role_match": null,
    "match_confidence": null,
    "evaluation_date": null,
    "evaluator": null,
    "domain_knowledge_assessment": null,
    "decision": {
      "apply": null,
      "rationale": null,
      "estimated_prep_time": null
    },
    "strengths": [],
    "weaknesses": []
  },
  "processing_log": [
    {
      "timestamp": "2025-07-10T12:00:34.364074",
      "action": "job_fetched",
      "processor": "enhanced_job_fetcher_v6.1",
      "status": "success",
      "details": "Successfully fetched job 62204 from Deutsche Bank API"
    },
    {
      "timestamp": "2025-07-10T12:00:34.364074",
      "action": "description_enriched",
      "processor": "web_scraper",
      "status": "success",
      "details": "Successfully fetched job description (7456 characters)"
    }
  ],
  "raw_source_data": {
    "api_response": {
      "MatchedObjectId": "62204",
      "MatchedObjectDescriptor": {
        "PositionOfferingType": [
          {
            "Name": "Unbefristet"
          }
        ],
        "PositionSchedule": [
          {
            "Name": "Vollzeit"
          }
        ],
        "PublicationChannel": [
          {
            "StartDate": "2025-06-05"
          }
        ],
        "PositionTitle": "DWS - Experte für Banken und KVG Aufsichtsrecht (m/w/d)",
        "PositionLocation": [
          {
            "CityName": "Frankfurt",
            "CountrySubDivisionName": "Hessen",
            "CountryName": "Deutschland"
          }
        ],
        "PositionURI": "/index.php?ac=jobad&id=62204",
        "PositionID": "62204",
        "OrganizationName": "Frankfurt",
        "PositionHiringYear": "2025",
        "UserArea": {
          "ProDivision": 4
        },
        "CareerLevel": [
          {
            "Name": "Vice President"
          }
        ],
        "PublicationStartDate": "2025-06-05"
      },
      "RelevanceScore": 0,
      "RelevanceRank": 48
    },
    "specialist_analysis": {},
    "description_source": "web_scraping"
  }
}