{
  "job_metadata": {
    "job_id": "64006",
    "version": "1.0",
    "created_at": "2025-07-10T11:36:18.547568",
    "last_modified": "2025-07-10T11:36:18.547568",
    "source": "deutsche_bank_api",
    "processor": "enhanced_job_fetcher_v6.1",
    "status": "fetched"
  },
  "job_content": {
    "title": "Senior Engineer (f/m/x)",
    "description": "Senior Engineer (f/m/x) Job ID:R0384837 Full/Part-Time: Full-time Regular/Temporary: Regular Listed: 2025-07-08 Location: Frankfurt Position Overview *English version below*Details zur Rolle und wie sie in das Team passtDas AFC Production Services-Team der Deutschen Bank sucht einen erfahrenen Spezialisten für Produktionsunterstützung, der technischen Support für mehrere Anwendungen bietet. Diese Rolle umfasst praktischen Produktionssupport, End-to-End-Problemmanagement über mehrere Plattformen hinweg sowie die Leitung technischer und betrieblicher Prozesse mit funktionsübergreifenden Teams. Diese Position unterstützt den Transformationsprozess der AFC-Division unter Nutzung der Google Cloud und neuer Technologien.Ihre HauptaufgabenAusbau der eigenen Fähigkeiten zum SME für Google Cloud Applikationen und koordinierende Zusammenarbeit und Führung von lokalen und Vendor L2 Supportgruppen auch länderübergreifend. Einhalten der vereinbarten SLA der Programme durch Einsatz einer Matrix von Monitoring Tools.Einsatz der ITIL Grundsätze im technischen Support sowie Post Mortem - und Root Cause Analysen zur Verbesserung der Systemstabilität.Aufbau und Pflege von konstruktiven Kontakten mit Verantwortlichen aus Business-, Technik- und Vendorengruppen zum proaktiven Handeln in kritischen Situationen.Proaktives Erkennen von systematischen Fehlern und Optimieren von manuellen und ineffizienten ProzessenTraining und Zusammenarbeit mit Junior Supportern: Ziel: Fördern und Motivation steigern.Reduzieren von wiederkehrenden Störungen gehören genauso zum Aufgabenbereich wie das Zuarbeiten bei Audits, Pflege der Supportdokumentation, Einhalten der Compliance - und regulatorischen Anforderungen im AFC-Kontext.Ihre Fähigkeiten und ErfahrungenErste Erfahrungen als Teamleiter im praktischen IT Anwendungssupport. Ein Plus ist bereits Erfahrung im Investment- und Transaktionsbank Umfeld.Erfahrungen in Cloud Produkten wie Google Cloud Plattform und hybriden AnwendungenKlares Verständnis von SRE/DevOPS Praktiken in Produktionsumgebungen und ITIL Standards.Kenntnisse von Vorteil in diesen Systemen: Elastic Search, Control-M, Grafana, Geneos, OpenShift, Prometheus, Google Cloud Monitoring, Airflow, SplunkSehr gutes Verständnis in Red Hat Enterprise Linux: Log Analysen, Prozesssteuerung, Kommandozeilenerfahrung zur Fehlersuche und Störungsbeseitigung. Shell Scripting Verständnis ist nützlich.Verständnis von Datenbankkonzepten und Einarbeitung in multi-relationale Datenbanksysteme.Neben verhandlungssicheren Englischkenntnissen ist Deutsch als Sprache ein Plus.Was wir Ihnen bietenWir bieten eine breite Palette von Leistungen, die all Ihre beruflichen und persönlichen Bedürfnisse abdecken.Emotional ausgeglichenEine positive Haltung hilft uns, die Herausforderungen des Alltags zu meistern – beruflich wie privat. Profitieren Sie von Angeboten wie Beratung in schwierigen Lebenssituationen und Angeboten zur Förderung mentaler Gesundheit.Körperlich fitMit Angeboten zur Aufrechterhaltung Ihrer persönlichen Gesundheit und einem förderlichen beruflichen Umfeld hilft Ihnen die Bank, körperlich fit zu bleiben. Profitieren Sie von Angeboten wie umfangreichen Check-up Untersuchungen, Impfangeboten und Beratung zur gesunden Lebensführung.Sozial vernetztDer Austausch mit anderen eröffnet uns neue Perspektiven, bringt uns beruflich wie persönlich voran und stärkt unser Selbstvertrauen und Wohlbefinden. Profitieren Sie von Angeboten wie Unterstützung durch den pme Familienservice, das FitnessCenter Job, flexible Arbeitszeitmodelle (bspw. Teilzeit, Jobtandem, hybrides Arbeiten) sowie einer umfangreichen Kultur der Vielfalt, Chancengleichheit und Teilhabe.Finanziell abgesichertDie Bank sichert Sie nicht nur während Ihrer aktiven Karriere, sondern auch für die Zukunft finanziell ab und unterstützt Ihre Flexibilität sowie Mobilität – egal ob privat oder beruflich. Profitieren Sie von Angeboten wie Beitragsplänen für Altersvorsorge, Bankdienstleistungen für Mitarbeiter*innen, Firmenfahrrad oder dem Deutschlandticket.Da die Benefits je nach Standort geringfügig variieren, gehen Sie bitte bei konkreten Fragen auf Ihren Recruiter/ Ihre Recruiterin zu.Die Stelle wird in Voll- und in Teilzeit angeboten.Bei Fragen zum Rekrutierungsprozess steht Ihnen Ayse Kartal-Isik gerne zur Verfügung.Kontakt Ayse Kartal-Isik: +49 69 910-42410___________________________________________________________________________Details of the role and how it fits into the teamDeutsche Bank’s AFC production services team is seeking a senior production support specialist to provide technical support for multiple applications. The role involves hands-on production support, end to end issue management across multiple platforms, and leading technical and operational processes with cross-functional teams. This position supports the AFC division’s transformation journey leveraging Google cloud and new technologies.Your key responsibilitiesBuild up technical subject matter expertise on the GCP applications alongside leading regional L2 teams and vendor teams. Making sure that application SLAs are achieved using an array of monitoring tools.Provide technical support by handling and consulting on BAU for the respective applications and perform post-mortem, root cause analysis using ITIL standards.Build and maintain effective and productive relationships with multiple stakeholders of business, technical teams and vendors to collaborate and deliver on initiatives driving stability in the environment.Drive service resilience by implementing SRE (site reliability engineering) principles, ensuring proactive monitoring, automation and operational efficiency.Approach support with a proactive attitude, desire to seek root cause, in-depth analysis, and strive to reduce inefficiencies and manual efforts by mentoring and guide junior team members, fostering technical upskill and knowledge sharing.Perform reviews of all open production items with the cross functional teams and push for updates and resolutions to outstanding tasks and reoccurring issues.Reducing recurring faults is just as much a part of the job as contributing to audits, maintaining support documentation and complying with compliance and regulatory requirements in the AFC contextYour skills and experiencesInitial experience as a team leader in practical IT application support. A plus is already experience in the investment and transaction banking environment.Experience in cloud products like Google Cloud Platform (GCP) and hybrid applications.Strong experience of ITIL /SRE/ DEVOPS best practices for supporting a production environment.Strong knowledge and working experience in Monitoring Tools are an advantage : Elastic Search, Control M, Grafana, Geneos, OpenShift, Prometheus, Google Cloud Monitoring, Airflow, Splunk.Red Hat Enterprise Linux (RHEL) – professional skill in searching logs, process commands, start/stop processes, use of OS commands to aid in tasks needed to resolve or investigate issues. Shell scripting knowledge a plus.Understanding of database concepts and exposure in working with multiple relational database management systems.In addition to fluent English, German is a plus as a language.What we offerWe provide you with a comprehensive portfolio of benefits and offerings to support both, your private and professional needs.Emotionally and mentally balancedA positive mind helps us master the challenges of everyday life – both professionally and privately. We offer consultation in difficult life situations as well as mental health awareness trainings.Physically thrivingWe support you in staying physically fit through an offering to maintain personal health and a professional environment. You can benefit from health check-ups; vaccination drives as well as advice on healthy living and nutrition.Socially connectedNetworking opens up new perspectives, helps us thrive professionally and personally as well as strengthens our self-confidence and well-being. You can benefit from PME family service, FitnessCenter Job, flexible working (e.g parttime, hybrid working, job tandem) as well as an extensive culture of diversity, equity and inclusion.Financially secureWe provide you with financial security not only during your active career but also for the future. You can benefit from offerings such as pension plans, banking services, company bicycle or “Deutschlandticket”.Since our offerings slightly vary across locations, please contact your recruiter with specific questions.This job is available in full and parttime.In case of any recruitment related questions, please get in touch with Ayse Kartal-Isik.Contact Ayse Kartal-Isik: +49 69 910-42410 Wir streben eine Unternehmenskultur an, in der wir gemeinsam jeden Tag das Beste geben. Dazu gehören verantwortungsvolles Handeln, wirtschaftliches Denken, Initiative ergreifen und zielgerichtete Zusammenarbeit.Gemeinsam teilen und feiern wir die Erfolge unserer Mitarbeiter*innen. Gemeinsam sind wir die Deutsche Bank Gruppe.Wir begrüßen Bewerbungen von allen Menschen und fördern ein positives, faires und integratives Arbeitsumfeld.",
    "requirements": [
      "the investment and transaction banking environment.Experience in cloud products like Google Cloud Platform (GCP) and hybrid applications.Strong experience of ITIL /SRE/ DEVOPS best practices for supporting a production environment.Strong knowledge and working experience in Monitoring Tools are an advantage : Elastic Search"
    ],
    "location": {
      "city": "Frankfurt",
      "state": "Hessen",
      "country": "Deutschland",
      "remote_options": false
    },
    "employment_details": {
      "type": "Unbefristet",
      "schedule": "Vollzeit",
      "career_level": "Assistant Vice President",
      "salary_range": null,
      "benefits": []
    },
    "organization": {
      "name": "Deutsche Bank",
      "division": "Frankfurt",
      "division_id": 10052
    },
    "posting_details": {
      "publication_date": "2025-07-08",
      "position_uri": "/index.php?ac=jobad&id=64006",
      "hiring_year": "2025"
    }
  },
  "evaluation_results": {
    "cv_to_role_match": null,
    "match_confidence": null,
    "evaluation_date": null,
    "evaluator": null,
    "domain_knowledge_assessment": null,
    "decision": {
      "apply": null,
      "rationale": null,
      "estimated_prep_time": null
    },
    "strengths": [],
    "weaknesses": []
  },
  "processing_log": [
    {
      "timestamp": "2025-07-10T11:36:18.547568",
      "action": "job_fetched",
      "processor": "enhanced_job_fetcher_v6.1",
      "status": "success",
      "details": "Successfully fetched job 64006 from Deutsche Bank API"
    },
    {
      "timestamp": "2025-07-10T11:36:18.547568",
      "action": "description_enriched",
      "processor": "web_scraper",
      "status": "success",
      "details": "Successfully fetched job description (9109 characters)"
    }
  ],
  "raw_source_data": {
    "api_response": {
      "MatchedObjectId": "64006",
      "MatchedObjectDescriptor": {
        "PositionOfferingType": [
          {
            "Name": "Unbefristet"
          }
        ],
        "PositionSchedule": [
          {
            "Name": "Vollzeit"
          }
        ],
        "PublicationChannel": [
          {
            "StartDate": "2025-07-08"
          }
        ],
        "PositionTitle": "Senior Engineer (f/m/x)",
        "PositionLocation": [
          {
            "CityName": "Frankfurt",
            "CountrySubDivisionName": "Hessen",
            "CountryName": "Deutschland"
          }
        ],
        "PositionURI": "/index.php?ac=jobad&id=64006",
        "PositionID": "64006",
        "OrganizationName": "Frankfurt",
        "PositionHiringYear": "2025",
        "UserArea": {
          "ProDivision": 10052
        },
        "CareerLevel": [
          {
            "Name": "Assistant Vice President"
          }
        ],
        "PublicationStartDate": "2025-07-08"
      },
      "RelevanceScore": 0,
      "RelevanceRank": 2
    },
    "specialist_analysis": {},
    "description_source": "web_scraping"
  }
}