{
  "job_metadata": {
    "job_id": "64958",
    "version": "1.0",
    "created_at": "2025-07-06T18:40:46.651289",
    "last_modified": "2025-07-06T18:40:46.651289",
    "source": "deutsche_bank_api",
    "processor": "enhanced_job_fetcher_v6.1",
    "status": "fetched"
  },
  "job_content": {
    "title": "DWS - Senior Manager - Group Transfer Pricing (m/f/d)",
    "description": "DWS - Senior Manager - Group Transfer Pricing (m/f/d) Job ID:R0396777 Full/Part-Time: Full-time Regular/Temporary: Regular Listed: 2025-07-04 Location: Frankfurt Position Overview Über die DWSHeutzutage sind die Märkte einer ganzen Reihe von Risiken ausgesetzt - aber auch einer ganzen Reihe von Chancen. Die Chance, anders zu innovieren. Die Chance, verantwortungsvoll zu investieren. Und die Chance, etwas zu verändern.Kommen Sie zu DWS und werden Sie Teil eines branchenführenden Unternehmens mit globaler Präsenz. Hier werden Sie bestärkt, ehrgeizige Programme zu leiten, um die Zukunft des Investierens zu gestalten und unsere Kunden, lokale Gemeinschaften und die Umwelt zu unterstützen.Wir suchen kreative Denker und Innovatoren, um die Chancen von morgen zu nutzen und die bestmögliche Grundlage für die finanzielle Zukunft unserer Kunden zu schaffen. Aus diesem Grund sind wir \"Investors for a new now\".Im Gegenzug bieten wir Ihnen die Plattform, die Sie brauchen, um etwas zu bewirken, indem Sie mit einigen der größten Vordenker der Branche zusammenarbeiten.Das ist Ihre Chance, Ihre Ziele zu erreichen und eine außergewöhnliche Karriere zu führen. Das ist Ihre Chance, in Ihre Zukunft zu investieren.Lesen Sie hier mehr über DWS und wer wir sind (www.dws.com/de-de/)Team- / Divisionbeschreibung Das Group Transfer Pricing Team der DWS stellt sicher, dass konzerninterne Transaktionen der DWS im Einklang mit wesentlichen Richtlinien und geltenden steuerlichen Vorschriften sind und berät anzuwendende TP-Methoden und Allokationsschlüssel. Im Einklang mit OECD Vorgaben werden Mindestanforderungen an Verrechnungsdokumentation vorgegeben sowie Kontrollpunkte rund um den TP-Lebenszyklus definiert und eine Governance-Struktur etabliert, um die Einhaltung dieser Mindestdokumentations- und Kontrollstandards sicherzustellen. Im Rahmen der Gesamtverantwortung für das Thema agiert das Team als Schnittstellenfunktion und ist nicht nur im engen Austausch mit den jeweiligen Finance Directors (FD), um die operationelle Umsetzung der Verrechnungspreiskonzepte sicherzustellen, sondern auch mit den COO Teams der Divisionen der DWS. Des Weiteren unterstützt das Team das Management der Beziehung zu den Steuerbehörden in Deutschland in enger Abstimmung mit DWS Group Tax, sowohl im Rahmen von Betriebsprüfungen als auch im Falle von Besteuerungskonflikten auf dem Gebiet der Verrechnungspreise.Rollenbeschreibung Als Senior Finance Manager werden Sie:Mitwirkung bei globalen Verrechnungspreiskonzepten der DWS GruppeUnterstützung bei der Erarbeitung von Verrechnungspreisrichtlinien, um Gesetzesänderungen und Veränderungen der Geschäftsabläufe der DWS entsprechend umzusetzenZusammenarbeit mit anderen Teams innerhalb der DWS Gruppe, um sicherzustellen, dass verwertbare E2E Verrechnungspreisdokumentation zeitnah verfügbar ist, um die Wahl und Anwendung der jeweiligen TP Methoden zu belegen Enge Zusammenarbeit mit dem zentralen TP Governance Team, um einen robusten Prozess zur Erstellung verwertbarer Local Files auf Basis von OECD-Anforderungen sicherzustellen und laufende Überprüfung der ImplementierungGemeinsam mit DWS Group Tax Verteidigung der Verrechnungspreise in Betriebsprüfungen, insbesondere Beantwortung von Betriebsprüfungsanfragen zu Verrechnungspreisthemen in DeutschlandUnterstützung von DWS Group Tax im Rahmen von Besteuerungskonflikten auf dem Gebiet der VerrechnungspreiseFestlegung von Verrechnungspreismethoden und –kalkulationsregeln in Abstimmung mit DWS Group Tax, damit die jeweiligen grenzüberschreitenden Leistungsbeziehungen im Einklang mit OECD Vorgaben sindMitwirkung bei der Implementierung von Gesetzesänderungen auf dem Gebiet der Verrechnungspreise in Deutschland Wir suchenAbgeschlossenes Hochschulstudium oder eine vergleichbare Qualifikation, idealerweise mit einem Schwerpunkt im internationalen Steuerrecht; abgeschlossenes Steuerberaterexamen wäre von VorteilMehrjährige Berufserfahrung auf dem Gebiet der (steuerlichen) Verrechnungspreise, insbesondere praktische Erfahrung im Finanzbereich eines international tätigen Unternehmens oder einer größeren, internationalen SteuerberatungsgesellschaftPraktische Erfahrung in Dokumentationsprojekten sowie der Entwicklung und Implementierung von Verrechnungspreiskonzepten im Asset Management bzw. BankenbereichGutes Verständnis des Asset Management GeschäftsAusgeprägte Fähigkeit im Team zu arbeitenSehr gute Kommunikations- und Ausdrucksfähigkeit und eine proaktive, eigenständige ArbeitsweiseAusgezeichnete analytische Fähigkeiten, um komplexe Sachverhalte und Prozesse schnell zu erfassenFließende Deutsch- und Englischkenntnisse (in Wort und Schrift)Sehr gute MS Office KenntnisseAusschreibungszeitraum: 04.07.2025 bis auf WeiteresWir bieten Ihnen:Ohne den Ehrgeiz unserer Mitarbeiter wären unsere Erfolge nicht möglich. Und es ist uns wichtig, dass Sie gerne zur Arbeit kommen – gesund, glücklich und wertgeschätzt. Bei der DWS haben Sie Zugriff auf eine Reihe von Benefits, aus denen Sie wählen können und die speziell auf Ihren Lebensstil abgestimmt sind. Egal, ob Sie sich für die Gesundheitsversorgung oder betriebliche Vergünstigungen interessieren oder über Ihre Altersvorsorge nachdenken, es ist für jeden etwas dabei.Einige unserer Benefits:Leistungen zur körperlichen und geistigen Gesundheit, einschließlich (aber nicht beschränkt auf) der gesetzlichen Krankenversicherung (BKK), Krankengeld und Support-Hotlines für MitarbeiterFamilienfreundliche Leistungen, einschließlich großzügiger Elternzeitpakete (unterstützt alle Varianten von Familienformen) und Unterstützung bei der Suche nach Kinderbetreuungsmöglichkeiten, einschließlich des DWS-eigenen KindergartenservicesEine Vielzahl an Pensionsplänen, persönlichen Budgetkonten zur Ermöglichung von Sabbaticals oder vorzeitigem Ruhestand sowie vermögenswirksamen LeistungenDie Möglichkeit, unsere CSR-Strategie zu unterstützen, die sich auf die Bekämpfung des Klimawandels und die Erreichung größerer sozialer Gerechtigkeit konzentriert. Sie können an unsere Partnerorganisationen spenden oder sich an Corporate-Volunteering-Möglichkeiten in Ihren lokalen Gemeinden beteiligen, indem Sie uns vor Ort unterstützenLeistungen zur Mobilität, beispielsweise ein subventioniertes Deutschlandticket sowie Angebote zu Firmenwagen und JobRadDas aktuelle Hybrid-Arbeitsmodell der DWS ist darauf ausgelegt, die Balance zwischen persönlicher Zusammenarbeit und Engagement im Büro zu finden, die den Kern unserer Arbeitskultur ausmacht. Wir setzen uns für die Unterstützung flexibler und hybrider Arbeitsvereinbarungen auf der ganzen Welt ein. Abhängig von dem Standort oder der Stelle, auf die Sie sich bewerben, wird die Aufteilung zwischen der Arbeit im Büro und der Arbeit zu Hause im Rahmen Ihres Bewerbungs- und Interviewprozesses besprochen.Wir werden unsere Arbeitsumgebungen und -methoden weiterhin überprüfen und weiterentwickeln, um bestmögliche Arbeitsbedingungen für unsere Mitarbeiter zu schaffen.Wenn Sie aus irgendeinem Grund, einschließlich oder im Zusammenhang mit einer Behinderung oder einem langfristigen Gesundheitszustand, Anpassungen oder Änderungen am Bewerbungsprozess benötigen, wenden Sie sich bitte an Ihren Recruiter und teilen Sie uns mit, welche Unterstützung Sie möglicherweise benötigen. Beispiele für Anpassungen sind die Änderung des Interviewformats oder die Bereitstellung von Unterstützung in den Räumlichkeiten der DWS. Dies hat keine Auswirkungen auf Ihre Bewerbung und Ihr Rekrutierungsteam wird die Optionen mit Ihnen besprechen.#LI-EL1 #LI-03 Wir streben eine Unternehmenskultur an, in der wir gemeinsam jeden Tag das Beste geben. Dazu gehören verantwortungsvolles Handeln, wirtschaftliches Denken, Initiative ergreifen und zielgerichtete Zusammenarbeit.Gemeinsam teilen und feiern wir die Erfolge unserer Mitarbeiter*innen. Gemeinsam sind wir die Deutsche Bank Gruppe.Wir begrüßen Bewerbungen von allen Menschen und fördern ein positives, faires und integratives Arbeitsumfeld.",
    "requirements": [],
    "location": {
      "city": "Frankfurt",
      "state": "Hessen",
      "country": "Deutschland",
      "remote_options": false
    },
    "employment_details": {
      "type": "Unbefristet",
      "schedule": "Vollzeit",
      "career_level": "Vice President",
      "salary_range": null,
      "benefits": []
    },
    "organization": {
      "name": "Deutsche Bank",
      "division": "Frankfurt",
      "division_id": 4
    },
    "posting_details": {
      "publication_date": "2025-07-04",
      "position_uri": "/index.php?ac=jobad&id=64958",
      "hiring_year": "2025"
    }
  },
  "evaluation_results": {
    "cv_to_role_match": null,
    "match_confidence": null,
    "evaluation_date": null,
    "evaluator": null,
    "domain_knowledge_assessment": null,
    "decision": {
      "apply": null,
      "rationale": null,
      "estimated_prep_time": null
    },
    "strengths": [],
    "weaknesses": []
  },
  "processing_log": [
    {
      "timestamp": "2025-07-06T18:40:46.651289",
      "action": "job_fetched",
      "processor": "enhanced_job_fetcher_v6.1",
      "status": "success",
      "details": "Successfully fetched job 64958 from Deutsche Bank API"
    },
    {
      "timestamp": "2025-07-06T18:40:46.651289",
      "action": "description_enriched",
      "processor": "web_scraper",
      "status": "success",
      "details": "Successfully fetched job description (7976 characters)"
    }
  ],
  "raw_source_data": {
    "api_response": {
      "MatchedObjectId": "64958",
      "MatchedObjectDescriptor": {
        "PositionOfferingType": [
          {
            "Name": "Unbefristet"
          }
        ],
        "PositionSchedule": [
          {
            "Name": "Vollzeit"
          }
        ],
        "PublicationChannel": [
          {
            "StartDate": "2025-07-04"
          }
        ],
        "PositionTitle": "DWS - Senior Manager - Group Transfer Pricing (m/f/d)",
        "PositionLocation": [
          {
            "CityName": "Frankfurt",
            "CountrySubDivisionName": "Hessen",
            "CountryName": "Deutschland"
          }
        ],
        "PositionURI": "/index.php?ac=jobad&id=64958",
        "PositionID": "64958",
        "OrganizationName": "Frankfurt",
        "PositionHiringYear": "2025",
        "UserArea": {
          "ProDivision": 4
        },
        "CareerLevel": [
          {
            "Name": "Vice President"
          }
        ],
        "PublicationStartDate": "2025-07-04"
      },
      "RelevanceScore": 0,
      "RelevanceRank": 2
    },
    "specialist_analysis": {},
    "description_source": "web_scraping"
  }
}