{
  "job_metadata": {
    "job_id": "59021",
    "version": "1.0",
    "created_at": "2025-07-07T08:30:32.254541",
    "last_modified": "2025-07-07T08:30:32.254541",
    "source": "deutsche_bank_api",
    "processor": "enhanced_job_fetcher_v6.1",
    "status": "fetched"
  },
  "job_content": {
    "title": "DWS - Senior Coverage Specialist - Wholesale/Insurance (m/w/d)",
    "description": "DWS - Senior Coverage Specialist - Wholesale/Insurance (m/w/d) Job ID:R0356745 Full/Part-Time: Full-time Regular/Temporary: Regular Listed: 2025-06-23 Location: Frankfurt Position Overview Über die DWSHeutzutage sind die Märkte einer ganzen Reihe von Risiken ausgesetzt - aber auch einer ganzen Reihe von Chancen. Die Chance, anders zu innovieren. Die Chance, verantwortungsvoll zu investieren. Und die Chance, etwas zu verändern.Kommen Sie zu DWS und werden Sie Teil eines branchenführenden Unternehmens mit globaler Präsenz. Hier werden Sie bestärkt, ehrgeizige Programme zu leiten, um die Zukunft des Investierens zu gestalten und unsere Kunden, lokale Gemeinschaften und die Umwelt zu unterstützen.Wir suchen kreative Denker und Innovatoren, um die Chancen von morgen zu nutzen und die bestmögliche Grundlage für die finanzielle Zukunft unserer Kunden zu schaffen. Aus diesem Grund sind wir \"Investors for a new now\".Im Gegenzug bieten wir Ihnen die Plattform, die Sie brauchen, um etwas zu bewirken, indem Sie mit einigen der größten Vordenker der Branche zusammenarbeiten.Das ist Ihre Chance, Ihre Ziele zu erreichen und eine außergewöhnliche Karriere zu führen. Das ist Ihre Chance, in Ihre Zukunft zu investieren.Lesen Sie hier mehr über DWS und wer wir sind.Team- / Divisionsbeschreibung Das Team Key Account Management Insurance ist innerhalb des Wholesale-Vertriebs der Client Coverage Division Deutschland und Österreich angesiedelt. Das Team verantwortet die ganzheitliche Betreuung und Weiterentwicklung unserer Partnerschaften mit allen relevanten deutschen Lebensversicherungsunternehmen (u.a. die strategische Kooperation mit der Zurich Gruppe) im Geschäftsfeld der fondsgebundenen Vorsorgelösungen. Die DWS ist in diesem Segment Marktführer und erfüllt seit vielen Jahren die hohen Ansprüche unserer Kunden durch eine lösungsorientierte, innovative und effiziente Herangehensweise an die wachsenden Herausforderungen der Versicherungsbranche.RollenbeschreibungDie Stelle Senior Coverage Specialist – Wholesale/Insurance (m/w/d) beinhaltet insbesondere folgende Aufgaben:Coverage, sowie Auf- und Ausbau der Kundenbeziehung im Segment der Lebensversicherungsunternehmen Deutschland. Dies umfasst die Mitgestaltung und Umsetzung der Vertriebsstrategie und deren strategischen Weiterentwicklung in DeutschlandAnsprechpartner und Koordinator auf allen Ebenen (u.a. Produktentwickler, Aktuare, Investment Management, Vertriebs-, Bereichs- und Geschäftsleiter, Vorstände)Initiation und Vordenken neuer Produktideen sowie deren Vorstellung und Umsetzungsunterstützung bei unseren Versicherungspartnern Gesamtheitliche Koordination und aktive, eigenverantwortliche Steuerung der Kundenbeziehungen und der Zusammenarbeit mit den relevanten StakeholdernPlatzierung aktiver, passiver und alternativer Produktlösungen sowie Erarbeitung kundenindividueller Konzepte für versicherungsspezifische Herausforderungen (u.a. White-Labeling, Digital-Solutions, alternative Produkte, Portfoliolösungen, Erfüllung vielschichtiger regulatorischer Anforderungen, etc.)Identifikation von neuen Ansätzen zur Vermarktung der DWS-Lösungen im Rahmen der fondsgebundenen Vorsorgelösungen unserer KundenMarketing- und Vertriebsplanung sowie Koordination und Durchführung von digitalen und „vor Ort“ VeranstaltungsformatenUmsetzung und Weiterentwicklung der Vertriebsstrategie, Identifikation von Ansatzpunkten aufgrund regulatorischer Treiber, Entwicklung neuer ProduktideenKonzeption und Halten von Präsentationen auf höchstem Niveau gegenüber Entscheidungsträgern und Multiplikatoren, unter Berücksichtigung aller regulatorischen AnforderungenWir suchen Bewerber mit folgenden Qualifikationen / Fähigkeiten:Mehrjährige und relevante Berufserfahrung in der Konzeption und Vertrieb von Finanzdienstleistungsprodukten, vorzugsweise mit Schwerpunkt Asset Management im Bereich von Investment- und VorsorgelösungenBreites Fachwissen zu aktiven, passiven und alternativen Investments und deren Umsetzung im VersicherungsmantelFundierte Erfahrung bei der Umsetzung regulatorischer Anforderungen vor allem auch im Bereich nachhaltiger ProduktlösungenStark ausgeprägte unternehmerische und strategische Ausrichtung verbunden mit Kunden- und Vertriebsorientierung, basierend auf einer besonders hohen Expertise in Entscheidungsprozessen von Lebensversicherungsunternehmen Ausgeprägte soziale Kompetenz und Teamfähigkeit, überzeugende und starke Kommunikations- und Präsentationsfähigkeiten, freundliches Auftreten, Eigenmotivation, hohe Leistungsbereitschaft und BelastbarkeitHohe Bereitschaft zu Reisetätigkeit, gutes Zeitmanagement und Fähigkeit, sich schnell auf Veränderungen einstellen zu können. Dabei ist die Erfahrung in der Arbeitsweise mit diversen Stakeholdern und Senior Management unabdingbarHohes Verantwortungsbewusstsein, hohe Dienstleistungs- und Vertriebsorientierung, schnelle Auffassungsgabe, strukturierte, selbstständige, kreative, ziel- und lösungsorientierte ArbeitsweiseAusgeprägte Kenntnisse im Versicherungs- und Finanzwesen, sowie fundiertes Verständnis der Regulatorik im Segment der LebensversicherungsunternehmenSehr gute Kenntnisse in MS Office (Excel, PPT, Word) sowie sehr gute, verhandlungssichere Sprachkenntnisse (Word und Schrift) in Deutsch und Englisch.Auschreibungszeitraum: 23.6.2025 bis auf weiteresWir bieten Ihnen:Ohne den Ehrgeiz unserer Mitarbeiter wären unsere Erfolge nicht möglich. Und es ist uns wichtig, dass Sie gerne zur Arbeit kommen – gesund, glücklich und wertgeschätzt. Bei der DWS haben Sie Zugriff auf eine Reihe von Benefits, aus denen Sie wählen können und die speziell auf Ihren Lebensstil abgestimmt sind. Egal, ob Sie sich für die Gesundheitsversorgung oder betriebliche Vergünstigungen interessieren oder über Ihre Altersvorsorge nachdenken, es ist für jeden etwas dabei.Einige unserer Benefits:Leistungen zur körperlichen und geistigen Gesundheit, einschließlich (aber nicht beschränkt auf) der gesetzlichen Krankenversicherung (BKK), Krankengeld und Support-Hotlines für MitarbeiterFamilienfreundliche Leistungen, einschließlich großzügiger Elternzeitpakete (unterstützt alle Varianten von Familienformen) und Unterstützung bei der Suche nach Kinderbetreuungsmöglichkeiten, einschließlich des DWS-eigenen KindergartenservicesEine Vielzahl an Pensionsplänen, persönlichen Budgetkonten zur Ermöglichung von Sabbaticals oder vorzeitigem Ruhestand sowie vermögenswirksamen LeistungenDie Möglichkeit, unsere CSR-Strategie zu unterstützen, die sich auf die Bekämpfung des Klimawandels und die Erreichung größerer sozialer Gerechtigkeit konzentriert. Sie können an unsere Partnerorganisationen spenden oder sich an Corporate-Volunteering-Möglichkeiten in Ihren lokalen Gemeinden beteiligen, indem Sie uns vor Ort unterstützenLeistungen zur Mobilität, beispielsweise ein voll subventioniertes Deutschlandticket sowie Angebote zu Firmenwagen und JobRadDas aktuelle Hybrid-Arbeitsmodell der DWS ist darauf ausgelegt, die Balance zwischen persönlicher Zusammenarbeit und Engagement im Büro zu finden, die den Kern unserer Arbeitskultur ausmacht. Wir setzen uns für die Unterstützung flexibler und hybrider Arbeitsvereinbarungen auf der ganzen Welt ein. Abhängig von dem Standort oder der Stelle, auf die Sie sich bewerben, wird die Aufteilung zwischen der Arbeit im Büro und der Arbeit zu Hause im Rahmen Ihres Bewerbungs- und Interviewprozesses besprochen.Wir werden unsere Arbeitsumgebungen und -methoden weiterhin überprüfen und weiterentwickeln, um bestmögliche Arbeitsbedingungen für unsere Mitarbeiter zu schaffen.Wenn Sie aus irgendeinem Grund, einschließlich oder im Zusammenhang mit einer Behinderung oder einem langfristigen Gesundheitszustand, Anpassungen oder Änderungen am Bewerbungsprozess benötigen, wenden Sie sich bitte an Ihren Recruiter und teilen Sie uns mit, welche Unterstützung Sie möglicherweise benötigen. Beispiele für Anpassungen sind die Änderung des Interviewformats oder die Bereitstellung von Unterstützung in den Räumlichkeiten der DWS. Dies hat keine Auswirkungen auf Ihre Bewerbung und Ihr Rekrutierungsteam wird die Optionen mit Ihnen besprechen.#LI-VL1#LI-03 Wir streben eine Unternehmenskultur an, in der wir gemeinsam jeden Tag das Beste geben. Dazu gehören verantwortungsvolles Handeln, wirtschaftliches Denken, Initiative ergreifen und zielgerichtete Zusammenarbeit.Gemeinsam teilen und feiern wir die Erfolge unserer Mitarbeiter*innen. Gemeinsam sind wir die Deutsche Bank Gruppe.Wir begrüßen Bewerbungen von allen Menschen und fördern ein positives, faires und integratives Arbeitsumfeld.",
    "requirements": [],
    "location": {
      "city": "Frankfurt",
      "state": "Hessen",
      "country": "Deutschland",
      "remote_options": false
    },
    "employment_details": {
      "type": "Unbefristet",
      "schedule": "Vollzeit",
      "career_level": "Vice President",
      "salary_range": null,
      "benefits": []
    },
    "organization": {
      "name": "Deutsche Bank",
      "division": "Frankfurt",
      "division_id": 4
    },
    "posting_details": {
      "publication_date": "2025-06-23",
      "position_uri": "/index.php?ac=jobad&id=59021",
      "hiring_year": "2025"
    }
  },
  "evaluation_results": {
    "cv_to_role_match": null,
    "match_confidence": null,
    "evaluation_date": null,
    "evaluator": null,
    "domain_knowledge_assessment": null,
    "decision": {
      "apply": null,
      "rationale": null,
      "estimated_prep_time": null
    },
    "strengths": [],
    "weaknesses": []
  },
  "processing_log": [
    {
      "timestamp": "2025-07-07T08:30:32.254541",
      "action": "job_fetched",
      "processor": "enhanced_job_fetcher_v6.1",
      "status": "success",
      "details": "Successfully fetched job 59021 from Deutsche Bank API"
    },
    {
      "timestamp": "2025-07-07T08:30:32.254541",
      "action": "description_enriched",
      "processor": "web_scraper",
      "status": "success",
      "details": "Successfully fetched job description (8565 characters)"
    }
  ],
  "raw_source_data": {
    "api_response": {
      "MatchedObjectId": "59021",
      "MatchedObjectDescriptor": {
        "PositionOfferingType": [
          {
            "Name": "Unbefristet"
          }
        ],
        "PositionSchedule": [
          {
            "Name": "Vollzeit"
          }
        ],
        "PublicationChannel": [
          {
            "StartDate": "2025-06-23"
          }
        ],
        "PositionTitle": "DWS - Senior Coverage Specialist - Wholesale/Insurance (m/w/d)",
        "PositionLocation": [
          {
            "CityName": "Frankfurt",
            "CountrySubDivisionName": "Hessen",
            "CountryName": "Deutschland"
          }
        ],
        "PositionURI": "/index.php?ac=jobad&id=59021",
        "PositionID": "59021",
        "OrganizationName": "Frankfurt",
        "PositionHiringYear": "2025",
        "UserArea": {
          "ProDivision": 4
        },
        "CareerLevel": [
          {
            "Name": "Vice President"
          }
        ],
        "PublicationStartDate": "2025-06-23"
      },
      "RelevanceScore": 0,
      "RelevanceRank": 24
    },
    "specialist_analysis": {},
    "description_source": "web_scraping"
  }
}