{
  "job_metadata": {
    "job_id": "56411",
    "version": "1.0",
    "created_at": "2025-07-10T11:53:31.013118",
    "last_modified": "2025-07-10T11:53:31.013118",
    "source": "deutsche_bank_api",
    "processor": "enhanced_job_fetcher_v6.1",
    "status": "fetched"
  },
  "job_content": {
    "title": "Senior Tax Analyst (d/m/w)",
    "description": "Senior Tax Analyst (d/m/w) Job ID:R0339600 Full/Part-Time: Full-time Regular/Temporary: Regular Listed: 2025-06-16 Location: Frankfurt Position Overview Über den BereichGroup Tax ist Teil des CFO-Bereiches der Deutschen Bank. Die Stelle ist im Bereich Tax Reporting & Compliance Germany angesiedelt. Der Bereich verantwortet die Aufstellung der für das Tax Reporting nach IFRS und HGB erforderlichen Informationen sowie die Erfüllung der gesetzlichen Verpflichtungen gegenüber den Finanzbehörden insbesondere durch Erstellung der Ertragsteuererklärungen und durch Unterstützung bei den steuerlichen Betriebsprüfungen.Zur Verstärkung unseres Tax Reporting & Compliance Teams suchen wir einen Spezialisten (m/w/d) mit breit gefächerten und idealerweise bankspezifischen Kenntnissen im Steuerrecht und der Bilanzierung nach IFRS und HGB.Gemeinsam im Team mit erfahrenen Steuerspezialisten sind Sie für die Erfüllung ertragsteuerlicher Verpflichtungen verantwortlich.Ihre AufgabenIm Rahmen des Einzel- und Konzernabschlusses berechnen Sie die laufenden und latenten Steuern der Deutsche Bank AG nach HGB und IFRS.Bereichsübergreifend arbeiten Sie mit unseren Fachkräften und Spezialisten im In- und Ausland an vielfältigen steuerrechtlichen Themen.Sie bearbeiten selbständig steuerfachliche Themen im Bereich Tax Reporting & Compliance inklusive der Erstellung der Dokumentation und setzen Steuerrechtsänderungen prozessual um.Zusammen im Team gewährleisten Sie das Monitoring und die Plausibilisierung der Steuerpositionen der Berichtseinheiten in der Tax Region Germany für den IFRS-Konzernabschluss.Wir freuen uns auf Ihre Ideen, um gemeinsam die Automatisierung und Standardisierung der ertragsteuerlichen Prozesse in der Region Germany im GlobalTaxCenter und SmartTaxBalance weiter voranzutreiben.Ihre Fähigkeiten und ErfahrungenSie verfügen über einen betriebswirtschaftlichen oder vergleichbaren Studienabschluss mit Schwerpunkt Steuern oder über ein Studium zum Diplom-Finanzwirt oder eine vergleichbare Qualifikation mit aktuellen steuerrechtlichen InhaltenSie besitzen mehrjährige Berufserfahrung im Bereich Tax Reporting & Compliance von Konzernen oder bei einer international ausgerichteten Steuerberatungsgesellschaft im Bereich Besteuerung von BankenFundierte Kenntnisse der deutschen Steuergesetzgebung und Erfahrung in der Anwendung von Steuerregelungen.Fundierte Kenntnisse der Rechnungslegung nach IFRS und HGB insbesondere im Bereich latenter Steuern.Als echter Teamplayer sind Sie offen und lernbereit für neue Inhalte und zeigen Verantwortungsbewusstsein, sowie eine selbständige und lösungsorientierte Arbeitsweise, auch unter hohem Zeitdruck.Sie verfügen über sehr gute MS-Office- (insbesondere MS Excel) und SAP-Kenntnisse, idealerweise sind Sie mit den Anwendungen GlobalTaxCenter und TaxBalance von Amana oder einem vergleichbaren Produkt vertraut.Sehr gute Deutsch- und Englischkenntnisse in Wort und Schrift runden Ihr Profil ab.Was wir Ihnen bietenWir bieten eine breite Palette von Leistungen, die all Ihre beruflichen und persönlichen Bedürfnisse abdecken.Emotional ausgeglichenEine positive Haltung hilft uns, die Herausforderungen des Alltags zu meistern – beruflich wie privat. Profitieren Sie von Angeboten wie Beratung in schwierigen Lebenssituationen und Angeboten zur Förderung mentaler Gesundheit.Körperlich fitMit Angeboten zur Aufrechterhaltung Ihrer persönlichen Gesundheit und einem förderlichen beruflichen Umfeld hilft Ihnen die Bank, körperlich fit zu bleiben. Profitieren Sie von Angeboten wie umfangreichen Check-up Untersuchungen, Impfangeboten und Beratung zur gesunden Lebensführung.Sozial vernetztDer Austausch mit anderen eröffnet uns neue Perspektiven, bringt uns beruflich wie persönlich voran und stärkt unser Selbstvertrauen und Wohlbefinden. Profitieren Sie von Angeboten wie Unterstützung durch den pme Familienservice, das FitnessCenter Job, flexible Arbeitszeitmodelle (bspw. Teilzeit, Jobtandem, hybrides Arbeiten) sowie einer umfangreichen Kultur der Vielfalt, Chancengleichheit und Teilhabe.Finanziell abgesichertDie Bank sichert Sie nicht nur während Ihrer aktiven Karriere, sondern auch für die Zukunft finanziell ab und unterstützt Ihre Flexibilität sowie Mobilität – egal ob privat oder beruflich. Profitieren Sie von Angeboten wie Beitragsplänen für Altersvorsorge, Bankdienstleistungen für Mitarbeiter*innen, Firmenfahrrad oder dem Deutschlandticket. Die Stelle wird in Voll- und in Teilzeit angeboten Da die Benefits je nach Standort geringfügig variieren, gehen Sie bitte bei konkreten Fragen auf Ihren Recruiter / Ihre Recruiterin zu. Bei Fragen zum Rekrutierungsprozess steht Ihnen Evangelia Tseliou gerne zur Verfügung. Kontakt Evangelia Tseliou: +49 69 910-45463 Wir streben eine Unternehmenskultur an, in der wir gemeinsam jeden Tag das Beste geben. Dazu gehören verantwortungsvolles Handeln, wirtschaftliches Denken, Initiative ergreifen und zielgerichtete Zusammenarbeit.Gemeinsam teilen und feiern wir die Erfolge unserer Mitarbeiter*innen. Gemeinsam sind wir die Deutsche Bank Gruppe.Wir begrüßen Bewerbungen von allen Menschen und fördern ein positives, faires und integratives Arbeitsumfeld.",
    "requirements": [],
    "location": {
      "city": "Frankfurt",
      "state": "Hessen",
      "country": "Deutschland",
      "remote_options": false
    },
    "employment_details": {
      "type": "Unbefristet",
      "schedule": "Vollzeit",
      "career_level": "Assistant Vice President",
      "salary_range": null,
      "benefits": []
    },
    "organization": {
      "name": "Deutsche Bank",
      "division": "Frankfurt",
      "division_id": 8
    },
    "posting_details": {
      "publication_date": "2025-06-16",
      "position_uri": "/index.php?ac=jobad&id=56411",
      "hiring_year": "2025"
    }
  },
  "evaluation_results": {
    "cv_to_role_match": null,
    "match_confidence": null,
    "evaluation_date": null,
    "evaluator": null,
    "domain_knowledge_assessment": null,
    "decision": {
      "apply": null,
      "rationale": null,
      "estimated_prep_time": null
    },
    "strengths": [],
    "weaknesses": []
  },
  "processing_log": [
    {
      "timestamp": "2025-07-10T11:53:31.013118",
      "action": "job_fetched",
      "processor": "enhanced_job_fetcher_v6.1",
      "status": "success",
      "details": "Successfully fetched job 56411 from Deutsche Bank API"
    },
    {
      "timestamp": "2025-07-10T11:53:31.013118",
      "action": "description_enriched",
      "processor": "web_scraper",
      "status": "success",
      "details": "Successfully fetched job description (5170 characters)"
    }
  ],
  "raw_source_data": {
    "api_response": {
      "MatchedObjectId": "56411",
      "MatchedObjectDescriptor": {
        "PositionOfferingType": [
          {
            "Name": "Unbefristet"
          }
        ],
        "PositionSchedule": [
          {
            "Name": "Vollzeit"
          }
        ],
        "PublicationChannel": [
          {
            "StartDate": "2025-06-16"
          }
        ],
        "PositionTitle": "Senior Tax Analyst (d/m/w)",
        "PositionLocation": [
          {
            "CityName": "Frankfurt",
            "CountrySubDivisionName": "Hessen",
            "CountryName": "Deutschland"
          }
        ],
        "PositionURI": "/index.php?ac=jobad&id=56411",
        "PositionID": "56411",
        "OrganizationName": "Frankfurt",
        "PositionHiringYear": "2025",
        "UserArea": {
          "ProDivision": 8
        },
        "CareerLevel": [
          {
            "Name": "Assistant Vice President"
          }
        ],
        "PublicationStartDate": "2025-06-16"
      },
      "RelevanceScore": 0,
      "RelevanceRank": 44
    },
    "specialist_analysis": {},
    "description_source": "web_scraping"
  }
}