{
  "job_metadata": {
    "job_id": "64017",
    "version": "1.0",
    "created_at": "2025-07-10T12:12:27.430476",
    "last_modified": "2025-07-10T12:12:27.430476",
    "source": "deutsche_bank_api",
    "processor": "enhanced_job_fetcher_v6.1",
    "status": "fetched"
  },
  "job_content": {
    "title": "Compliance Testing Officer (d/m/w) im Controls Testing &amp; Assurance Team für die Geschäftsbereiche Corporate Bank &amp; Investment Bank",
    "description": "Compliance Testing Officer (d/m/w) im Controls Testing & Assurance Team für die Geschäftsbereiche Corporate Bank & Investment Bank Job ID:R0383427 Full/Part-Time: Full-time Regular/Temporary: Regular Listed: 2025-06-05 Location: Frankfurt Position Overview Teambeschreibung und RollendetailsFür unseren Geschäftsbereich Compliance & AFC (Controls Testing & Assurance („CT&A“) Germany suchen wir zum nächstmöglichen Zeitpunkt einen Compliance Testing Officer (d/m/w) für das Corporate Bank, Investment Bank & Capital Release Unit Team Germany.Compliance Testing & Assurance ist eine der globalen Schlüsselfunktionen der Deutsche Bank AG und bildet seit 2021 eine unabhängige und organisatorisch eigenständige interdisziplinäre Einheit mit unmittelbarer Berichtslinie an den Konzernvorstand, was den Stellenwert, den uns das Management, die Geschäftsbereiche und die für uns zuständigen Aufsichtsbehörden unserer Arbeit zuschreiben, nochmals deutlich unterstreicht. Als global tätige Einheit ist CT&A zudem an allen bedeutsamen Finanzplätzen mit lokalen Teams vertreten. CT&A prüft dabei die Wirksamkeit von Kontrollen insbesondere in Bezug auf die Compliance Risiken und die Umsetzung regulatorischer Anforderungen in allen Unternehmensbereichen der Deutsche Bank AG. In Zusammenarbeit mit den verschiedenen Geschäftsbereichen Private Bank (PB), Corporate Bank (CB), Investment Bank (IB), DWS, Capital Release Unit (CRU) und den Infrastrukturfunktionen entwickeln wir bereichsübergreifende Standards und Prozesse und leisten damit einen entscheidenden Beitrag zur Umsetzung und Sicherstellung eines effektiven Kontrollumfeldes.Freuen Sie sich auf ein erfahrenes und äußerst motiviertes Team, attraktive Karriere- und Entwicklungsmöglichkeiten sowohl innerhalb des CB, IB & CRU Germany Compliance Testing Team als auch der gesamten CT&A-Organisation sowie ein internationales und dynamisches Arbeitsumfeld. Die Tätigkeit bringt durch das sich fortwährend verändernde regulatorische Umfeld nicht nur viel Abwechslung mit sich, vielmehr erfordert diese sich stets auch mit herausfordernden und spannenden Fragestellungen auseinanderzusetzen. Das setzt einen regelmäßigen Austausch sowohl CT&A-intern als auch mit anderen Fachbereichen voraus, sodass Sie sich hier eine hohe Expertise aneignen und Ihr Netzwerk ausbauen können. Wir ermöglichen Ihnen zudem ein flexibles Arbeitsmodell mit der Möglichkeit von zu Hause zu arbeiten („Homeoffice“) und einer entsprechenden IT-Ausstattung.Ihre HauptverantwortlichkeitenSie identifizieren und bewerten bestehende First-Level-Kontrollen in den Divisionen CB, IB und CRU,Arbeiten bei der Entwicklung von risikobasierten Prüfungsmethoden und -plänen für das Aufgabengebiet mit,Planen verschiedene Prüfungsformate (Reviews, Tests, Adherence Checks und Vor-Ort-Prüfungen), führen diese im Einklang mit den internen Methoden und Verfahren durch und wirken bei deren Berichterstattung mit,Stimmen Findings und notwendige Maßnahmen mit den Adressaten inkl. Senior Management ab, begleiten die Implementierung der vereinbarten Maßnahmen und eskalieren ggf. überfällige Findings,Zudem wirken Sie bei der Vorbereitung und Durchführung von Projekten und Initiativen anlässlich neuer regulatorischer Anforderungen mit,Und nehmen an internationalen divisionalen Global Practice Groups teil.Ihre Kompetenzen und Erfahrungen Sie verfügen über erste Berufserfahrung im Umfeld Compliance, Legal, Wirtschaftsprüfung, Revision/Audit, Divisional Control Offices/Business Control Units, Business Management oder Risikomanagement, insbesondere in der konzeptionellen Erarbeitung von Methoden und Kontrollen (WpHG sowie MaComp und MaRisk),Kenntnisse der einschlägigen Regulatorik und des Geschäftsumfeldes sowie die Bereitschaft zur fortdauernden Einarbeitung in neue regulatorische Anforderungen, insbesondere für die Divisionen CB, IB und CRU,Analytische Fähigkeiten sowie eine schnelle Auffassungsgabe, um komplexe Sachverhalte und Prozesse zügig zu erfassen, wesentliche Risikoaspekte herauszuarbeiten und sachgerechte Schlussfolgerungen zu ziehen,Ausgeprägte Kommunikationsfähigkeit, proaktives Management von Konflikten und Eskalationen, zielorientierte und verbindliche Gesprächsführung; sehr gute Kommunikations- und Ausdrucksfähigkeit vor allem in deutscher sowie in englischer Sprache in Wort und Schrift,Sie sind Teamplayer mit hoher Eigenmotivation und der Fähigkeit, auch in stressigen Situationen, mehrere Themenstellungen parallel und unter Berücksichtigung der Zieltermine sorgfältig und zielgerichtet zu bearbeiten.Was wir Ihnen bietenWir bieten eine breite Palette von Leistungen, die all Ihre beruflichen und persönlichen Bedürfnisse abdecken.Emotional ausgeglichenEine positive Haltung hilft uns, die Herausforderungen des Alltags zu meistern – beruflich wie privat. Profitieren Sie von Angeboten wie Beratung in schwierigen Lebenssituationen und Angeboten zur Förderung mentaler Gesundheit.Körperlich fitMit Angeboten zur Aufrechterhaltung Ihrer persönlichen Gesundheit und einem förderlichen beruflichen Umfeld hilft Ihnen die Bank, körperlich fit zu bleiben. Profitieren Sie von Angeboten wie umfangreichen Check-up Untersuchungen, Impfangeboten und Beratung zur gesunden Lebensführung.Sozial vernetztDer Austausch mit anderen eröffnet uns neue Perspektiven, bringt uns beruflich wie persönlich voran und stärkt unser Selbstvertrauen und Wohlbefinden. Profitieren Sie von Angeboten wie Unterstützung durch den pme Familienservice, das FitnessCenter Job, flexible Arbeitszeitmodelle (bspw. Teilzeit, Jobtandem, hybrides Arbeiten) sowie einer umfangreichen Kultur der Vielfalt, Chancengleichheit und Teilhabe.Finanziell abgesichertDie Bank sichert Sie nicht nur während Ihrer aktiven Karriere, sondern auch für die Zukunft finanziell ab und unterstützt Ihre Flexibilität sowie Mobilität – egal ob privat oder beruflich. Profitieren Sie von Angeboten wie Beitragsplänen für Altersvorsorge, Bankdienstleistungen für Mitarbeiter*innen, Firmenfahrrad oder dem Deutschlandticket.Da die Benefits je nach Standort geringfügig variieren, gehen Sie bitte bei konkreten Fragen auf Ihre Recruiter / Ihre Recruiterin zu.Die Stelle wird in Voll- und in Teilzeit angeboten.Bei Fragen zum Rekrutierungsprozess steht Ihnen Nana Darko gerne zur Verfügung.Kontakt Nana Darko: +49 (0)175 - 6705312 Wir streben eine Unternehmenskultur an, in der wir gemeinsam jeden Tag das Beste geben. Dazu gehören verantwortungsvolles Handeln, wirtschaftliches Denken, Initiative ergreifen und zielgerichtete Zusammenarbeit.Gemeinsam teilen und feiern wir die Erfolge unserer Mitarbeiter*innen. Gemeinsam sind wir die Deutsche Bank Gruppe.Wir begrüßen Bewerbungen von allen Menschen und fördern ein positives, faires und integratives Arbeitsumfeld.",
    "requirements": [],
    "location": {
      "city": "Frankfurt",
      "state": "Hessen",
      "country": "Deutschland",
      "remote_options": false
    },
    "employment_details": {
      "type": "Unbefristet",
      "schedule": "Vollzeit",
      "career_level": "Assistant Vice President",
      "salary_range": null,
      "benefits": []
    },
    "organization": {
      "name": "Deutsche Bank",
      "division": "Frankfurt",
      "division_id": 10056
    },
    "posting_details": {
      "publication_date": "2025-06-05",
      "position_uri": "/index.php?ac=jobad&id=64017",
      "hiring_year": "2025"
    }
  },
  "evaluation_results": {
    "cv_to_role_match": null,
    "match_confidence": null,
    "evaluation_date": null,
    "evaluator": null,
    "domain_knowledge_assessment": null,
    "decision": {
      "apply": null,
      "rationale": null,
      "estimated_prep_time": null
    },
    "strengths": [],
    "weaknesses": []
  },
  "processing_log": [
    {
      "timestamp": "2025-07-10T12:12:27.430476",
      "action": "job_fetched",
      "processor": "enhanced_job_fetcher_v6.1",
      "status": "success",
      "details": "Successfully fetched job 64017 from Deutsche Bank API"
    },
    {
      "timestamp": "2025-07-10T12:12:27.430476",
      "action": "description_enriched",
      "processor": "web_scraper",
      "status": "success",
      "details": "Successfully fetched job description (6750 characters)"
    }
  ],
  "raw_source_data": {
    "api_response": {
      "MatchedObjectId": "64017",
      "MatchedObjectDescriptor": {
        "PositionOfferingType": [
          {
            "Name": "Unbefristet"
          }
        ],
        "PositionSchedule": [
          {
            "Name": "Vollzeit"
          }
        ],
        "PublicationChannel": [
          {
            "StartDate": "2025-06-05"
          }
        ],
        "PositionTitle": "Compliance Testing Officer (d/m/w) im Controls Testing &amp; Assurance Team für die Geschäftsbereiche Corporate Bank &amp; Investment Bank",
        "PositionLocation": [
          {
            "CityName": "Frankfurt",
            "CountrySubDivisionName": "Hessen",
            "CountryName": "Deutschland"
          }
        ],
        "PositionURI": "/index.php?ac=jobad&id=64017",
        "PositionID": "64017",
        "OrganizationName": "Frankfurt",
        "PositionHiringYear": "2025",
        "UserArea": {
          "ProDivision": 10056
        },
        "CareerLevel": [
          {
            "Name": "Assistant Vice President"
          }
        ],
        "PublicationStartDate": "2025-06-05"
      },
      "RelevanceScore": 0,
      "RelevanceRank": 49
    },
    "specialist_analysis": {},
    "description_source": "web_scraping"
  }
}