{
  "job_metadata": {
    "job_id": "64657",
    "version": "1.0",
    "created_at": "2025-07-06T18:50:03.624106",
    "last_modified": "2025-07-06T18:50:03.624106",
    "source": "deutsche_bank_api",
    "processor": "enhanced_job_fetcher_v6.1",
    "status": "fetched"
  },
  "job_content": {
    "title": "Funds Transfer Pricing &amp; IRRBB expert for the Private Bank (f/m/x) [Job Profile: Business Management Lead]",
    "description": "Funds Transfer Pricing & IRRBB expert for the Private Bank (f/m/x) [Job Profile: Business Management Lead] Job ID:R0393428 Full/Part-Time: Full-time Regular/Temporary: Regular Listed: 2025-06-25 Location: Frankfurt Position Overview Details of the role and how it fits into the teamIn both the domestic German market and worldwide, the Private Bank (“PB”) provides high-quality advice to over 20 million clients and a broad range of financial services in 19 countries – ranging from day-to-day banking services right through to advisory services for sophisticated Private Banking and Wealth Management clients. In Italy, Spain, Belgium and India the Private Bank offers its services to corporate clients as well as small and medium-sized enterprises. The Private Bank is a strong pillar of the Group: a modern bank that boasts capital markets and financing expertise, a strong global network and modern digital services.Financial Resource Management (“FRM”) is responsible for steering the balance sheet and capital resources provided to the Private Bank ensuring sustainable growth of the franchise and meeting clients’ needs in a competitive environment. FRM is a sub-division of the Banking, Lending and Investment Solutions division, which is responsible for the management of all Private Bank products (deposits, credit cards, loans, capital markets, advisory and discretionary management). Mission includes: - Ensuring each type of PB liabilities and assets are modelled according to their contribution to the bank funding framework and remunerated accordingly; - Working with Treasury and Risk functions to optimise interest rate management - Interacting with key stakeholders in Treasury, Finance, Risk, CB and IB to understand constraints and limitations; - Providing transparency and giving guidance to business leaders to optimise the Private Bank strategy against these finite resources.Your key responsibilitiesBe the subject matter expert within PB on Funds Transfer Pricing, liquidity steering subjects and Interest Rate Risk in the Banking Book with a particular focus on Germany Personal Banking and Germany Wealth Management & Private BankingDrive transparency, simplification and automation of all Treasury allocation processes for each balance sheet product and segment linesSupports the interest risk rate management of PB asset initiatives in the respective regions and segments in coordination with Treasury and Risk functions.Prepare performance and strategic documents to support an intense dialogue between Treasury and PB (including for the PB Asset & Liabilities Council, regional FRM forums and ad-hoc senior management meetings)Maintain consistent analytical and methodological standards with regard to Treasury allocations across the regionsWorks closely with other areas of PB and the groupYour skills and experiencesUniversity degree in banking, finance, economics or other comparable business-related fieldsAt least 10 years of professional experience in treasury or treasury-related areas in a German retail bankExcellent knowledge of net interest income and economic risk models in the banking bookGood knowledge of retail and private banking products and prudential liquidity requirements applicable to banksExcellent analytical skills to solve complex problems coupled with a business mindset. Ability to develop creative and structured solutionsHigh level of personal initiative and commitment; ability to work independentlyAbility to translate highly technical concepts into business actionable guidance and Exco level materialsCapacity to deliver under time pressure at the highest quality level and flexibility to adapt to changing parametersAbility to work effectively in a global team with a strong capability to motivate and encourage colleagues and to resolve conflictsExcellent oral and written communication skills in both German and EnglishWhat we offerWe provide you with a comprehensive portfolio of benefits and offerings to support both, your private and professional needs.Emotionally and mentally balancedA positive mind helps us master the challenges of everyday life – both professionally and privately. We offer consultation in difficult life situations as well as mental health awareness trainings.Physically thrivingWe support you in staying physically fit through an offering to maintain personal health and a professional environment. You can benefit from health check-ups; vaccination drives as well as advice on healthy living and nutrition.Socially connectedNetworking opens up new perspectives, helps us thrive professionally and personally as well as strengthens our self-confidence and well-being. You can benefit from PME family service, FitnessCenter Job, flexible working (e.g parttime, hybrid working, job tandem) as well as an extensive culture of diversity, equity and inclusion.Financially secureWe provide you with financial security not only during your active career but also for the future. You can benefit from offerings such as pension plans, banking services, company bicycle or “Deutschlandticket”.Since our offerings slightly vary across locations, please contact your recruiter with specific questions.This job is available in full and parttime.In case of any recruitment related questions, please get in touch with Ahmet Deniz.Contact Ahmet Deniz: +49 (69) 910-45237 Wir streben eine Unternehmenskultur an, in der wir gemeinsam jeden Tag das Beste geben. Dazu gehören verantwortungsvolles Handeln, wirtschaftliches Denken, Initiative ergreifen und zielgerichtete Zusammenarbeit.Gemeinsam teilen und feiern wir die Erfolge unserer Mitarbeiter*innen. Gemeinsam sind wir die Deutsche Bank Gruppe.Wir begrüßen Bewerbungen von allen Menschen und fördern ein positives, faires und integratives Arbeitsumfeld.",
    "requirements": [
      "10 years of professional experience in treasury or treasury-related areas in a German retail bankExcellent knowledge of net interest income and economic risk models in the banking bookGood knowledge of retail and private banking products and prudential liquidity requirements applicable to banksExcellent analytical skills to solve complex problems coupled with a business mindset. Ability to develop creative and structured solutionsHigh level of personal initiative and commitment; ability to work independentlyAbility to translate highly technical concepts into business actionable guidance and Exco level materialsCapacity to deliver under time pressure at the highest quality level and flexibility to adapt to changing parametersAbility to work effectively in a global team with a strong capability to motivate and encourage colleagues and to resolve conflictsExcellent oral and written communication skills in both German and EnglishWhat we offerWe provide you with a comprehensive portfolio of benefits and offerings to support both",
      "treasury or treasury-related areas in a German retail bankExcellent knowledge of net interest income and economic risk models in the banking bookGood knowledge of retail and private banking products and prudential liquidity requirements applicable to banksExcellent analytical skills to solve complex problems coupled with a business mindset. Ability to develop creative and structured solutionsHigh level of personal initiative and commitment; ability to work independentlyAbility to translate highly technical concepts into business actionable guidance and Exco level materialsCapacity to deliver under time pressure at the highest quality level and flexibility to adapt to changing parametersAbility to work effectively in a global team with a strong capability to motivate and encourage colleagues and to resolve conflictsExcellent oral and written communication skills in both German and EnglishWhat we offerWe provide you with a comprehensive portfolio of benefits and offerings to support both"
    ],
    "location": {
      "city": "Frankfurt",
      "state": "Hessen",
      "country": "Deutschland",
      "remote_options": false
    },
    "employment_details": {
      "type": "Unbefristet",
      "schedule": "Vollzeit",
      "career_level": "Vice President",
      "salary_range": null,
      "benefits": []
    },
    "organization": {
      "name": "Deutsche Bank",
      "division": "Frankfurt",
      "division_id": 10032
    },
    "posting_details": {
      "publication_date": "2025-06-25",
      "position_uri": "/index.php?ac=jobad&id=64657",
      "hiring_year": "2025"
    }
  },
  "evaluation_results": {
    "cv_to_role_match": null,
    "match_confidence": null,
    "evaluation_date": null,
    "evaluator": null,
    "domain_knowledge_assessment": null,
    "decision": {
      "apply": null,
      "rationale": null,
      "estimated_prep_time": null
    },
    "strengths": [],
    "weaknesses": []
  },
  "processing_log": [
    {
      "timestamp": "2025-07-06T18:50:03.624106",
      "action": "job_fetched",
      "processor": "enhanced_job_fetcher_v6.1",
      "status": "success",
      "details": "Successfully fetched job 64657 from Deutsche Bank API"
    },
    {
      "timestamp": "2025-07-06T18:50:03.624106",
      "action": "description_enriched",
      "processor": "web_scraper",
      "status": "success",
      "details": "Successfully fetched job description (5788 characters)"
    }
  ],
  "raw_source_data": {
    "api_response": {
      "MatchedObjectId": "64657",
      "MatchedObjectDescriptor": {
        "PositionOfferingType": [
          {
            "Name": "Unbefristet"
          }
        ],
        "PositionSchedule": [
          {
            "Name": "Vollzeit"
          }
        ],
        "PublicationChannel": [
          {
            "StartDate": "2025-06-25"
          }
        ],
        "PositionTitle": "Funds Transfer Pricing &amp; IRRBB expert for the Private Bank (f/m/x) [Job Profile: Business Management Lead]",
        "PositionLocation": [
          {
            "CityName": "Frankfurt",
            "CountrySubDivisionName": "Hessen",
            "CountryName": "Deutschland"
          }
        ],
        "PositionURI": "/index.php?ac=jobad&id=64657",
        "PositionID": "64657",
        "OrganizationName": "Frankfurt",
        "PositionHiringYear": "2025",
        "UserArea": {
          "ProDivision": 10032
        },
        "CareerLevel": [
          {
            "Name": "Vice President"
          }
        ],
        "PublicationStartDate": "2025-06-25"
      },
      "RelevanceScore": 0,
      "RelevanceRank": 18
    },
    "specialist_analysis": {},
    "description_source": "web_scraping"
  }
}