{
  "job_metadata": {
    "job_id": "64613",
    "version": "1.0",
    "created_at": "2025-07-10T11:42:57.406283",
    "last_modified": "2025-07-10T11:42:57.406283",
    "source": "deutsche_bank_api",
    "processor": "enhanced_job_fetcher_v6.1",
    "status": "fetched"
  },
  "job_content": {
    "title": "Associate Engineer – AFC Production Support Services (f/m/x)",
    "description": "Associate Engineer – AFC Production Support Services (f/m/x) Job ID:R0384838 Full/Part-Time: Full-time Regular/Temporary: Regular Listed: 2025-06-20 Location: Frankfurt Position Overview Die Deutsche Bank (DB) kann auf eine sehr erfahrene und engagierte Abteilung für die Bekämpfung von Finanzkriminalität (Anti Financial Crime, AFC) zurückgreifen. Diese spielt eine entscheidende Rolle dabei, der Finanzkriminalität bei Geschäftsaktivitäten und globalen Finanzdienstleistungen der DB vorzubeugen und gleichzeitig die Interessen der Bank und der Gesellschaft zu wahren.Um Finanzkriminalität wirksam zu bekämpfen und flexibel auf Herausforderungen zu reagieren, hat AFC eine Matrixstruktur, die regionale, geschäftsbereichsbezogene und globale Funktionen vereint. Sie teilt sich in die folgenden Kernbereiche auf: Anti-Money Laundering, Sanctions & Embargoes, Anti-Fraud, Bribery & Corruption, Investigations & Intelligence, Monitoring & Screening und Risk Assessment. Teil unseres Engagements ist es, eine enge Zusammenarbeit mit allen Geschäftsbereichen und Unterstützungsfunktionen innerhalb unserer Bank zu stärken.Was AFC für Sie tun wirdAFC hilft der Deutschen Bank, langfristig Vertrauen und Mehrwert für unsere Kunden, Mitarbeiter*innen und die Gesellschaft zu schaffen. Dabei wenden wir die höchsten Verhaltensstandards an, um den Erfolg der DB bei der Bekämpfung der Finanzkriminalität zu gewährleisten. Wir bieten Ihnen herausfordernde Möglichkeiten, zu lernen, einen Beitrag zu leisten und von Ihrer Reise mit uns zu profitieren. Wir fördern eine offene und integrative Teamkultur mit dem Ziel, eine gesunde, engagierte und gut unterstützte vielfältige Belegschaft aufzubauen und zu erhalten, die in der Lage ist, ihr Bestes zu geben.Über den BereichTDI sucht für das Anti-Financial-Crime IT Applikationssupport Team einen Produktion Support Analysten, um mehrere Programme zu betreuen. Inhalte der Rolle sind aktiver Produktionssupport, Enduser Kontakt, Incident Management, Problem Management, Change Implementierung über verschiedene Plattformen sowie Zusammenarbeit mit funktionsübergreifenden Teams. Schwerpunkt dieser Aufgabe ist die Unterstützung des Wandels der AFC Division zur Nutzung der Google Cloud Services und weiterer neuer Technologien in einem globalen Supportteam.Ihre AufgabenIn der Aufgabe des Produkt Support Analysten verbindet sich Überwachung, Analyse und Korrektur von technischen und funktionalen Defekten, Alarmmeldungen und zeitnahe Eskalation und Kommunikation mit Anwendern und Verantwortlichen.Einhalten der vereinbarten SLA der Programme durch Einsatz einer Matrix von Monitoring Tools.Anwenden der ITIL Grundsätze im technischen Support sowie Post Mortem - und Root Cause Analysen zur Verbesserung der Systemstabilität, Entwicklung und Durchführung von Workarounds, proaktive Zusammenarbeit mit Verantwortlichen aus Business-, Technikgruppen und Vendoren in kritischen Situationen z.B. Incident CallsProaktives Erkennen von systemischen Fehlern und Freude am Optimieren von manuellen und ineffizienten Prozessen in Zusammenarbeit mit Entwicklungsteams im Problem Management Prozess und hohe Motivation die Migration in Google Cloud spezifische Systeme zu unterstützen.Weitere Inhalte sind Zuarbeit bei Audits, Entwicklung von Skripten, Pflege der Supportdokumentation, Einhalten der Compliance - und regulatorischen Anforderungen im AFC Kontext.Ihre Fähigkeiten und Erfahrungen Voraussetzung: Sehr gutes Verständnis in Red Hat Enterprise Linux: Log Analysen, Prozesssteuerung, Kommandozeilenerfahrung zur Fehlersuche und Störungsbeseitigung.Verständnis von Datenbankkonzepten und Einarbeitung in multi-relationale Datenbanksysteme.Grundkenntnisse über GCP-Konzepte und -Komponenten sind von Vorteil.Erfahrungen im IT-Anwendungssupport ist wünschenswert. Ein Pluspunkt sind bereits Vorerfahrungen im Support komplexer Systeme im Bankenumfeld.Kenntnisse der ITIL-Best Practices zur Unterstützung einer Produktionsumgebung werden erwartet.Von Vorteil sind Kenntnisse in Monitoring Tools: Control M, Grafana, Geneos, Google Cloud Monitoring, Airflow, Splunk.Neben verhandlungssicheren Englischkenntnissen ist Deutsch als Sprache ein PlusWas wir Ihnen bietenWir bieten eine breite Palette von Leistungen, die all Ihre beruflichen und persönlichen Bedürfnisse abdecken.Emotional ausgeglichenEine positive Haltung hilft uns, die Herausforderungen des Alltags zu meistern – beruflich wie privat. Profitieren Sie von Angeboten wie Beratung in schwierigen Lebenssituationen und Angeboten zur Förderung mentaler Gesundheit.Körperlich fitMit Angeboten zur Aufrechterhaltung Ihrer persönlichen Gesundheit und einem förderlichen beruflichen Umfeld hilft Ihnen die Bank, körperlich fit zu bleiben. Profitieren Sie von Angeboten wie umfangreichen Check-up Untersuchungen, Impfangeboten und Beratung zur gesunden Lebensführung.Sozial vernetztDer Austausch mit anderen eröffnet uns neue Perspektiven, bringt uns beruflich wie persönlich voran und stärkt unser Selbstvertrauen und Wohlbefinden. Profitieren Sie von Angeboten wie Unterstützung durch den pme Familienservice, das FitnessCenter Job, flexible Arbeitszeitmodelle (bspw. Teilzeit, Jobtandem, hybrides Arbeiten) sowie einer umfangreichen Kultur der Vielfalt, Chancengleichheit und Teilhabe.Finanziell abgesichertDie Bank sichert Sie nicht nur während Ihrer aktiven Karriere, sondern auch für die Zukunft finanziell ab und unterstützt Ihre Flexibilität sowie Mobilität – egal ob privat oder beruflich. Profitieren Sie von Angeboten wie Beitragsplänen für Altersvorsorge, Bankdienstleistungen für Mitarbeiter*innen, Firmenfahrrad oder dem Deutschlandticket.Da die Benefits je nach Standort geringfügig variieren, gehen Sie bitte bei konkreten Fragen auf Ihren Recruiter / Ihre Recruiterin zu.Die Stelle wird in Voll- und in Teilzeit angeboten.Bei Fragen zum Rekrutierungsprozess steht Ihnen Ayse Kartal-Isik gerne zur Verfügung.Kontakt Ayse Kartal-Isik: 069-910-42410______________________________________________________________________________Deutsche Bank (DB) benefits from having a highly experienced and dedicated Anti Financial Crime (AFC) function, which performs a crucial role in keeping DBs business operations and global financial services clean from financial crime while serving the interests of the bank and society.In order to combat financial crime effectively and respond to challenges in a flexible manner, AFC has a matrix structure combining regional, business line and global functional coverage in our core areas of Anti-Money Laundering, Sanctions & Embargoes, Anti-Fraud, Bribery & Corruption, Investigations & Intelligence, Monitoring & Screening, and Risk Assessment. Part of our commitment is to strengthen a strong collaboration with all business lines and support functions within our bank.What AFC will do for youAFC helps Deutsche Bank generate long-term trust and add value for our clients, staff and society and provide challenging opportunities for you to learn, contribute and benefit from your journey with us. We foster an open and inclusive team culture with the aim to build and maintain a healthy, engaged and well-supported diverse workforce that is equipped to do their best and enjoy their lives inside and outside the workplace, whilst applying the highest standards of conduct to guarantee DB´s success in fighting financial crime.Details of the role and how it fits into the teamDeutsche Bank’s AFC production services team is an associate for production support specialist to provide technical support for multiple applications. The role involves hands-on production support, end to end issue management across multiple platforms. This position supports the AFC division’s transformation journey leveraging Google cloud and new technologies.Your key responsibilitiesProvide technical support by monitoring, consulting, and resolving BAU issues, incidents, and alerts for relevant applications, ensuring timely escalation and effective communication with users and stakeholders.Perform root cause analysis and post-mortem investigations using ITIL standards, analyze batch processing and interface errors, and deliver resolutions or workarounds for incidents and problems.Support the resolution of high-impact incidents by attending incident bridge calls, collaborating with development teams, and ensuring open problems are resolved or assigned appropriately.Facilitate smooth handover of new projects/applications into production, assist in code release deploymnents, and keep stakeholders informed using standardized communication templates.Approach support with a proactive attitude, desire to seek root cause, in-depth analysis, and strive to reduce inefficiencies and manual efforts fostering technical upskill and knowledge sharing.Keen to learn automating routine tasks and drive operational improvements through scripts and tools, while supporting the migration of applications to Google Cloud and adoption of new technologies.Ensure compliance with audit and regulatory requirements, proactively identify performance bottlenecks, and implement optimization strategies for AFC applications.Your skills and experiencesPrior experience in providing hands on IT application support is desirable. A plus is already prior experience in the production support framework.Fundamental knowledge of GCP concepts and components is a plus.Strong experience of ITIL best practices for supporting a production environment.Good to have knowledge in Monitoring Tools: Control M, Grafana, Geneos, Google Cloud Monitoring, Airflow, Splunk.Red Hat Enterprise Linux (RHEL) – professional skill in searching logs, process commands, start/stop processes, use of OS commands to aid in tasks needed to resolve or investigate issues.Understanding of database concepts and exposure in working with multiple relational database management systems.In addition to fluent English, German is a plus as a language.What we offerWe provide you with a comprehensive portfolio of benefits and offerings to support both, your private and professional needs.Emotionally and mentally balancedA positive mind helps us master the challenges of everyday life – both professionally and privately. We offer consultation in difficult life situations as well as mental health awareness trainings.Physically thrivingWe support you in staying physically fit through an offering to maintain personal health and a professional environment. You can benefit from health check-ups; vaccination drives as well as advice on healthy living and nutrition.Socially connectedNetworking opens up new perspectives, helps us thrive professionally and personally as well as strengthens our self-confidence and well-being. You can benefit from PME family service, FitnessCenter Job, flexible working (e.g parttime, hybrid working, job tandem) as well as an extensive culture of diversity, equity and inclusion.Financially secureWe provide you with financial security not only during your active career but also for the future. You can benefit from offerings such as pension plans, banking services, company bicycle or “Deutschlandticket”.Since our offerings slightly vary across locations, please contact your recruiter with specific questions.This job is available in full and parttime.In case of any recruitment related questions, please get in touch with Ayse Kartal-Isik.Contact Ayse Kartal-Isik: 069-910-42410 Wir streben eine Unternehmenskultur an, in der wir gemeinsam jeden Tag das Beste geben. Dazu gehören verantwortungsvolles Handeln, wirtschaftliches Denken, Initiative ergreifen und zielgerichtete Zusammenarbeit.Gemeinsam teilen und feiern wir die Erfolge unserer Mitarbeiter*innen. Gemeinsam sind wir die Deutsche Bank Gruppe.Wir begrüßen Bewerbungen von allen Menschen und fördern ein positives, faires und integratives Arbeitsumfeld.",
    "requirements": [
      "providing hands on IT application support is desirable. A plus is already prior experience in the production support framework.Fundamental knowledge of GCP concepts and components is a plus.Strong experience of ITIL best practices for supporting a production environment.Good to have knowledge in Monitoring Tools: Control M"
    ],
    "location": {
      "city": "Frankfurt",
      "state": "Hessen",
      "country": "Deutschland",
      "remote_options": false
    },
    "employment_details": {
      "type": "Unbefristet",
      "schedule": "Vollzeit",
      "career_level": "kein Corporate Title",
      "salary_range": null,
      "benefits": []
    },
    "organization": {
      "name": "Deutsche Bank",
      "division": "Frankfurt",
      "division_id": 10052
    },
    "posting_details": {
      "publication_date": "2025-06-20",
      "position_uri": "/index.php?ac=jobad&id=64613",
      "hiring_year": "2025"
    }
  },
  "evaluation_results": {
    "cv_to_role_match": null,
    "match_confidence": null,
    "evaluation_date": null,
    "evaluator": null,
    "domain_knowledge_assessment": null,
    "decision": {
      "apply": null,
      "rationale": null,
      "estimated_prep_time": null
    },
    "strengths": [],
    "weaknesses": []
  },
  "processing_log": [
    {
      "timestamp": "2025-07-10T11:42:57.406283",
      "action": "job_fetched",
      "processor": "enhanced_job_fetcher_v6.1",
      "status": "success",
      "details": "Successfully fetched job 64613 from Deutsche Bank API"
    },
    {
      "timestamp": "2025-07-10T11:42:57.406283",
      "action": "description_enriched",
      "processor": "web_scraper",
      "status": "success",
      "details": "Successfully fetched job description (11826 characters)"
    }
  ],
  "raw_source_data": {
    "api_response": {
      "MatchedObjectId": "64613",
      "MatchedObjectDescriptor": {
        "PositionOfferingType": [
          {
            "Name": "Unbefristet"
          }
        ],
        "PositionSchedule": [
          {
            "Name": "Vollzeit"
          }
        ],
        "PublicationChannel": [
          {
            "StartDate": "2025-06-20"
          }
        ],
        "PositionTitle": "Associate Engineer – AFC Production Support Services (f/m/x)",
        "PositionLocation": [
          {
            "CityName": "Frankfurt",
            "CountrySubDivisionName": "Hessen",
            "CountryName": "Deutschland"
          }
        ],
        "PositionURI": "/index.php?ac=jobad&id=64613",
        "PositionID": "64613",
        "OrganizationName": "Frankfurt",
        "PositionHiringYear": "2025",
        "UserArea": {
          "ProDivision": 10052
        },
        "CareerLevel": [
          {
            "Name": "kein Corporate Title"
          }
        ],
        "PublicationStartDate": "2025-06-20"
      },
      "RelevanceScore": 0,
      "RelevanceRank": 40
    },
    "specialist_analysis": {},
    "description_source": "web_scraping"
  }
}