{
  "job_metadata": {
    "job_id": "61127",
    "version": "1.0",
    "created_at": "2025-07-10T12:51:04.684470",
    "last_modified": "2025-07-10T12:51:04.684470",
    "source": "deutsche_bank_api",
    "processor": "enhanced_job_fetcher_v6.1",
    "status": "fetched"
  },
  "job_content": {
    "title": "DWS - Investment Writer / Finanz-Journalist – ETFs &amp; Passive Investments (m/w/d)",
    "description": "DWS - Investment Writer / Finanz-Journalist – ETFs & Passive Investments (m/w/d) Job ID:R0375235 Full/Part-Time: Full-time Regular/Temporary: Regular Listed: 2025-03-05 Location: Frankfurt Position Overview Über die DWSHeutzutage sind die Märkte einer ganzen Reihe von Risiken ausgesetzt - aber auch einer ganzen Reihe von Chancen. Die Chance, anders zu innovieren. Die Chance, verantwortungsvoll zu investieren. Und die Chance, etwas zu verändern.Kommen Sie zu DWS und werden Sie Teil eines branchenführenden Unternehmens mit globaler Präsenz. Hier werden Sie bestärkt, ehrgeizige Programme zu leiten, um die Zukunft des Investierens zu gestalten und unsere Kunden, lokale Gemeinschaften und die Umwelt zu unterstützen.Wir suchen kreative Denker und Innovatoren, um die Chancen von morgen zu nutzen und die bestmögliche Grundlage für die finanzielle Zukunft unserer Kunden zu schaffen. Aus diesem Grund sind wir \"Investors for a new now\".Im Gegenzug bieten wir Ihnen die Plattform, die Sie brauchen, um etwas zu bewirken, indem Sie mit einigen der größten Vordenker der Branche zusammenarbeiten.Das ist Ihre Chance, Ihre Ziele zu erreichen und eine außergewöhnliche Karriere zu führen. Das ist Ihre Chance, in Ihre Zukunft zu investieren.Lesen Sie hier mehr über DWS und wer wir sind.Über Xtrackers by DWSXtrackers by DWS, die globale Plattform für ETF- und ETC-Lösungen der DWS, verfügt mit einem verwalteten Vermögen von mehr als 240 Milliarden EURO (Stand: 29. Januar 2025) über eine der größten und etabliertesten Produktpaletten in Europa. Wir blicken auf eine über 20-jährige Erfahrung in der Indexnachbildung zurück und offerieren eine breite Palette effizienter, hochwertiger ETFs und ETCs in allen wichtigen Anlageklassen – Aktien, Anleihen und Rohstoffe. Darüber hinaus bietet Xtrackers zahlreiche Bausteine für traditionelle Anlagestrategien, ESG-Strategien g), Sektor- und Faktorinvestitionen sowie innovative Produktlösungen für thematische Anlagen und Zukunftstrends.Über das Xtrackers-Marketingteam:Das Xtrackers-Marketingteam ist verantwortlich für die Positionierung der Marke „Xtrackers by DWS“ als einer der weltweit führenden ETF-Anbieter. Zur Steigerung der Markenbekanntheit, der Kundenbindung und zur Unterstützung der Xtrackers Geschäftsziele entwickelt das Team innovative Konzepte und Inhalte und nutzt dabei das gesamte Spektrum der verfügbaren Kanäle. Dabei arbeiten wir eng mit den weiteren Marketing- und Kommunikationsfunktionen der DWS zusammen, um die Botschaften, die relevanten Kanäle und Formate für die jeweiligen Zielgruppen zu definieren.Rollenbeschreibung:Für das Xtrackers-Marketing-Team mit Sitz in Frankfurt suchen wir einen Investment Writer (m/w) der das Team bei der Entwicklung und Umsetzung einer globalen Content-Strategie unterstützt, welche auf die allgemeinen Vertriebs- und Marketingziele von Xtrackers einzahlt.Innerhalb des Xtrackers Marketingteams ist der Investment Writer verantwortlich für die Planung und Umsetzung einer Content-Strategie, die auf die allgemeinen Vertriebs- und Marketingziele von Xtrackers einzahlt. Als Investment Writer sind Sie ebenfalls verantwortlich die von Ihnen erstellten Inhalte per Analytics zu messen und entsprechend anzupassen.Sie sind Mitglied des Xtrackers-Marketingteams (Functional Role Title: Marketing Manager) mit Sitz in Frankfurt und verantwortlich für:Entwicklung, Ausarbeitung und Implementierung einer globalen Xtrackers Content-Strategie unter Berücksichtigung regionaler Anforderungen und der bestehenden und neuen Vertriebskanäle.Erstellung neuer Texte bzw. Überarbeitung bereits existierender ETF-bezogener Inhalte für eine breite Palette an Marketinginstrumenten, die sich sowohl an institutionelle Kunden als auch an Endkunden richten können.Hierzu gehören unter anderem Finanz-Formate, Website-Inhalte, Blog-Artikel, Newsletter und Thementexte. Die entsprechenden Kanäle umfassen Online-Medien inkl. eigener Webseiten, Partner-Webseiten und Social Media sowie E-Mail-Formate, Video, Audio und Print. Ausarbeitung von SEO optimierten Texten.Auswertung der erstellten Inhalte über Analytics Tools und entsprechende Umsetzung der ErkenntnisseUnterstützung bei der Ad-Hoc Erstellung von Inhalten.Enge Zusammenarbeit mit Kollegen aus den Bereichen Produkt, Sales, Research, Compliance und Marketing.Regulatorische Abstimmung von Inhalten mit der jeweiligen landesspezifischen Compliance-AbteilungAnforderungen:Für eine Bewerbung sollten Sie über die folgenden Kernkompetenzen verfügen:Mindestens 3 Jahre Erfahrung im Bereich Finanz-Journalismus als Investment-Autor, Finanz-/Wirtschaftsjournalist oder als Finanzexperte innerhalb einer Kommunikationsagentur.Fundierte Kenntnisse im Bereich Indexing, ETF-Produkte und passives Investieren sowie generelles Verständnis der EMEA-Märkte.Tiefes Verständnis der Vermögensverwalter-Branche über alle Anlageklassen und Kanäle hinweg.Expertise im Verfassen von überzeugenden Finanztexten unter Berücksichtigung unterschiedlicher Zielgruppen, Schreibstiele und regionaler regulatorischer Anforderungen.Wir suchenErfahrung in der Entwicklung von Content-Strategien im Bereich ETFs / ETCs.Finanzexpertise im Asset Management sowie Erfahrung von Kommunikations-Agentur mit Kenntnissen von Abläufen und Prozessen von VorteilVerständnis unterschiedlicher Zielgruppen-Bedürfnisse b2b und b2c sowie b2b2c.Fundierte Kenntnisse in Search Engine Optimisation (SEO) und digitale Affinität.Verständnis von Daten-Analysen. Aufgeschlossene Persönlichkeit, die gekonnt auf allen Ebenen und über kulturelle Grenzen hinweg kommuniziert.Hohes Maß an Eigenverantwortung und Zuverlässigkeit.Sprachen: Deutsch und Englisch fließend in Wort und Schrift, weitere Sprachen von Vorteil.Ausschreibungszeitraum: 11.02.2025 bis auf weiteresWir bieten:Ohne den Ehrgeiz unserer Mitarbeiter wären unsere Erfolge nicht möglich. Und es ist uns wichtig, dass Sie gerne zur Arbeit kommen – gesund, glücklich und wertgeschätzt. Bei der DWS haben Sie Zugriff auf eine Reihe von Benefits, aus denen Sie wählen können und die speziell auf Ihren Lebensstil abgestimmt sind. Egal, ob Sie sich für die Gesundheitsversorgung oder betriebliche Vergünstigungen interessieren oder über Ihre Altersvorsorge nachdenken, es ist für jeden etwas dabei.Einige unserer Benefits:Leistungen zur körperlichen und geistigen Gesundheit, einschließlich (aber nicht beschränkt auf) der gesetzlichen Krankenversicherung (BKK), Krankengeld und Support-Hotlines für MitarbeiterFamilienfreundliche Leistungen, einschließlich großzügiger Elternzeitpakete (unterstützt alle Varianten von Familienformen) und Unterstützung bei der Suche nach Kinderbetreuungsmöglichkeiten, einschließlich des DWS-eigenen KindergartenservicesEine Vielzahl an Pensionsplänen, persönlichen Budgetkonten zur Ermöglichung von Sabbaticals oder vorzeitigem Ruhestand sowie vermögenswirksamen LeistungenDie Möglichkeit, unsere CSR-Strategie zu unterstützen, die sich auf die Bekämpfung des Klimawandels und die Erreichung größerer sozialer Gerechtigkeit konzentriert. Sie können an unsere Partnerorganisationen spenden oder sich an Corporate-Volunteering-Möglichkeiten in Ihren lokalen Gemeinden beteiligen, indem Sie uns vor Ort unterstützenLeistungen zur Mobilität, beispielsweise ein voll subventioniertes Deutschlandticket sowie Angebote zu Firmenwagen und JobRadDas aktuelle Hybrid-Arbeitsmodell der DWS ist darauf ausgelegt, die Balance zwischen persönlicher Zusammenarbeit und Engagement im Büro zu finden, die den Kern unserer Arbeitskultur ausmacht. Wir setzen uns für die Unterstützung flexibler und hybrider Arbeitsvereinbarungen auf der ganzen Welt ein. Abhängig von dem Standort oder der Stelle, auf die Sie sich bewerben, wird die Aufteilung zwischen der Arbeit im Büro und der Arbeit zu Hause im Rahmen Ihres Bewerbungs- und Interviewprozesses besprochen.Wir werden unsere Arbeitsumgebungen und -methoden weiterhin überprüfen und weiterentwickeln, um bestmögliche Arbeitsbedingungen für unsere Mitarbeiter zu schaffen.Wenn Sie aus irgendeinem Grund, einschließlich oder im Zusammenhang mit einer Behinderung oder einem langfristigen Gesundheitszustand, Anpassungen oder Änderungen am Bewerbungsprozess benötigen, wenden Sie sich bitte an Ihren Recruiter und teilen Sie uns mit, welche Unterstützung Sie möglicherweise benötigen. Beispiele für Anpassungen sind die Änderung des Interviewformats oder die Bereitstellung von Unterstützung in den Räumlichkeiten der DWS. Dies hat keine Auswirkungen auf Ihre Bewerbung und Ihr Rekrutierungsteam wird die Optionen mit Ihnen besprechen. Wir streben eine Unternehmenskultur an, in der wir gemeinsam jeden Tag das Beste geben. Dazu gehören verantwortungsvolles Handeln, wirtschaftliches Denken, Initiative ergreifen und zielgerichtete Zusammenarbeit.Gemeinsam teilen und feiern wir die Erfolge unserer Mitarbeiter*innen. Gemeinsam sind wir die Deutsche Bank Gruppe.Wir begrüßen Bewerbungen von allen Menschen und fördern ein positives, faires und integratives Arbeitsumfeld.",
    "requirements": [],
    "location": {
      "city": "Frankfurt",
      "state": "Hessen",
      "country": "Deutschland",
      "remote_options": false
    },
    "employment_details": {
      "type": "Unbefristet",
      "schedule": "Vollzeit",
      "career_level": "Assistant Vice President",
      "salary_range": null,
      "benefits": []
    },
    "organization": {
      "name": "Deutsche Bank",
      "division": "Frankfurt",
      "division_id": 4
    },
    "posting_details": {
      "publication_date": "2025-03-05",
      "position_uri": "/index.php?ac=jobad&id=61127",
      "hiring_year": "2025"
    }
  },
  "evaluation_results": {
    "cv_to_role_match": null,
    "match_confidence": null,
    "evaluation_date": null,
    "evaluator": null,
    "domain_knowledge_assessment": null,
    "decision": {
      "apply": null,
      "rationale": null,
      "estimated_prep_time": null
    },
    "strengths": [],
    "weaknesses": []
  },
  "processing_log": [
    {
      "timestamp": "2025-07-10T12:51:04.684470",
      "action": "job_fetched",
      "processor": "enhanced_job_fetcher_v6.1",
      "status": "success",
      "details": "Successfully fetched job 61127 from Deutsche Bank API"
    },
    {
      "timestamp": "2025-07-10T12:51:04.684470",
      "action": "description_enriched",
      "processor": "web_scraper",
      "status": "success",
      "details": "Successfully fetched job description (8985 characters)"
    }
  ],
  "raw_source_data": {
    "api_response": {
      "MatchedObjectId": "61127",
      "MatchedObjectDescriptor": {
        "PositionOfferingType": [
          {
            "Name": "Unbefristet"
          }
        ],
        "PositionSchedule": [
          {
            "Name": "Vollzeit"
          }
        ],
        "PublicationChannel": [
          {
            "StartDate": "2025-03-05"
          }
        ],
        "PositionTitle": "DWS - Investment Writer / Finanz-Journalist – ETFs &amp; Passive Investments (m/w/d)",
        "PositionLocation": [
          {
            "CityName": "Frankfurt",
            "CountrySubDivisionName": "Hessen",
            "CountryName": "Deutschland"
          }
        ],
        "PositionURI": "/index.php?ac=jobad&id=61127",
        "PositionID": "61127",
        "OrganizationName": "Frankfurt",
        "PositionHiringYear": "2025",
        "UserArea": {
          "ProDivision": 4
        },
        "CareerLevel": [
          {
            "Name": "Assistant Vice President"
          }
        ],
        "PublicationStartDate": "2025-03-05"
      },
      "RelevanceScore": 0,
      "RelevanceRank": 64
    },
    "specialist_analysis": {},
    "description_source": "web_scraping"
  }
}