{
  "job_metadata": {
    "job_id": "64943",
    "version": "1.0",
    "created_at": "2025-07-06T18:40:43.995168",
    "last_modified": "2025-07-06T18:40:43.995168",
    "source": "deutsche_bank_api",
    "processor": "enhanced_job_fetcher_v6.1",
    "status": "fetched"
  },
  "job_content": {
    "title": "Junior Investment Strategist (d/m/w)",
    "description": "Junior Investment Strategist (d/m/w) Job ID:R0389754 Full/Part-Time: Full-time Regular/Temporary: Regular Listed: 2025-07-04 Location: Frankfurt Position Overview Teambeschreibung und RollendetailsDas Chief Investment Office (CIO) der Privatkundenbank verantwortet die Entwicklung und Kommunikation des Private Bank House Views, die Investmentstrategie sowie die Generierung und Pflege von Model-Portfolien für das diskretionäre Portfoliomanagement der Privatkundenbank. Darüber hinaus werden in dem Bereich die Fixed-Income und Equity Empfehlungslisten für das Advisory Geschäft erstellt. Die Rolle ist Teil des globalen Teams PB CIO Investmentstrategie, das die Verantwortung für die Entwicklung der Anlagestrategie für PrivatkundInnen trägt.Ihre HauptverantwortlichkeitenUnterstützung bei der Erstellung von Markteinschätzungen und Formulierung von konkreten Handlungsempfehlungen für PrivatkundenNutzung externer Quellen als Vorbereitung zur Analyse, sowie Analyse von Nachrichten, Research-Berichten und Märkten, um daraus interessante/relevante Themen/Trends zu identifizieren und zu formulierenErstellung von eigenen redaktionellen Beiträgen für Newsletter einschließlich Graphiken, Charts etc.Unterstützung für deutschsprachige Publikationen in Eigenerstellung und auf Basis englischsprachiger Beiträge des Teams.Ihre Fähigkeiten und ErfahrungenGutes Verständnis von volkswirtschaftlichen Zusammenhängen (mikro- und makroökonomisch) sowie der Kapitalmärkte (in Theorie und Praxis) und hohes Interesse an gesellschaftspolitischen Fragestellungen, ökonomischen Themen sowie der Entwicklungen an den globalen KapitalmärktenHohes Maß an Eigenverantwortung, Flexibilität innerhalb neuer Themen und Fähigkeit, unter Zeitdruck fehlerfrei zu arbeitenTeam- und Kontaktfähigkeit, überzeugendes Auftreten und ausgeprägte EntscheidungskompetenzGute Ausdrucksweise in Wort und besonders Schrift, ausgeprägte Kommunikationsfähigkeit und fließende Sprachkenntnisse in Deutsch und EnglischErfolgreich abgeschlossenes, wirtschaftswissenschaftliches Studium, Berufserfahrung wünschenswert aber keine VoraussetzungWas wir Ihnen bietenWir bieten eine breite Palette von Leistungen, die all Ihre beruflichen und persönlichen Bedürfnisse abdecken.Emotional ausgeglichenEine positive Haltung hilft uns, die Herausforderungen des Alltags zu meistern – beruflich wie privat. Profitieren Sie von Angeboten wie Beratung in schwierigen Lebenssituationen und Angeboten zur Förderung mentaler Gesundheit.Körperlich fitMit Angeboten zur Aufrechterhaltung Ihrer persönlichen Gesundheit und einem förderlichen beruflichen Umfeld hilft Ihnen die Bank, körperlich fit zu bleiben. Profitieren Sie von Angeboten wie umfangreichen Check-up Untersuchungen, Impfangeboten und Beratung zur gesunden Lebensführung.Sozial vernetztDer Austausch mit anderen eröffnet uns neue Perspektiven, bringt uns beruflich wie persönlich voran und stärkt unser Selbstvertrauen und Wohlbefinden. Profitieren Sie von Angeboten wie Unterstützung durch den pme Familienservice, das FitnessCenter Job, flexible Arbeitszeitmodelle (bspw. Teilzeit, Jobtandem, hybrides Arbeiten) sowie einer umfangreichen Kultur der Vielfalt, Chancengleichheit und Teilhabe.Finanziell abgesichertDie Bank sichert Sie nicht nur während Ihrer aktiven Karriere, sondern auch für die Zukunft finanziell ab und unterstützt Ihre Flexibilität sowie Mobilität – egal ob privat oder beruflich. Profitieren Sie von Angeboten wie Beitragsplänen für Altersvorsorge, Bankdienstleistungen für Mitarbeiter*innen, Firmenfahrrad oder dem Deutschlandticket.Da die Benefits je nach Standort geringfügig variieren, gehen Sie bitte bei konkreten Fragen auf Ihren Recruiter / Ihre Recruiterin zu.Die Stelle wird in Voll- und in Teilzeit angeboten.Bei Fragen zum Rekrutierungsprozess steht Ihnen Madeleine Müller gerne zur Verfügung. Kontakt Madeleine Müller: +49 151 40648855 Wir streben eine Unternehmenskultur an, in der wir gemeinsam jeden Tag das Beste geben. Dazu gehören verantwortungsvolles Handeln, wirtschaftliches Denken, Initiative ergreifen und zielgerichtete Zusammenarbeit.Gemeinsam teilen und feiern wir die Erfolge unserer Mitarbeiter*innen. Gemeinsam sind wir die Deutsche Bank Gruppe.Wir begrüßen Bewerbungen von allen Menschen und fördern ein positives, faires und integratives Arbeitsumfeld.",
    "requirements": [],
    "location": {
      "city": "Frankfurt",
      "state": "Hessen",
      "country": "Deutschland",
      "remote_options": false
    },
    "employment_details": {
      "type": "Unbefristet",
      "schedule": "Vollzeit",
      "career_level": "kein Corporate Title",
      "salary_range": null,
      "benefits": []
    },
    "organization": {
      "name": "Deutsche Bank",
      "division": "Frankfurt",
      "division_id": 10032
    },
    "posting_details": {
      "publication_date": "2025-07-04",
      "position_uri": "/index.php?ac=jobad&id=64943",
      "hiring_year": "2025"
    }
  },
  "evaluation_results": {
    "cv_to_role_match": null,
    "match_confidence": null,
    "evaluation_date": null,
    "evaluator": null,
    "domain_knowledge_assessment": null,
    "decision": {
      "apply": null,
      "rationale": null,
      "estimated_prep_time": null
    },
    "strengths": [],
    "weaknesses": []
  },
  "processing_log": [
    {
      "timestamp": "2025-07-06T18:40:43.995168",
      "action": "job_fetched",
      "processor": "enhanced_job_fetcher_v6.1",
      "status": "success",
      "details": "Successfully fetched job 64943 from Deutsche Bank API"
    },
    {
      "timestamp": "2025-07-06T18:40:43.995168",
      "action": "description_enriched",
      "processor": "web_scraper",
      "status": "success",
      "details": "Successfully fetched job description (4316 characters)"
    }
  ],
  "raw_source_data": {
    "api_response": {
      "MatchedObjectId": "64943",
      "MatchedObjectDescriptor": {
        "PositionOfferingType": [
          {
            "Name": "Unbefristet"
          }
        ],
        "PositionSchedule": [
          {
            "Name": "Vollzeit"
          }
        ],
        "PublicationChannel": [
          {
            "StartDate": "2025-07-04"
          }
        ],
        "PositionTitle": "Junior Investment Strategist (d/m/w)",
        "PositionLocation": [
          {
            "CityName": "Frankfurt",
            "CountrySubDivisionName": "Hessen",
            "CountryName": "Deutschland"
          }
        ],
        "PositionURI": "/index.php?ac=jobad&id=64943",
        "PositionID": "64943",
        "OrganizationName": "Frankfurt",
        "PositionHiringYear": "2025",
        "UserArea": {
          "ProDivision": 10032
        },
        "CareerLevel": [
          {
            "Name": "kein Corporate Title"
          }
        ],
        "PublicationStartDate": "2025-07-04"
      },
      "RelevanceScore": 0,
      "RelevanceRank": 1
    },
    "specialist_analysis": {},
    "description_source": "web_scraping"
  }
}