{
  "job_metadata": {
    "job_id": "64255",
    "version": "1.0",
    "created_at": "2025-07-10T11:53:32.974798",
    "last_modified": "2025-07-10T11:53:32.974798",
    "source": "deutsche_bank_api",
    "processor": "enhanced_job_fetcher_v6.1",
    "status": "fetched"
  },
  "job_content": {
    "title": "Senior Flow Designer (Microsoft Power Platform) &amp; RPA Developer (f/m/x)",
    "description": "Senior Flow Designer (Microsoft Power Platform) & RPA Developer (f/m/x) Job ID:R0392141 Full/Part-Time: Full-time Regular/Temporary: Regular Listed: 2025-06-11 Location: Frankfurt Position Overview Bereich/Team:TDI – CIO People, Procurement and Legal: HR Technology ist für das Management und die strategische Ausrichtung der globalen HR-Systeme verantwortlich und wirkt sich positiv auf die gesamte Mitarbeitergemeinschaft aus. Die Arbeit in diesem Bereich bietet zahlreiche Möglichkeiten, an modernsten Technologielösungen zu arbeiten sowie auch die Möglichkeit, die positiven Auswirkungen auf die Mitarbeitenden und die Bank voranzutreiben. Gemeinsam mit HR treiben wir die Modernisierung und Digitalisierung unserer Produkte voran und setzen dabei bereits modernste Technologien ein.Wir arbeiten eng mit unseren HR-Ansprechpartner*innen und den relevanten COO-Einheiten zusammen. Insgesamt betreuen wir mehr als 100 Systeme, darunter bereits mehrere SaaS-Lösungen wie Servicenow HRSD, AEM Forms, DocuSign, Perceptive Content uvm. HR-Technology ist eine internationale Einheit mit Sitz hauptsächlich in Frankfurt und Pune (Indien).Verantwortlichkeiten:Entwicklung, Implementierung und Pflege von Microsoft Power Automate Flows/ Apps und RPA-Lösungen zur Optimierung von HR-Geschäftsprozessen unter Berücksichtigung der agilen Softwareentwicklung mit SCRUMAnbindung von Power Apps und Flows an diverse Datenquellen (SharePoint, Excel, SQL-Server, Dataverse etc.)Implementierung von robusten Fehlerbehandlungsmechanismen zur Sicherstellung der WorkflowsVerwaltung des Wartungs- und Automatisierungsbacklogs inklusive Backlog Test, Abnahme und Training in Zusammenarbeit mit dem globalen Poduct Ownern, Entwicklern und FachbereichenSicherstellung der Systemintegrität und -stabilität im Power Platform Umfeld unter Berücksichtigung von Audit- und Compliance-AnforderungenErstellung von Dokumentation für entwickelte Apps und Workflows, um die Wartbarkeit und den Wissenstransfer zu gewährleistenFähigkeiten & Erfahrungen:Abgeschlossenes Studium der Wirtschaftsinformatik, Betriebswirtschaftslehre oder eine vergleichbare QualifikationMehrjährige Berufserfahrung als Flow Designer, idealerweise in HR in einer vergleichbaren PositionSicherer Umgang mit Analysetools wie JIRA, ConfluenceErfahrung mit agilem Projektmanagement und in der Zusammenarbeit mit agilen TeamsAusgeprägte analytische; konzeptionelle und ProblemlösungsfähigkeitenKenntnisse in der Analyse und Optimierung von HR Geschäftsprozessen wünschenswertSehr gute Kenntnisse in Deutsch und Englisch in Wort und SchriftWas wir Ihnen bietenWir bieten eine breite Palette von Leistungen, die all Ihre beruflichen und persönlichen Bedürfnisse abdecken.Emotional ausgeglichenEine positive Haltung hilft uns, die Herausforderungen des Alltags zu meistern – beruflich wie privat. Profitieren Sie von Angeboten wie Beratung in schwierigen Lebenssituationen und Angeboten zur Förderung mentaler Gesundheit.Körperlich fitMit Angeboten zur Aufrechterhaltung Ihrer persönlichen Gesundheit und einem förderlichen beruflichen Umfeld hilft Ihnen die Bank, körperlich fit zu bleiben. Profitieren Sie von Angeboten wie umfangreichen Check-up Untersuchungen, Impfangeboten und Beratung zur gesunden Lebensführung.Sozial vernetztDer Austausch mit anderen eröffnet uns neue Perspektiven, bringt uns beruflich wie persönlich voran und stärkt unser Selbstvertrauen und Wohlbefinden. Profitieren Sie von Angeboten wie Unterstützung durch den pme Familienservice, das FitnessCenter Job, flexible Arbeitszeitmodelle (bspw. Teilzeit, Jobtandem, hybrides Arbeiten) sowie einer umfangreichen Kultur der Vielfalt, Chancengleichheit und Teilhabe.Finanziell abgesichertDie Bank sichert Sie nicht nur während Ihrer aktiven Karriere, sondern auch für die Zukunft finanziell ab und unterstützt Ihre Flexibilität sowie Mobilität – egal ob privat oder beruflich. Profitieren Sie von Angeboten wie Beitragsplänen für Altersvorsorge, Bankdienstleistungen für Mitarbeiter*innen, Firmenfahrrad oder dem Deutschlandticket.Da die Benefits je nach Standort geringfügig variieren, gehen Sie bitte bei konkreten Fragen auf Ihren Recruiter / Ihre Recruiterin zu.Die Stelle wird in Voll- und in Teilzeit angeboten.Bei Fragen zum Rekrutierungsprozess steht Ihnen Michaela Peschke gerne zur Verfügung.Kontakt Michaela Peschke: 069-910-43951++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++TDI – CIO People, Procurement and Legal: HR Technology is responsible for the management and strategic direction of global HR systems, making a positive impact on the entire employee community. Working in this area offers numerous opportunities to engage with cutting-edge technology solutions while also contributing to meaningful improvements for employees and the organization. Together with our HR partners, we are driving the modernization and digitalization of our products, already leveraging state-of-the-art technologies in the process. We collaborate closely with our HR stakeholders and relevant COO units. In total, we manage over 100 systems, including several SaaS solutions such as ServiceNow HRSD, AEM Forms, DocuSign, and Perceptive Content, among others. HR Technology is an international unit primarily based in Frankfurt and Pune (India). Key Responsibilities: Design, implement and maintain RPA solutions & Microsoft Power Automate Flows and Power Apps to streamline HR business processes in an agile SCRUM environmentIntegrate Power Apps and Flows with various data sources (e.g., SharePoint, Excel, SQL Server, Dataverse)Develop robust error-handling mechanisms to ensure workflow reliabilityManage the maintenance and automation backlog, including testing, acceptance, and training, in collaboration with global Product Owners, developers, and business unitsEnsure system integrity and stability within the Power Platform ecosystem, adhering to audit and compliance standardsCreate comprehensive documentation for developed apps and workflows to support maintainability and knowledge transferSkills & experience: Degree in Business Informatics, Business Administration, or a comparable qualificationSeveral years of experience as a Flow Designer, ideally in an HR-related contextProficient in tools such as JIRA and ConfluenceExperience with agile project management and collaboration in agile teamsStrong analytical, conceptual, communication and problem-solving skillsFamiliarity with HR process optimization is a plusVery good German and English language skills (written and spoken)What we offerWe provide you with a comprehensive portfolio of benefits and offerings to support both, your private and professional needs.Emotionally and mentally balancedA positive mind helps us master the challenges of everyday life – both professionally and privately. We offer consultation in difficult life situations as well as mental health awareness trainings.Physically thrivingWe support you in staying physically fit through an offering to maintain personal health and a professional environment. You can benefit from health check-ups; vaccination drives as well as advice on healthy living and nutrition.Socially connectedNetworking opens up new perspectives, helps us thrive professionally and personally as well as strengthens our self-confidence and well-being. You can benefit from PME family service, FitnessCenter Job, flexible working (e.g parttime, hybrid working, job tandem) as well as an extensive culture of diversity, equity and inclusion.Financially secureWe provide you with financial security not only during your active career but also for the future. You can benefit from offerings such as pension plans, banking services, company bicycle or “Deutschlandticket”.Since our offerings slightly vary across locations, please contact your recruiter with specific questions.This job is available in full and parttime.In case of any recruitment related questions, please get in touch with Michaela Peschke. Contact Michaela Peschke: 069-910-43951 Wir streben eine Unternehmenskultur an, in der wir gemeinsam jeden Tag das Beste geben. Dazu gehören verantwortungsvolles Handeln, wirtschaftliches Denken, Initiative ergreifen und zielgerichtete Zusammenarbeit.Gemeinsam teilen und feiern wir die Erfolge unserer Mitarbeiter*innen. Gemeinsam sind wir die Deutsche Bank Gruppe.Wir begrüßen Bewerbungen von allen Menschen und fördern ein positives, faires und integratives Arbeitsumfeld.",
    "requirements": [
      "agile project management and collaboration in agile teamsStrong analytical"
    ],
    "location": {
      "city": "Frankfurt",
      "state": "Hessen",
      "country": "Deutschland",
      "remote_options": false
    },
    "employment_details": {
      "type": "Unbefristet",
      "schedule": "Vollzeit",
      "career_level": "Assistant Vice President",
      "salary_range": null,
      "benefits": []
    },
    "organization": {
      "name": "Deutsche Bank",
      "division": "Frankfurt",
      "division_id": 10052
    },
    "posting_details": {
      "publication_date": "2025-06-11",
      "position_uri": "/index.php?ac=jobad&id=64255",
      "hiring_year": "2025"
    }
  },
  "evaluation_results": {
    "cv_to_role_match": null,
    "match_confidence": null,
    "evaluation_date": null,
    "evaluator": null,
    "domain_knowledge_assessment": null,
    "decision": {
      "apply": null,
      "rationale": null,
      "estimated_prep_time": null
    },
    "strengths": [],
    "weaknesses": []
  },
  "processing_log": [
    {
      "timestamp": "2025-07-10T11:53:32.974798",
      "action": "job_fetched",
      "processor": "enhanced_job_fetcher_v6.1",
      "status": "success",
      "details": "Successfully fetched job 64255 from Deutsche Bank API"
    },
    {
      "timestamp": "2025-07-10T11:53:32.974798",
      "action": "description_enriched",
      "processor": "web_scraper",
      "status": "success",
      "details": "Successfully fetched job description (8431 characters)"
    }
  ],
  "raw_source_data": {
    "api_response": {
      "MatchedObjectId": "64255",
      "MatchedObjectDescriptor": {
        "PositionOfferingType": [
          {
            "Name": "Unbefristet"
          }
        ],
        "PositionSchedule": [
          {
            "Name": "Vollzeit"
          }
        ],
        "PublicationChannel": [
          {
            "StartDate": "2025-06-11"
          }
        ],
        "PositionTitle": "Senior Flow Designer (Microsoft Power Platform) &amp; RPA Developer (f/m/x)",
        "PositionLocation": [
          {
            "CityName": "Frankfurt",
            "CountrySubDivisionName": "Hessen",
            "CountryName": "Deutschland"
          }
        ],
        "PositionURI": "/index.php?ac=jobad&id=64255",
        "PositionID": "64255",
        "OrganizationName": "Frankfurt",
        "PositionHiringYear": "2025",
        "UserArea": {
          "ProDivision": 10052
        },
        "CareerLevel": [
          {
            "Name": "Assistant Vice President"
          }
        ],
        "PublicationStartDate": "2025-06-11"
      },
      "RelevanceScore": 0,
      "RelevanceRank": 46
    },
    "specialist_analysis": {},
    "description_source": "web_scraping"
  }
}