{
  "job_metadata": {
    "job_id": "64640",
    "version": "1.0",
    "created_at": "2025-07-07T08:30:31.585370",
    "last_modified": "2025-07-07T08:30:31.585370",
    "source": "deutsche_bank_api",
    "processor": "enhanced_job_fetcher_v6.1",
    "status": "fetched"
  },
  "job_content": {
    "title": "Senior VMware Virtualization Engineer (d/m/w)",
    "description": "Senior VMware Virtualization Engineer (d/m/w) Job ID:R0388344 Full/Part-Time: Full-time Regular/Temporary: Regular Listed: 2025-06-24 Location: Frankfurt Position Overview Über den BereichDeutsche Bank AG - TDI (Technology, Data and Innovation)Technologie spielt eine entscheidende Rolle bei der Transformation der Deutschen Bank. Um sicherzustellen, dass wir Technologie und digitale Lösungen in der gesamten Bank wesentlich umfassender einsetzen werden, wurde Technology, Data and Innovation (TDI) als die Technologieabteilung etabliert, welche eine globale, integrierte IT-, Daten- und Sicherheitsagenda vorantreibt. Die Funktion ist verantwortlich für die Umsetzung der Technologiestrategie der Bank, die sich auf die Stärkung des Engineering-Know-hows, die Einführung eines agilen Bereitstellungsmodells, die Reduzierung des Verwaltungsaufwands, die Entkopplung von Vermögenswerten innerhalb unseres IT-Bestands für eine schnellere und kostengünstigere Bereitstellung sowie die Modernisierung der IT-Infrastruktur der Bank mit langfristigen Investitionen und die Nutzung von Cloud Computing konzentriert.Ihre AufgabenIhre Rolle im Team „Hybrid Cloud – IaaS“ umfasst das selbständige Entwickeln von Virtualisierungslösungen im Umfeld unserer globalen internen Private Cloud basierend auf VCF (5.2). Ihr Fokus richtet sich dabei auf das Bereitstellen einer Infrastrukturplattform für das Hosten von virtuellen Servern - mit einem hohen Automatisierungsgrad - und folgen damit dem Ansatz „Infrastructure as a Service – IaaS“.Im Rahmen eines globalen IT-Transformationsprojektes tragen Sie maßgeblich zur Einhaltung und Umsetzung der unterschiedlichsten Vorgaben bei.Sie setzen abstrakte Anforderungen unserer Business-Bereiche und Risiko, bzw. Sicherheitsabteilungen an die virtuelle Infrastruktur (Server Virtualisierung) in konkrete, konsumierbare, sichere und skalierbare virtuelle Lösungen um. Dabei entwickeln Sie komplett neue Architekturen und Automatisierungsprozesse im Umfeld von VCF und den angeschlossenen internen Systemen, oder erweitern schon bestehende Lösungen.Für die Lösungen, welche Sie entwickeln, analysieren Sie dabei die vorhandenen Integrationen in unsere IT-Management Systeme für Configuration-, Change, Incident und Security Management und sind dabei in der Lage, die komplexen Prozesse und Abhängigkeiten im globalen Infrastrukturmanagment für stabile und sichere Prozesse zu berücksichtigen.Neben VCF nutzen Sie z.B. Aria Automation und/oder Orchestrator, um die Zielumgebungen der virtuellen Infrastruktur nach Vorgabe zu konfigurieren, bzw. formulieren Anforderungen an die entsprechenden Entwicklerteams.Als Mitglied eines globalen Teams von etwa 10 Entwickler*innen und Architekt*innen tragen Sie mit Ihrer Arbeit substanziell zum Erfolg der Cloud Strategie der Deutsche Bank AG bei. Mit Ihrer mehrjährigen Erfahrung gehören Sie zum Kernteam und Ihre Designvorschläge entwickeln die VCF Plattform strategisch weiter.Ihre Fähigkeiten und ErfahrungenAbgeschlossenes Studium im Bereich Informatik oder vergleichbare Ausbildung bzw. BerufserfahrungMehrjährige Berufserfahrung im Bereich Rechenzentrums-, bzw. Infrastruktur Virtualisierung (VMware - virtuelle Server) in globalen UnternehmenMehrjährige, nachgewiesene Erfahrung im Bereich Lösungsentwicklung mit den eingesetzten Technologien vSphere, ESXi, und VCFErfahrung mit den gängigen Server-Betriebssystemen (UNIX &Windows)Zertifizierung im Bereich vSphere und VCF (VMware) und Datacenter AutomationZertifizierung im Bereich Aria Automation/Orchestrator wünschenswertErfahrung im Bereich JIRA und GitHub als Arbeitsmittel wünschenswertGute Kommunikationsfähigkeiten sowie TeamfähigkeitErforderliche Sprachkenntnisse: Englisch verhandlungssicherWas wir Ihnen bietenWir bieten eine breite Palette von Leistungen, die all Ihre beruflichen und persönlichen Bedürfnisse abdecken.Emotional ausgeglichenEine positive Haltung hilft uns, die Herausforderungen des Alltags zu meistern – beruflich wie privat. Profitieren Sie von Angeboten wie Beratung in schwierigen Lebenssituationen und Angeboten zur Förderung mentaler Gesundheit.Körperlich fitMit Angeboten zur Aufrechterhaltung Ihrer persönlichen Gesundheit und einem förderlichen beruflichen Umfeld hilft Ihnen die Bank, körperlich fit zu bleiben. Profitieren Sie von Angeboten wie umfangreichen Check-up Untersuchungen, Impfangeboten und Beratung zur gesunden Lebensführung.Sozial vernetztDer Austausch mit anderen eröffnet uns neue Perspektiven, bringt uns beruflich wie persönlich voran und stärkt unser Selbstvertrauen und Wohlbefinden. Profitieren Sie von Angeboten wie Unterstützung durch den pme Familienservice, das FitnessCenter Job, flexible Arbeitszeitmodelle (bspw. Teilzeit, Jobtandem, hybrides Arbeiten) sowie einer umfangreichen Kultur der Vielfalt, Chancengleichheit und Teilhabe.Finanziell abgesichertDie Bank sichert Sie nicht nur während Ihrer aktiven Karriere, sondern auch für die Zukunft finanziell ab und unterstützt Ihre Flexibilität sowie Mobilität – egal ob privat oder beruflich. Profitieren Sie von Angeboten wie Beitragsplänen für Altersvorsorge, Bankdienstleistungen für Mitarbeiter*innen, Firmenfahrrad oder dem Deutschlandticket.Da die Benefits je nach Standort geringfügig variieren, gehen Sie bitte bei konkreten Fragen auf Ihre Recruiterin zu.Die Stelle wird in Voll- und in Teilzeit angeboten.Bei Fragen zum Rekrutierungsprozess steht Ihnen Michaela Peschke gerne zur Verfügung.Kontakt Michaela Peschke: 069-910-43951 Wir streben eine Unternehmenskultur an, in der wir gemeinsam jeden Tag das Beste geben. Dazu gehören verantwortungsvolles Handeln, wirtschaftliches Denken, Initiative ergreifen und zielgerichtete Zusammenarbeit.Gemeinsam teilen und feiern wir die Erfolge unserer Mitarbeiter*innen. Gemeinsam sind wir die Deutsche Bank Gruppe.Wir begrüßen Bewerbungen von allen Menschen und fördern ein positives, faires und integratives Arbeitsumfeld.",
    "requirements": [],
    "location": {
      "city": "Frankfurt",
      "state": "Hessen",
      "country": "Deutschland",
      "remote_options": false
    },
    "employment_details": {
      "type": "Unbefristet",
      "schedule": "Vollzeit",
      "career_level": "Vice President",
      "salary_range": null,
      "benefits": []
    },
    "organization": {
      "name": "Deutsche Bank",
      "division": "Frankfurt",
      "division_id": 10052
    },
    "posting_details": {
      "publication_date": "2025-06-24",
      "position_uri": "/index.php?ac=jobad&id=64640",
      "hiring_year": "2025"
    }
  },
  "evaluation_results": {
    "cv_to_role_match": null,
    "match_confidence": null,
    "evaluation_date": null,
    "evaluator": null,
    "domain_knowledge_assessment": null,
    "decision": {
      "apply": null,
      "rationale": null,
      "estimated_prep_time": null
    },
    "strengths": [],
    "weaknesses": []
  },
  "processing_log": [
    {
      "timestamp": "2025-07-07T08:30:31.585370",
      "action": "job_fetched",
      "processor": "enhanced_job_fetcher_v6.1",
      "status": "success",
      "details": "Successfully fetched job 64640 from Deutsche Bank API"
    },
    {
      "timestamp": "2025-07-07T08:30:31.585370",
      "action": "description_enriched",
      "processor": "web_scraper",
      "status": "success",
      "details": "Successfully fetched job description (5923 characters)"
    }
  ],
  "raw_source_data": {
    "api_response": {
      "MatchedObjectId": "64640",
      "MatchedObjectDescriptor": {
        "PositionOfferingType": [
          {
            "Name": "Unbefristet"
          }
        ],
        "PositionSchedule": [
          {
            "Name": "Vollzeit"
          }
        ],
        "PublicationChannel": [
          {
            "StartDate": "2025-06-24"
          }
        ],
        "PositionTitle": "Senior VMware Virtualization Engineer (d/m/w)",
        "PositionLocation": [
          {
            "CityName": "Frankfurt",
            "CountrySubDivisionName": "Hessen",
            "CountryName": "Deutschland"
          }
        ],
        "PositionURI": "/index.php?ac=jobad&id=64640",
        "PositionID": "64640",
        "OrganizationName": "Frankfurt",
        "PositionHiringYear": "2025",
        "UserArea": {
          "ProDivision": 10052
        },
        "CareerLevel": [
          {
            "Name": "Vice President"
          }
        ],
        "PublicationStartDate": "2025-06-24"
      },
      "RelevanceScore": 0,
      "RelevanceRank": 23
    },
    "specialist_analysis": {},
    "description_source": "web_scraping"
  }
}