{
  "job_metadata": {
    "job_id": "64972",
    "version": "1.0",
    "created_at": "2025-07-10T11:36:20.698948",
    "last_modified": "2025-07-10T11:36:20.698948",
    "source": "deutsche_bank_api",
    "processor": "enhanced_job_fetcher_v6.1",
    "status": "fetched"
  },
  "job_content": {
    "title": "Regulatory Control Senior Advisor (f/m/x)",
    "description": "Regulatory Control Senior Advisor (f/m/x) Job ID:R0384818 Full/Part-Time: Full-time Regular/Temporary: Regular Listed: 2025-07-08 Location: Frankfurt Position Overview Über den BereichUmfassende Daten von hoher Qualität sind Voraussetzung für ein effektives AML Transaction Monitoring (TM). Um sicherzustellen, dass die relevanten Datenrisiken, denen der TM-Prozess ausgesetzt ist, angemessen identifiziert, bewertet, verwaltet und gemeldet werden, ist ein Global Transaction Monitoring Data Steward-Team ein integraler Bestandteil der AFC TM-Organisation.Das Team ist verantwortlich für die Definition und Implementierung der Datenstrategie, das Verständnis der Datenanforderungen und das Management der Datenerfassung, Datenherkunft und Datenqualität in Bezug auf die globale TM-Implementierung der DB.Ihre AufgabenSie verstehen die AFC TM-Datenanforderungen und arbeiten bankenweit mit den Prozess Stakeholdern zusammen, um sicherzustellen, dass die Daten aus den entsprechenden maßgeblichen Datenquellen in der geforderten Qualität zur Verfügung gestellt werden. Hierzu nutzen Sie das Data Governance Framework, die Daten-Prozesse und Tools (DQ Direct, Collibra, Waltz, Solidatus) um sicherzustellen das die Richtlinien und regulatorischen Anforderungen eingehalten werden.Sie treiben die Ursachenanalyse für identifizierter Datenqualitätsprobleme auf einer \"one time fix all\"-Basis voran. Hierbei arbeiten Sie mit Datenproduzenten und der IT zusammen, um die erforderliche Datenqualität zu erreichen.Sie arbeiten mit den Prozessverantwortlichen zusammen, um die Wirksamkeit der Datenkontrollen anhand der wichtigsten Datenqualitätsdimensionen (Genauigkeit, Vollständigkeit, Aktualität) zu bewerten.Sie erstellen KPIs, die mit zentralen Metriken und Methoden übereinstimmen.Sie arbeiten mit relevanten Stakeholdern im gesamten Unternehmen zusammen, darunter regionale und globale Arbeitsgruppen und Foren, AFC, das Divisional Data Office (DDO), Technologieteams und Datenproduzenten (Geschäftseinheiten und ihre Plattform-Owner).Ihre Fähigkeiten und ErfahrungenHochschulabschluss oder eine vergleichbare Qualifikation mit Erfahrung in „Anti-Financial Crime - Transaktion Monitoring mit einem starken quantitativen HintergrundSehr gute organisatorische und datenanalytische Fähigkeiten mit Liebe zum Detail und der Fähigkeit, komplexe Sachverhalte schnell zu analysieren und zu berichten.Verständnis von Transaction Monitoring/Data Governance und mehrjährige Erfahrung in der Datenanalyse u.a. „Root-Cause-Analysis“Sehr gute Kenntnisse in Microsoft Office Programmen: (Excel, Word, PowerPoint, Access), Sharepoint und SQLSehr gute Kommunikationsfähigkeiten in Englisch sowohl schriftlich als auch mündlich, und die Fähigkeit eigenverantwortlich zu arbeiten und Beziehungen zu Stakeholdern aus verschiedenen Bereichen und Hintergründen (Business, IT, Audit, AFC & Compliance) aufzubauen.Erfahrung im Data Governance und Data Quality ManagementWas wir Ihnen bietenWir bieten eine breite Palette von Leistungen, die all Ihre beruflichen und persönlichen Bedürfnisse abdecken.Emotional ausgeglichenEine positive Haltung hilft uns, die Herausforderungen des Alltags zu meistern – beruflich wie privat. Profitieren Sie von Angeboten wie Beratung in schwierigen Lebenssituationen und Angeboten zur Förderung mentaler Gesundheit.Körperlich fitMit Angeboten zur Aufrechterhaltung Ihrer persönlichen Gesundheit und einem förderlichen beruflichen Umfeld hilft Ihnen die Bank, körperlich fit zu bleiben. Profitieren Sie von Angeboten wie umfangreichen Check-up Untersuchungen, Impfangeboten und Beratung zur gesunden Lebensführung.Sozial vernetztDer Austausch mit anderen eröffnet uns neue Perspektiven, bringt uns beruflich wie persönlich voran und stärkt unser Selbstvertrauen und Wohlbefinden. Profitieren Sie von Angeboten wie Unterstützung durch den pme Familienservice, das FitnessCenter Job, flexible Arbeitszeitmodelle (bspw. Teilzeit, Jobtandem, hybrides Arbeiten) sowie einer umfangreichen Kultur der Vielfalt, Chancengleichheit und Teilhabe.Finanziell abgesichertDie Bank sichert Sie nicht nur während Ihrer aktiven Karriere, sondern auch für die Zukunft finanziell ab und unterstützt Ihre Flexibilität sowie Mobilität – egal ob privat oder beruflich. Profitieren Sie von Angeboten wie Beitragsplänen für Altersvorsorge, Bankdienstleistungen für Mitarbeiter*innen, Firmenfahrrad oder dem Deutschlandticket.Da die Benefits je nach Standort geringfügig variieren, gehen Sie bitte bei konkreten Fragen auf Ihren Recruiter / Ihre Recruiterin zu.Die Stelle wird in Voll- und in Teilzeit angeboten.Bei Fragen zum Rekrutierungsprozess steht Ihnen Pierre Kujat gerne zur Verfügung.Kontakt Pierre Kujat: +49 1605138367______________________________________________________________________________Details of the role and how it fits into the teamTransaction Monitoring Global Data Steward Office is responsible for Data Governance, Data Quality Management (DQM) & Data Programme delivery covering key functions within Transaction Monitoring and Screening. Working as part of the DQM team the Regulatory Control Senior Advisor will be responsible for supporting the Data Quality Management Framework and for contributing towards the central Data Analytics capability. Data Quality Management Framework covers Data Quality Standards, Data lineage & Controls, Exception & DQ monitoring & MI reporting plus Data Profiling and Analysis to ensure Data is fit for purpose. A particular focus of the DQ assessment and analysis will be to support the TM Data Steward Office in addressing regulatory commitments. This will require coordinating with Process/Control owners, the CAO Data Office and business SMEs as well as Programme Change teams & Technology colleagues. The Senior DQ Analyst will play a key role in developing the suite of DQM capabilities which support the provision of quality data to the Global Transaction Monitoring processes.Your key responsibilitiesData Quality Assessment & DQ Issue Analysis: As part of the Global Transaction Monitoring Data Steward Function, manage the DQ assessment against requirements for Transaction Monitoring (TM) Modelling teams globally, including analysis.Data Quality Management Framework: Support the delivery of new / updated Data Quality rules & product refinements by working with IT, TM & CAO colleagues to build business data quality rules and dashboards and manage to resolution regulatory and audit findingsData Quality Standards & Controls: Engaging with TM colleagues, Data Stewards & Process Owners to establish data quality requirements linked to business outcomes and drive front to back view of data quality via use of data lineage (Waltz, Solidatus) and meta-data tools (Collibra) as well as implement and adhere to standards, procedures aligned to the data policy and frameworkYour skills and experiencesUniversity degree or appropriate professional experience and experience of working in Financial Services within Anti-Financial area especially Transaction Monitoring (TM).Understand transaction monitoring relevant data and experience in its analysis in close cooperation with data producers/consumers.Experience in route cause analysis (RCA) for Data Quality Issues involving IT as well as business stakeholdersExcellent knowledge of analysis and communication tools i.e. Microsoft Office skills, Jira and proficiency at SQL and relational databases.Proven track record of analyses on data sets and present results in a meaningful way to senior stakeholdersGood written and verbal communication skills in English (must)Ability to work independently and self-driven as well as part of a team and virtual working teamsUnderstanding of Data Governance, Quality Management, Modelling, Analytics etc. Experience working on data projects across a variety of technologies and data formatsWhat we offerWe provide you with a comprehensive portfolio of benefits and offerings to support both, your private and professional needs.Emotionally and mentally balancedA positive mind helps us master the challenges of everyday life – both professionally and privately. We offer consultation in difficult life situations as well as mental health awareness trainings.Physically thrivingWe support you in staying physically fit through an offering to maintain personal health and a professional environment. You can benefit from health check-ups; vaccination drives as well as advice on healthy living and nutrition.Socially connectedNetworking opens up new perspectives, helps us thrive professionally and personally as well as strengthens our self-confidence and well-being. You can benefit from PME family service, FitnessCenter Job, flexible working (e.g parttime, hybrid working, job tandem) as well as an extensive culture of diversity, equity and inclusion.Financially secureWe provide you with financial security not only during your active career but also for the future. You can benefit from offerings such as pension plans, banking services, company bicycle or “Deutschlandticket”.Since our offerings slightly vary across locations, please contact your recruiter with specific questions.This job is available in full and parttime.In case of any recruitment related questions, please get in touch with Pierre Kujat.Contact Pierre Kujat: +49 1605138367 Wir streben eine Unternehmenskultur an, in der wir gemeinsam jeden Tag das Beste geben. Dazu gehören verantwortungsvolles Handeln, wirtschaftliches Denken, Initiative ergreifen und zielgerichtete Zusammenarbeit.Gemeinsam teilen und feiern wir die Erfolge unserer Mitarbeiter*innen. Gemeinsam sind wir die Deutsche Bank Gruppe.Wir begrüßen Bewerbungen von allen Menschen und fördern ein positives, faires und integratives Arbeitsumfeld.",
    "requirements": [
      "its analysis in close cooperation with data producers/consumers.Experience in route cause analysis (RCA) for Data Quality Issues involving IT as well as business stakeholdersExcellent knowledge of analysis and communication tools i.e. Microsoft Office skills"
    ],
    "location": {
      "city": "Frankfurt",
      "state": "Hessen",
      "country": "Deutschland",
      "remote_options": false
    },
    "employment_details": {
      "type": "Unbefristet",
      "schedule": "Vollzeit",
      "career_level": "Assistant Vice President",
      "salary_range": null,
      "benefits": []
    },
    "organization": {
      "name": "Deutsche Bank",
      "division": "Frankfurt",
      "division_id": 10056
    },
    "posting_details": {
      "publication_date": "2025-07-08",
      "position_uri": "/index.php?ac=jobad&id=64972",
      "hiring_year": "2025"
    }
  },
  "evaluation_results": {
    "cv_to_role_match": null,
    "match_confidence": null,
    "evaluation_date": null,
    "evaluator": null,
    "domain_knowledge_assessment": null,
    "decision": {
      "apply": null,
      "rationale": null,
      "estimated_prep_time": null
    },
    "strengths": [],
    "weaknesses": []
  },
  "processing_log": [
    {
      "timestamp": "2025-07-10T11:36:20.698948",
      "action": "job_fetched",
      "processor": "enhanced_job_fetcher_v6.1",
      "status": "success",
      "details": "Successfully fetched job 64972 from Deutsche Bank API"
    },
    {
      "timestamp": "2025-07-10T11:36:20.698948",
      "action": "description_enriched",
      "processor": "web_scraper",
      "status": "success",
      "details": "Successfully fetched job description (9734 characters)"
    }
  ],
  "raw_source_data": {
    "api_response": {
      "MatchedObjectId": "64972",
      "MatchedObjectDescriptor": {
        "PositionOfferingType": [
          {
            "Name": "Unbefristet"
          }
        ],
        "PositionSchedule": [
          {
            "Name": "Vollzeit"
          }
        ],
        "PublicationChannel": [
          {
            "StartDate": "2025-07-08"
          }
        ],
        "PositionTitle": "Regulatory Control Senior Advisor (f/m/x)",
        "PositionLocation": [
          {
            "CityName": "Frankfurt",
            "CountrySubDivisionName": "Hessen",
            "CountryName": "Deutschland"
          }
        ],
        "PositionURI": "/index.php?ac=jobad&id=64972",
        "PositionID": "64972",
        "OrganizationName": "Frankfurt",
        "PositionHiringYear": "2025",
        "UserArea": {
          "ProDivision": 10056
        },
        "CareerLevel": [
          {
            "Name": "Assistant Vice President"
          }
        ],
        "PublicationStartDate": "2025-07-08"
      },
      "RelevanceScore": 0,
      "RelevanceRank": 6
    },
    "specialist_analysis": {},
    "description_source": "web_scraping"
  }
}