{
  "job_metadata": {
    "job_id": "64674",
    "version": "1.0",
    "created_at": "2025-07-07T08:30:30.443473",
    "last_modified": "2025-07-07T08:30:30.443473",
    "source": "deutsche_bank_api",
    "processor": "enhanced_job_fetcher_v6.1",
    "status": "fetched"
  },
  "job_content": {
    "title": "Fleet Operations Manager in Global Procurement (f/m/x)",
    "description": "Fleet Operations Manager in Global Procurement (f/m/x) Job ID:R0393530 Full/Part-Time: Full-time Regular/Temporary: Regular Listed: 2025-06-24 Location: Frankfurt Position Overview Über den BereichUnser Fleet-Team ist Teil der zentralen Unternehmensinfrastruktur und verantwortet das operative Firmenwagenprogramm in Deutschland. Wir sorgen dafür, dass Mobilität für unsere Mitarbeitenden effizient, reibungslos und nachhaltig funktioniert – in enger Zusammenarbeit mit internen Stakeholdern und externen Dienstleistern.Ihre AufgabenSie übernehmen die Verantwortung für alle operativen Aufgaben rund um das Firmenwagenprogramm und stellen die Einhaltung der Firmenwagenrichtlinie sicher.Sie unterstützen die Einkaufsleitung Fuhrpark bei der Entwicklung und Umsetzung einer zukunftsorientierten Flottenstrategie.Sie begleiten Vertragsverhandlungen mit Lieferanten und betreuen strategische Partnerschaften mit Dienstleistern, Herstellern und Leasinggesellschaften.Sie sind erste*r Ansprechpartner*in für Lieferanten sowie für Mitarbeitende bei Eskalationen oder rechtlichen Fragen.Sie analysieren Markttrends und neue Mobilitätsangebote mit Blick auf Einsparpotenziale und Nachhaltigkeit.Sie sind Teil eines engagierten Teams, das kontinuierlich Prozesse optimiert und die Zufriedenheit der Mitarbeitenden im Blick behält.Ihre Fähigkeiten und ErfahrungenAbgeschlossene kaufmännische oder technische Ausbildung bzw. Studium, idealerweise in der Automobilbranchemehrjährige Berufserfahrung im Fuhrparkmanagement, vorzugsweise im KonzernumfeldFundierte Kenntnisse gesetzlicher Anforderungen und betrieblicher Risiken im FlottenbetriebVerständnis für Fahrzeugsysteme, Flottenprozesse und KostenstrukturenSicherer Umgang mit MS Office, sehr gute Deutsch- und EnglischkenntnisseStrukturierte, prozessorientierte Arbeitsweise, Teamfähigkeit und KommunikationsstärkeWas wir Ihnen bietenWir bieten eine breite Palette von Leistungen, die all Ihre beruflichen und persönlichen Bedürfnisse abdecken.Emotional ausgeglichenEine positive Haltung hilft uns, die Herausforderungen des Alltags zu meistern – beruflich wie privat. Profitieren Sie von Angeboten wie Beratung in schwierigen Lebenssituationen und Angeboten zur Förderung mentaler Gesundheit.Körperlich fitMit Angeboten zur Aufrechterhaltung Ihrer persönlichen Gesundheit und einem förderlichen beruflichen Umfeld hilft Ihnen die Bank, körperlich fit zu bleiben. Profitieren Sie von Angeboten wie umfangreichen Check-up Untersuchungen, Impfangeboten und Beratung zur gesunden Lebensführung.Sozial vernetztDer Austausch mit anderen eröffnet uns neue Perspektiven, bringt uns beruflich wie persönlich voran und stärkt unser Selbstvertrauen und Wohlbefinden. Profitieren Sie von Angeboten wie Unterstützung durch den pme Familienservice, das FitnessCenter Job, flexible Arbeitszeitmodelle (bspw. Teilzeit, Jobtandem, hybrides Arbeiten) sowie einer umfangreichen Kultur der Vielfalt, Chancengleichheit und Teilhabe.Finanziell abgesichertDie Bank sichert Sie nicht nur während Ihrer aktiven Karriere, sondern auch für die Zukunft finanziell ab und unterstützt Ihre Flexibilität sowie Mobilität – egal ob privat oder beruflich. Profitieren Sie von Angeboten wie Beitragsplänen für Altersvorsorge, Bankdienstleistungen für Mitarbeiter*innen, Firmenfahrrad oder dem Deutschlandticket.Da die Benefits je nach Standort geringfügig variieren, gehen Sie bitte bei konkreten Fragen auf Ihren Recruiter / Ihre Recruiterin zu.Die Stelle wird in Voll- und in Teilzeit angeboten.Bei Fragen zum Rekrutierungsprozess steht Ihnen Christin Bode gerne zur Verfügung.Kontakt Christin Bode: +49 30-3407 4860______________________________________________________________________________About the DepartmentOur Fleet team is part of the Infrastructure function and is responsible for the operational company car program in Germany. We ensure that employee mobility runs smoothly, efficiently, and sustainably – in close collaboration with internal stakeholders and external service providers.Your ResponsibilitiesYou manage all operational tasks related to the company car program and ensure compliance with the company car policy.You support the fleet purchasing lead in developing and implementing a future-oriented fleet strategy.You assist in negotiating supplier contracts and maintaining strategic partnerships with service providers, manufacturers, and leasing companies.You act as the main contact for suppliers and employees, especially in case of escalations or legal questions.You analyze market trends and new mobility services to identify savings and promote sustainability.You are part of a dedicated team that continuously improves processes and focuses on employee satisfaction.Your Skills and ExperienceCompleted commercial or technical training or studies, preferably in the automotive industryseveral years of experience in fleet management, ideally in a corporate environmentIn-depth knowledge of legal requirements and operational risks in fleet operationsUnderstanding of vehicle systems, fleet processes, and cost structuresConfident use of MS Office, fluent in German and EnglishStructured, process-oriented approach, team spirit, and strong communication skillsWhat we offerWe provide you with a comprehensive portfolio of benefits and offerings to support both, your private and professional needs.Emotionally and mentally balancedA positive mind helps us master the challenges of everyday life – both professionally and privately. We offer consultation in difficult life situations as well as mental health awareness trainings.Physically thrivingWe support you in staying physically fit through an offering to maintain personal health and a professional environment. You can benefit from health check-ups; vaccination drives as well as advice on healthy living and nutrition.Socially connectedNetworking opens up new perspectives, helps us thrive professionally and personally as well as strengthens our self-confidence and well-being. You can benefit from PME family service, FitnessCenter Job, flexible working (e.g parttime, hybrid working, job tandem) as well as an extensive culture of diversity, equity and inclusion.Financially secureWe provide you with financial security not only during your active career but also for the future. You can benefit from offerings such as pension plans, banking services, company bicycle or “Deutschlandticket”.Since our offerings slightly vary across locations, please contact your recruiter with specific questions.This job is available in full and parttime.In case of any recruitment related questions, please get in touch with Christin Bode.Contact Christin Bode: +49 30-3407 4860 Wir streben eine Unternehmenskultur an, in der wir gemeinsam jeden Tag das Beste geben. Dazu gehören verantwortungsvolles Handeln, wirtschaftliches Denken, Initiative ergreifen und zielgerichtete Zusammenarbeit.Gemeinsam teilen und feiern wir die Erfolge unserer Mitarbeiter*innen. Gemeinsam sind wir die Deutsche Bank Gruppe.Wir begrüßen Bewerbungen von allen Menschen und fördern ein positives, faires und integratives Arbeitsumfeld.",
    "requirements": [
      "legal requirements and operational risks in fleet operationsUnderstanding of vehicle systems",
      "fleet management"
    ],
    "location": {
      "city": "Frankfurt",
      "state": "Hessen",
      "country": "Deutschland",
      "remote_options": false
    },
    "employment_details": {
      "type": "Unbefristet",
      "schedule": "Vollzeit",
      "career_level": "Assistant Vice President",
      "salary_range": null,
      "benefits": []
    },
    "organization": {
      "name": "Deutsche Bank",
      "division": "Frankfurt",
      "division_id": 10058
    },
    "posting_details": {
      "publication_date": "2025-06-24",
      "position_uri": "/index.php?ac=jobad&id=64674",
      "hiring_year": "2025"
    }
  },
  "evaluation_results": {
    "cv_to_role_match": null,
    "match_confidence": null,
    "evaluation_date": null,
    "evaluator": null,
    "domain_knowledge_assessment": null,
    "decision": {
      "apply": null,
      "rationale": null,
      "estimated_prep_time": null
    },
    "strengths": [],
    "weaknesses": []
  },
  "processing_log": [
    {
      "timestamp": "2025-07-07T08:30:30.443473",
      "action": "job_fetched",
      "processor": "enhanced_job_fetcher_v6.1",
      "status": "success",
      "details": "Successfully fetched job 64674 from Deutsche Bank API"
    },
    {
      "timestamp": "2025-07-07T08:30:30.443473",
      "action": "description_enriched",
      "processor": "web_scraper",
      "status": "success",
      "details": "Successfully fetched job description (7105 characters)"
    }
  ],
  "raw_source_data": {
    "api_response": {
      "MatchedObjectId": "64674",
      "MatchedObjectDescriptor": {
        "PositionOfferingType": [
          {
            "Name": "Unbefristet"
          }
        ],
        "PositionSchedule": [
          {
            "Name": "Vollzeit"
          }
        ],
        "PublicationChannel": [
          {
            "StartDate": "2025-06-24"
          }
        ],
        "PositionTitle": "Fleet Operations Manager in Global Procurement (f/m/x)",
        "PositionLocation": [
          {
            "CityName": "Frankfurt",
            "CountrySubDivisionName": "Hessen",
            "CountryName": "Deutschland"
          }
        ],
        "PositionURI": "/index.php?ac=jobad&id=64674",
        "PositionID": "64674",
        "OrganizationName": "Frankfurt",
        "PositionHiringYear": "2025",
        "UserArea": {
          "ProDivision": 10058
        },
        "CareerLevel": [
          {
            "Name": "Assistant Vice President"
          }
        ],
        "PublicationStartDate": "2025-06-24"
      },
      "RelevanceScore": 0,
      "RelevanceRank": 21
    },
    "specialist_analysis": {},
    "description_source": "web_scraping"
  }
}