{
  "job_metadata": {
    "job_id": "64659",
    "version": "1.0",
    "created_at": "2025-07-06T18:41:02.879036",
    "last_modified": "2025-07-06T18:41:02.879036",
    "source": "deutsche_bank_api",
    "processor": "enhanced_job_fetcher_v6.1",
    "status": "fetched"
  },
  "job_content": {
    "title": "Credit Risk Modelling – Risk Methodology Specialist in Group Strategic Analytics (f/m/x)",
    "description": "Credit Risk Modelling – Risk Methodology Specialist in Group Strategic Analytics (f/m/x) Job ID:R0394362 Full/Part-Time: Full-time Regular/Temporary: Regular Listed: 2025-07-02 Location: Frankfurt Position Overview *English version below*‚Group Strategic Analytics‘ liefert zukunftsorientierte analytische Lösungen für die Deutsche Bank. Sie werden Teil von dem Kreditrisiko-Modell-Team in ‚Group Strategic Analytics‘, welches für die internen PD, LGD und CCF-Modelle der Bank verantwortlich ist. In dieser Rolle stehen Sie im engen Austausch mit den Geschäftsbereichen, dem Risiko- und dem Finanzbereich, um branchenführende Modelle zu entwickeln, welche das Risikoprofil der Bank angemessen abbilden, und dabei die regulatorischen Anforderungen erfüllen.Ihre Aufgaben:Entwicklung, Implementierung und Pflege von branchenführenden internen Modellen (PD, LGD, CCF) für Kreditportfolien der Deutschen Bank unter Einhaltung regulatorischer Anforderungen an die Modellierung von Kreditrisikoparametern (wie Eigenkapitalverordnung der Europäischen Union (EU), Leitlinien der Europäischen Bankenaufsichtsbehörde zur Schätzung der Ausfallwahrscheinlichkeit (PD) und der Verlustquote bei Ausfall (LGD).Lösung regulatorischer und interner Findings durch Methodiken der Kreditrisikoparameter oder verwandter Modelle.Enge Zusammenarbeit mit anderen Fachbereichen der Bank: Geschäftsbereiche, Kreditrisikobereiche, Kapital-Management, Finanzen.Vorstellung der Modelle bei Regulatoren.Ihr Profil:Hochschulabschluss in Finanzmathematik, Statistik, Mathematik, Physik, oder einem vergleichbaren Fach. Sehr gute akademische Leistungen.Mehrjährige Erfahrung in der Modellierung von Kreditrisiken (PD, LGD, CCF), gute Kreditrisikokenntnisse, gutes Verständnis der relevanten Regulierungen, z.B. die EU-Richtlinie zu Kapitaladäquanzanforderungen (CRR). Praxisorientierte Herangehensweise.Exzellente analytische Fähigkeiten, gute statistische Kenntnisse, komfortabler Umgang mit sehr großen und komplexen DatenmengenPraktische Erfahrung mit statistischen Standardprogrammen, Programmierkenntnisse in SAS und PythonSehr gute Kommunikation in Englisch, idealerweise auch in DeutschWas wir Ihnen bietenWir bieten eine breite Palette von Leistungen, die all Ihre beruflichen und persönlichen Bedürfnisse abdecken.Emotional ausgeglichenEine positive Haltung hilft uns, die Herausforderungen des Alltags zu meistern – beruflich wie privat. Profitieren Sie von Angeboten wie Beratung in schwierigen Lebenssituationen und Angeboten zur Förderung mentaler Gesundheit.Körperlich fitMit Angeboten zur Aufrechterhaltung Ihrer persönlichen Gesundheit und einem förderlichen beruflichen Umfeld hilft Ihnen die Bank, körperlich fit zu bleiben. Profitieren Sie von Angeboten wie umfangreichen Check-up Untersuchungen, Impfangeboten und Beratung zur gesunden Lebensführung.Sozial vernetztDer Austausch mit anderen eröffnet uns neue Perspektiven, bringt uns beruflich wie persönlich voran und stärkt unser Selbstvertrauen und Wohlbefinden. Profitieren Sie von Angeboten wie Unterstützung durch den pme Familienservice, das FitnessCenter Job, flexible Arbeitszeitmodelle (bspw. Teilzeit, Jobtandem, hybrides Arbeiten) sowie einer umfangreichen Kultur der Vielfalt, Chancengleichheit und Teilhabe.Finanziell abgesichertDie Bank sichert Sie nicht nur während Ihrer aktiven Karriere, sondern auch für die Zukunft finanziell ab und unterstützt Ihre Flexibilität sowie Mobilität – egal ob privat oder beruflich. Profitieren Sie von Angeboten wie Beitragsplänen für Altersvorsorge, Bankdienstleistungen für Mitarbeiter*innen, Firmenfahrrad oder dem Deutschlandticket.Da die Benefits je nach Standort geringfügig variieren, gehen Sie bitte bei konkreten Fragen auf Ihren Recruiter / Ihre Recruiterin zu.Die Stelle wird in Voll- und in Teilzeit angeboten.Bei Fragen zum Rekrutierungsprozess steht Ihnen Christin Bode gerne zur Verfügung.Kontakt Christin Bode: +49 (30) 3407 4860**********************************************************************************Group Strategic Analytics is part of Group Chief Operation Office (COO) which acts as the bridge between the Bank’s businesses and infrastructure functions to help deliver the efficiency, control, and transformation goals of the Bank.You will join Credit Risk Modelling Strats, for our Internal Ratings-Based Credit Risk Methodology team and will be responsible for the development and maintenance of the PD/LGD/CCF models for the Group’s credit portfolios.In this role, you will engage extensively with a variety of stakeholders (including Business Lending, Risk, Finance) to build industry leading models which accurately reflect Deutsche Bank’s risk profile and are compliant with various regulatory requirements.Your key responsibilities Responsibility for the development, implementation, and maintenance of methodologies for the credit risk parameters for Deutsche Bank compliant with regulatory requirements to modelling of credit risk parameters (such as European Union (EU) Capital Requirements Regulations, European Banking Authority’s Guidelines on Probability of Default (PD) and Loss Given Default (LGD) estimation).Resolution of regulatory and internal findings related to the methodology of credit risk parameters or related models.Interaction with senior management and various internal stakeholders from Business, Credit Risk Management, Finance, Capital management.Presentation of the models to regulators.Your skills and experience:Educated to Masters and/or Doctor of Philosophy (PhD) level or equivalent qualification/work experience in a quantitative discipline such as Mathematical Finance/Statistics/Econometrics, with focus on application of theoretical knowledge into practiceGood knowledge of credit risk and relevant regulations related to the modelling of the credit risk parameters (PD, LGD, CCF) as well as multi-year experience in internal modellingStrong analytical skills, proven ability to handle and optimize processing of large datasets, proficiency with advanced statistical techniques as well as hands-on experience with analytical packages (at least Statistical Analysis System (SAS) and Python)Proven experience in delivering complex model development projects requiring cross-functional stakeholder syndication and in executing regulatory audits and other external reviews of internal modelsEffective communication skills, the ability to share clear messages and explain complex ideas in an understandable way, good written and verbal skills in German are preferableWhat we offerWe provide you with a comprehensive portfolio of benefits and offerings to support both, your private and professional needs.Emotionally and mentally balancedA positive mind helps us master the challenges of everyday life – both professionally and privately. We offer consultation in difficult life situations as well as mental health awareness trainings.Physically thrivingWe support you in staying physically fit through an offering to maintain personal health and a professional environment. You can benefit from health check-ups; vaccination drives as well as advice on healthy living and nutrition.Socially connectedNetworking opens up new perspectives, helps us thrive professionally and personally as well as strengthens our self-confidence and well-being. You can benefit from PME family service, FitnessCenter Job, flexible working (e.g parttime, hybrid working, job tandem) as well as an extensive culture of diversity, equity and inclusion.Financially secureWe provide you with financial security not only during your active career but also for the future. You can benefit from offerings such as pension plans, banking services, company bicycle or “Deutschlandticket”.Since our offerings slightly vary across locations, please contact your recruiter with specific questions.This job is available in full and parttime.In case of any recruitment related questions, please get in touch with Christin Bode.Contact Christin Bode: +49 (30) 3407 4860 Wir streben eine Unternehmenskultur an, in der wir gemeinsam jeden Tag das Beste geben. Dazu gehören verantwortungsvolles Handeln, wirtschaftliches Denken, Initiative ergreifen und zielgerichtete Zusammenarbeit.Gemeinsam teilen und feiern wir die Erfolge unserer Mitarbeiter*innen. Gemeinsam sind wir die Deutsche Bank Gruppe.Wir begrüßen Bewerbungen von allen Menschen und fördern ein positives, faires und integratives Arbeitsumfeld.",
    "requirements": [
      "credit risk and relevant regulations related to the modelling of the credit risk parameters (PD",
      "internal modellingStrong analytical skills",
      "a quantitative discipline such as Mathematical Finance/Statistics/Econometrics",
      "analytical packages (at least Statistical Analysis System (SAS) and Python)Proven experience in delivering complex model development projects requiring cross-functional stakeholder syndication and in executing regulatory audits and other external reviews of internal modelsEffective communication skills"
    ],
    "location": {
      "city": "Frankfurt",
      "state": "Hessen",
      "country": "Deutschland",
      "remote_options": false
    },
    "employment_details": {
      "type": "Unbefristet",
      "schedule": "Vollzeit",
      "career_level": "Vice President",
      "salary_range": null,
      "benefits": []
    },
    "organization": {
      "name": "Deutsche Bank",
      "division": "Frankfurt",
      "division_id": 10058
    },
    "posting_details": {
      "publication_date": "2025-07-02",
      "position_uri": "/index.php?ac=jobad&id=64659",
      "hiring_year": "2025"
    }
  },
  "evaluation_results": {
    "cv_to_role_match": null,
    "match_confidence": null,
    "evaluation_date": null,
    "evaluator": null,
    "domain_knowledge_assessment": null,
    "decision": {
      "apply": null,
      "rationale": null,
      "estimated_prep_time": null
    },
    "strengths": [],
    "weaknesses": []
  },
  "processing_log": [
    {
      "timestamp": "2025-07-06T18:41:02.879036",
      "action": "job_fetched",
      "processor": "enhanced_job_fetcher_v6.1",
      "status": "success",
      "details": "Successfully fetched job 64659 from Deutsche Bank API"
    },
    {
      "timestamp": "2025-07-06T18:41:02.879036",
      "action": "description_enriched",
      "processor": "web_scraper",
      "status": "success",
      "details": "Successfully fetched job description (8425 characters)"
    }
  ],
  "raw_source_data": {
    "api_response": {
      "MatchedObjectId": "64659",
      "MatchedObjectDescriptor": {
        "PositionOfferingType": [
          {
            "Name": "Unbefristet"
          }
        ],
        "PositionSchedule": [
          {
            "Name": "Vollzeit"
          }
        ],
        "PublicationChannel": [
          {
            "StartDate": "2025-07-02"
          }
        ],
        "PositionTitle": "Credit Risk Modelling – Risk Methodology Specialist in Group Strategic Analytics (f/m/x)",
        "PositionLocation": [
          {
            "CityName": "Frankfurt",
            "CountrySubDivisionName": "Hessen",
            "CountryName": "Deutschland"
          }
        ],
        "PositionURI": "/index.php?ac=jobad&id=64659",
        "PositionID": "64659",
        "OrganizationName": "Frankfurt",
        "PositionHiringYear": "2025",
        "UserArea": {
          "ProDivision": 10058
        },
        "CareerLevel": [
          {
            "Name": "Vice President"
          }
        ],
        "PublicationStartDate": "2025-07-02"
      },
      "RelevanceScore": 0,
      "RelevanceRank": 8
    },
    "specialist_analysis": {},
    "description_source": "web_scraping"
  }
}