{
  "job_metadata": {
    "job_id": "64777",
    "version": "1.0",
    "created_at": "2025-07-06T18:49:55.252052",
    "last_modified": "2025-07-06T18:49:55.252052",
    "source": "deutsche_bank_api",
    "processor": "enhanced_job_fetcher_v6.1",
    "status": "fetched"
  },
  "job_content": {
    "title": "UNIX Services – Senior UNIX Systems Analyst (d/m/w)",
    "description": "UNIX Services – Senior UNIX Systems Analyst (d/m/w) Job ID:R0391486 Full/Part-Time: Full-time Regular/Temporary: Regular Listed: 2025-06-27 Location: Frankfurt Position Overview Über den BereichUNIX Services Global Support sucht einen IT-System Analyst mit Erfahrungen im UNIX (Solaris) und Linux (RedHat und SuSE) Umfeld.Als Senior SME in unserem Operations Support Team (EMEA-Zeitzone) werden deine Fähigkeiten für im Bereich UNIX-Support und UNIX-Operations eingesetzt.Wir suchen einen erfahrenen System Analyst mit guten Kommunikations- und Problemlösungsfähigkeiten. Als Teil eines global agierenden Teams ist deine Teamfähigkeit ebenfalls von großer Bedeutung. Du repräsentierst UNIX-Services in breit aufgestellten Bereichen wie TDI oder CIO.Deine AufgabenAls UNIX-Experte bist du verantwortlich für alle Bereiche im Operations Support Team für unsere UNIX-Server innerhalb eines global agierenden Teams welches nach dem „Follow the Sun“-Modell arbeitet.Du bist verantwortlich für Workarounds / Bugfixes auf den Systemen, die Umsetzung von Changes sowie die Verwaltung der OS-Security Compliance.Bei auftretenden, kritischen Problemen agierst du mit deinem Expertenwissen als Ansprechpartner für unser Incident- und CIO-Management und unterstützt das Team beratend mit deiner Erfahrung im UNIX- und Linux-Umfeld.Betrieb und Support sind deine Hauptverantwortlichkeiten im Team, zusätzlich fungierst du als Schnittstelle zu weiteren funktionalen Teams der Deutschen Bank wie Storage, Datenbanken oder zum UNIX-Engineering.Als Senior UNIX-Experte bist du teil eines Teams bestehend aus internen, sowie externen in drei unterschiedlichen Standorten welches zuständig für den OS-Support im europäischen Raum (EMEA) ist.Als leitender Experte in deinem Fachbereich agierst du als Schnittstelle zu unseren UNIX-Vendoren und zu unseren IT-Dienstleistern. Du bist eingebunden in Service Management für Hardware- und Softwareangelegenheiten.Deine Fähigkeiten und ErfahrungenEin abgeschlossenes Bachelor-Studium oder eine vergleichbare Ausbildung in der Informatik oder einem verwandten Fachgebiet.10+ Jahre Erfahrung mit UNIX-Systemadministration: Upgrades, Patching und Konfigurationsmanagement, Performancemanagement, Kapazitätsplanung, Troubleshooting / Problemanalyse.Ein fundiertes Wissen in UNIX-relevanten Technologien: Netzwerk und Storage.(optional): Kenntnisse im UNIX Operations Bereich im Finanzsektor ist wünschenswertEine ausgeprägte Teamfähigkeit(optional): Erfahrungen in Bash-, Python- oder Perl-ScriptingEin ausgeprägtes lösungsorientiertes – und analytisches Denken(optional): DeutschkenntnisseWas wir Ihnen bietenWir bieten eine breite Palette von Leistungen, die all Ihre beruflichen und persönlichen Bedürfnisse abdecken.Emotional ausgeglichenEine positive Haltung hilft uns, die Herausforderungen des Alltags zu meistern – beruflich wie privat. Profitieren Sie von Angeboten wie Beratung in schwierigen Lebenssituationen und Angeboten zur Förderung mentaler Gesundheit.Körperlich fitMit Angeboten zur Aufrechterhaltung Ihrer persönlichen Gesundheit und einem förderlichen beruflichen Umfeld hilft Ihnen die Bank, körperlich fit zu bleiben. Profitieren Sie von Angeboten wie umfangreichen Check-up Untersuchungen, Impfangeboten und Beratung zur gesunden Lebensführung.Sozial vernetztDer Austausch mit anderen eröffnet uns neue Perspektiven, bringt uns beruflich wie persönlich voran und stärkt unser Selbstvertrauen und Wohlbefinden. Profitieren Sie von Angeboten wie Unterstützung durch den pme Familienservice, das FitnessCenter Job, flexible Arbeitszeitmodelle (bspw. Teilzeit, Jobtandem, hybrides Arbeiten) sowie einer umfangreichen Kultur der Vielfalt, Chancengleichheit und Teilhabe.Finanziell abgesichertDie Bank sichert Sie nicht nur während Ihrer aktiven Karriere, sondern auch für die Zukunft finanziell ab und unterstützt Ihre Flexibilität sowie Mobilität – egal ob privat oder beruflich. Profitieren Sie von Angeboten wie Beitragsplänen für Altersvorsorge, Bankdienstleistungen für Mitarbeiter*innen, Firmenfahrrad oder dem Deutschlandticket.Da die Benefits je nach Standort geringfügig variieren, gehen Sie bitte bei konkreten Fragen auf Ihre Recruiterin zu.Die Stelle wird in Voll- und in Teilzeit angeboten.Bei Fragen zum Rekrutierungsprozess steht Ihnen Michaela Peschke gerne zur Verfügung.Kontakt Michaela Peschke: 069-910-43951 Wir streben eine Unternehmenskultur an, in der wir gemeinsam jeden Tag das Beste geben. Dazu gehören verantwortungsvolles Handeln, wirtschaftliches Denken, Initiative ergreifen und zielgerichtete Zusammenarbeit.Gemeinsam teilen und feiern wir die Erfolge unserer Mitarbeiter*innen. Gemeinsam sind wir die Deutsche Bank Gruppe.Wir begrüßen Bewerbungen von allen Menschen und fördern ein positives, faires und integratives Arbeitsumfeld.",
    "requirements": [],
    "location": {
      "city": "Frankfurt",
      "state": "Hessen",
      "country": "Deutschland",
      "remote_options": false
    },
    "employment_details": {
      "type": "Unbefristet",
      "schedule": "Vollzeit",
      "career_level": "Vice President",
      "salary_range": null,
      "benefits": []
    },
    "organization": {
      "name": "Deutsche Bank",
      "division": "Frankfurt",
      "division_id": 10052
    },
    "posting_details": {
      "publication_date": "2025-06-27",
      "position_uri": "/index.php?ac=jobad&id=64777",
      "hiring_year": "2025"
    }
  },
  "evaluation_results": {
    "cv_to_role_match": null,
    "match_confidence": null,
    "evaluation_date": null,
    "evaluator": null,
    "domain_knowledge_assessment": null,
    "decision": {
      "apply": null,
      "rationale": null,
      "estimated_prep_time": null
    },
    "strengths": [],
    "weaknesses": []
  },
  "processing_log": [
    {
      "timestamp": "2025-07-06T18:49:55.252052",
      "action": "job_fetched",
      "processor": "enhanced_job_fetcher_v6.1",
      "status": "success",
      "details": "Successfully fetched job 64777 from Deutsche Bank API"
    },
    {
      "timestamp": "2025-07-06T18:49:55.252052",
      "action": "description_enriched",
      "processor": "web_scraper",
      "status": "success",
      "details": "Successfully fetched job description (4801 characters)"
    }
  ],
  "raw_source_data": {
    "api_response": {
      "MatchedObjectId": "64777",
      "MatchedObjectDescriptor": {
        "PositionOfferingType": [
          {
            "Name": "Unbefristet"
          }
        ],
        "PositionSchedule": [
          {
            "Name": "Vollzeit"
          }
        ],
        "PublicationChannel": [
          {
            "StartDate": "2025-06-27"
          }
        ],
        "PositionTitle": "UNIX Services – Senior UNIX Systems Analyst (d/m/w)",
        "PositionLocation": [
          {
            "CityName": "Frankfurt",
            "CountrySubDivisionName": "Hessen",
            "CountryName": "Deutschland"
          }
        ],
        "PositionURI": "/index.php?ac=jobad&id=64777",
        "PositionID": "64777",
        "OrganizationName": "Frankfurt",
        "PositionHiringYear": "2025",
        "UserArea": {
          "ProDivision": 10052
        },
        "CareerLevel": [
          {
            "Name": "Vice President"
          }
        ],
        "PublicationStartDate": "2025-06-27"
      },
      "RelevanceScore": 0,
      "RelevanceRank": 15
    },
    "specialist_analysis": {},
    "description_source": "web_scraping"
  }
}