{
  "job_metadata": {
    "job_id": "64407",
    "version": "1.0",
    "created_at": "2025-07-06T18:40:57.414928",
    "last_modified": "2025-07-06T18:40:57.414928",
    "source": "deutsche_bank_api",
    "processor": "enhanced_job_fetcher_v6.1",
    "status": "fetched"
  },
  "job_content": {
    "title": "Tax Advisor (d/m/w)",
    "description": "Tax Advisor (d/m/w) Job ID:R0386305 Full/Part-Time: Full-time Regular/Temporary: Regular Listed: 2025-07-02 Location: Frankfurt Position Overview Über den BereichGroup Tax kümmert sich um alle steuerlichen Angelegenheiten der Deutschen Bank AG und ist in zwei Bereiche untergliedert. Der Bereich Tax Reporting & Compliance ist verantwortlich für die Steuerberichterstattung und die Erfüllung von steuerrechtlichen Vorgaben und Anforderungen. Der Bereich Tax Advisory Services ist der Berater für unsere Geschäfts- und Infrastrukturbereiche.Über diese PositionDie Rolle des Tax Advisors (d/m/w) ist im Team Product & Clients im Bereich Tax Advisory angesiedelt und erstreckt sich überwiegend auf den steuerlichen Review und die Freigaben internationaler Fondsstrukturen, Produkte und Transaktionen. Die Rolle beinhaltet eine enge Abstimmung mit den Geschäftsbereichen der Deutschen Bank sowie externen Berater*innen.Ihre AufgabenSteuerliche Inhouse-Beratung zu Produktsteuerthemen (inkl. Versicherungsprodukte)Prüfung von komplexen internationalen Fondsstrukturen (Immobilien-, Private Equity-, Infrastruktur- Hedgefonds) und von komplexen Transaktionen und Bankprodukten im Rahmen des New-Product/-Transaction Approval Prozesses vor dem Hintergrund des nationalen und internationalen Steuerrechts inkl. DAC6Gestaltung und Abstimmung von Steuerklauseln in unterschiedlichsten VerträgenMonitoring und Umsetzung nationaler und internationaler steuerrechtlicher Gesetzesänderungen in Bezug auf Bankprodukte und FondsstrukturenVerbands- und ProjektarbeitEnge Zusammenarbeit mit externen steuerlichen Berater*innen und den GeschäftsbereichenIhre Fähigkeiten und ErfahrungenAbgeschlossenes Studium der Rechts- oder Wirtschaftswissenschaften mit Schwerpunkt Steuern oder eine vergleichbare QualifikationRechtsanwältin/ Rechtsanwalt oder Steuerberater*inTiefgehende Erfahrung in der steuerrechtlichen Beratung und/oder Prüfung im Rahmen des New-Product/-Transaction Approval Prozesses zu komplexen nationalen und internationalen Fondsstrukturen bzw. Produkten und Transaktionen in einem Finanzinstitut oder in der steuerrechtlichen BeratungErwartet werden Erfahrungen im Bereich des nationalen Steuerrechts (z.B. Einkommen-, Körperschaft- und Investmentsteuerrecht) und des internationalen Steuerrechts (z.B. Außensteuergesetz, Doppelbesteuerungsabkommen, Quellensteuern)Wünschenswert, aber kein Muss, sind Grundkenntnisse im Bereich des nationalen und internationalen fondsspezifischen Aufsichtsrechts und GesellschaftsrechtsSehr gute Kommunikationsfähigkeiten und eine proaktive ArbeitsweiseÜberzeugendes Auftreten und Durchsetzungsstärke sowie die Fähigkeit, auch unter Termindruck sorgfältig und zielgerichtet zu arbeitenSehr gute Deutsch- und Englischkenntnisse in Wort und SchriftWas wir Ihnen bietenWir bieten eine breite Palette von Leistungen, die all Ihre beruflichen und persönlichen Bedürfnisse abdecken.Emotional ausgeglichenEine positive Haltung hilft uns, die Herausforderungen des Alltags zu meistern – beruflich wie privat. Profitieren Sie von Angeboten wie Beratung in schwierigen Lebenssituationen und Angeboten zur Förderung mentaler Gesundheit.Körperlich fitMit Angeboten zur Aufrechterhaltung Ihrer persönlichen Gesundheit und einem förderlichen beruflichen Umfeld hilft Ihnen die Bank, körperlich fit zu bleiben. Profitieren Sie von Angeboten wie umfangreichen Check-up Untersuchungen, Impfangeboten und Beratung zur gesunden Lebensführung.Sozial vernetztDer Austausch mit anderen eröffnet uns neue Perspektiven, bringt uns beruflich wie persönlich voran und stärkt unser Selbstvertrauen und Wohlbefinden. Profitieren Sie von Angeboten wie Unterstützung durch den pme Familienservice, das FitnessCenter Job, flexible Arbeitszeitmodelle (bspw. Teilzeit, Jobtandem, hybrides Arbeiten) sowie einer umfangreichen Kultur der Vielfalt, Chancengleichheit und Teilhabe.Finanziell abgesichertDie Bank sichert Sie nicht nur während Ihrer aktiven Karriere, sondern auch für die Zukunft finanziell ab und unterstützt Ihre Flexibilität sowie Mobilität – egal ob privat oder beruflich. Profitieren Sie von Angeboten wie Beitragsplänen für Altersvorsorge, Bankdienstleistungen für Mitarbeiter*innen, Firmenfahrrad oder dem Deutschlandticket.Da die Benefits je nach Standort geringfügig variieren, gehen Sie bitte bei konkreten Fragen auf Ihren Recruiter / Ihre Recruiterin zu.Die Stelle wird in Voll- und in Teilzeit angeboten.Bei Fragen zum Rekrutierungsprozess steht Ihnen Anne-Marie Plaisant gerne zur Verfügung.Kontakt Anne-Marie Plaisant: +49 (69) 910 44844 Wir streben eine Unternehmenskultur an, in der wir gemeinsam jeden Tag das Beste geben. Dazu gehören verantwortungsvolles Handeln, wirtschaftliches Denken, Initiative ergreifen und zielgerichtete Zusammenarbeit.Gemeinsam teilen und feiern wir die Erfolge unserer Mitarbeiter*innen. Gemeinsam sind wir die Deutsche Bank Gruppe.Wir begrüßen Bewerbungen von allen Menschen und fördern ein positives, faires und integratives Arbeitsumfeld.",
    "requirements": [],
    "location": {
      "city": "Frankfurt",
      "state": "Hessen",
      "country": "Deutschland",
      "remote_options": false
    },
    "employment_details": {
      "type": "Unbefristet",
      "schedule": "Vollzeit",
      "career_level": "Director",
      "salary_range": null,
      "benefits": []
    },
    "organization": {
      "name": "Deutsche Bank",
      "division": "Frankfurt",
      "division_id": 8
    },
    "posting_details": {
      "publication_date": "2025-07-02",
      "position_uri": "/index.php?ac=jobad&id=64407",
      "hiring_year": "2025"
    }
  },
  "evaluation_results": {
    "cv_to_role_match": null,
    "match_confidence": null,
    "evaluation_date": null,
    "evaluator": null,
    "domain_knowledge_assessment": null,
    "decision": {
      "apply": null,
      "rationale": null,
      "estimated_prep_time": null
    },
    "strengths": [],
    "weaknesses": []
  },
  "processing_log": [
    {
      "timestamp": "2025-07-06T18:40:57.414928",
      "action": "job_fetched",
      "processor": "enhanced_job_fetcher_v6.1",
      "status": "success",
      "details": "Successfully fetched job 64407 from Deutsche Bank API"
    },
    {
      "timestamp": "2025-07-06T18:40:57.414928",
      "action": "description_enriched",
      "processor": "web_scraper",
      "status": "success",
      "details": "Successfully fetched job description (4997 characters)"
    }
  ],
  "raw_source_data": {
    "api_response": {
      "MatchedObjectId": "64407",
      "MatchedObjectDescriptor": {
        "PositionOfferingType": [
          {
            "Name": "Unbefristet"
          }
        ],
        "PositionSchedule": [
          {
            "Name": "Vollzeit"
          }
        ],
        "PublicationChannel": [
          {
            "StartDate": "2025-07-02"
          }
        ],
        "PositionTitle": "Tax Advisor (d/m/w)",
        "PositionLocation": [
          {
            "CityName": "Frankfurt",
            "CountrySubDivisionName": "Hessen",
            "CountryName": "Deutschland"
          }
        ],
        "PositionURI": "/index.php?ac=jobad&id=64407",
        "PositionID": "64407",
        "OrganizationName": "Frankfurt",
        "PositionHiringYear": "2025",
        "UserArea": {
          "ProDivision": 8
        },
        "CareerLevel": [
          {
            "Name": "Director"
          },
          {
            "Name": "Director"
          }
        ],
        "PublicationStartDate": "2025-07-02"
      },
      "RelevanceScore": 0,
      "RelevanceRank": 6
    },
    "specialist_analysis": {},
    "description_source": "web_scraping"
  }
}