{
  "job_metadata": {
    "job_id": "64904",
    "version": "1.0",
    "created_at": "2025-07-04T06:42:23.438354",
    "last_modified": "2025-07-04T06:42:23.438354",
    "source": "deutsche_bank_api",
    "processor": "enhanced_job_fetcher_v6.1",
    "status": "fetched"
  },
  "job_content": {
    "title": "DWS - Know Your Client (KYC) Analyst (m/f/d)",
    "description": "DWS - Know Your Client (KYC) Analyst (m/f/d) Job ID:R0394415 Full/Part-Time: Full-time Regular/Temporary: Regular Listed: 2025-07-03 Location: Frankfurt Position Overview Über die DWSHeutzutage sind die Märkte einer ganzen Reihe von Risiken ausgesetzt - aber auch einer ganzen Reihe von Chancen. Die Chance, anders zu innovieren. Die Chance, verantwortungsvoll zu investieren. Und die Chance, etwas zu verändern.Kommen Sie zu DWS und werden Sie Teil eines branchenführenden Unternehmens mit globaler Präsenz. Hier werden Sie bestärkt, ehrgeizige Programme zu leiten, um die Zukunft des Investierens zu gestalten und unsere Kunden, lokale Gemeinschaften und die Umwelt zu unterstützen.Wir suchen kreative Denker und Innovatoren, um die Chancen von morgen zu nutzen und die bestmögliche Grundlage für die finanzielle Zukunft unserer Kunden zu schaffen. Aus diesem Grund sind wir \"Investors for a new now\".Im Gegenzug bieten wir Ihnen die Plattform, die Sie brauchen, um etwas zu bewirken, indem Sie mit einigen der größten Vordenker der Branche zusammenarbeiten.Das ist Ihre Chance, Ihre Ziele zu erreichen und eine außergewöhnliche Karriere zu führen. Das ist Ihre Chance, in Ihre Zukunft zu investieren.Lesen Sie hier mehr über DWS und wer wir sind (www.dws.com/de-de/)Team- / Divisionbeschreibung Das Client Due Diligence (CDD) Team ist Teil von Client & Investment Monitoring (CIM) und in der DWS CAO Division angesiedelt. Das Team ist global aufgestellt und spielt eine zentrale Rolle bei der Unterstützung der Client Coverage Division, um sicherzustellen, dass alle institutionellen Neukunden-Onboardings sowie deren regelmäßige und anlassbezogene KYC-Prüfungen jederzeit den regulatorischen Anforderungen und internen Vorgaben entsprechen. Dabei arbeitet das Team eng mit verschiedenen Stakeholdern, wie Client Coverage (CCD), Anti-Financial-Crime (AFC), Legal Documentation Management (LDM), zusammen, um die DB/DWS Anti-Money Laundering (AML), Know Your Client (KYC) und Sanction & Embargo (S&E) Anforderungen umzusetzen.Rollenbeschreibung \"Know-Your-Client\" ist Dein Thema und Du unterstützt mit Eifer und Begeisterung das EMEA CDD Institutional Implementation Team bei der vollumfänglichen Koordinierung aller KYC-relevanten Aufgaben während des gesamten Client Lifecycles. Durch Trainings halten wir Dich immer up to date, vor allem in Bezug auf neue Gesetze, Regularien und Richtlinien sowie lokale Sorgfaltspflichten und die Erfüllung interner KYC-Anforderungen. Mit Deiner Expertise bist Du ein kompetenter Ansprechpartner und unterstützt unsere globalen Kundenbetreuer bei der Erfüllung ihrer Sorgfaltspflichten. Gemeinsam mit diesen steuerst Du die KYC’s und hast dabei immer alle Fristen im Blick. Gegenseitige Verlässlichkeit und Teamwork sind bei uns gelebte Praxis. Mit Deiner engagierten Art baust Du Dir ein internes Netzwerk auf und hilfst dabei, unsere hohen KYC-Qualitätsstandards jederzeit zu gewährleisten.Du suchst eine interessante Aufgabe in einem globalen, dynamischen Umfeld, bei der keine Langeweile aufkommt und die Dir einen ganzheitlichen Blick auf den gesamten KYC-Prozess ermöglicht? Dann bist Du bei uns im Team genau richtig! Als Client Due Diligence Analyst – Implementation erwarten Dich folgende Aufgaben:Eigenständige Durchführung und Dokumentation vollständiger und fristgerechter KYC/Sanktions-Überprüfungen von nationalen und internationalen Neu- und Bestandskunden unter Berücksichtigung der globalen/lokalen Richtlinien und jeweiligen lokalen regulatorischen VorgabenHauptansprechpartner für die Client Coverage Division bei Fragen zur Durchführung von KYC/Sanktions-ÜberprüfungenMitwirkung bei der Bearbeitung von Anfragen aus den Bereichen CDD Monitoring und AFCMitwirkung bei der Optimierung bestehender Prozesse zur Effizienzsteigerung und ProzessvereinfachungProjektunterstützung bzw. Übernahme von regelmäßigen und ad-hoc SonderprozessenUmsetzung neuer (Prozess-)Anforderungen und Unterstützung von Maßnahmen zur QualitätssicherungUnterstützung der Teamleitung bei der Erstellung von Management ReportingsWir suchen dich:Dein abgeschlossenes Hochschulstudium/Fachholschulstudium; alternativ abgeschlossene kaufmännische Ausbildung mit entsprechender Weiterbildung (Bankbetriebswirt, MBA, CFA, etc.) kombinierst Du mit einer mehrjährigen Praxis in der Finanzindustrie im Bereich KYC oder Anti Financial CrimeDu verfügst über fundierte Erfahrungen im KYC-Bereich mit entsprechenden Kenntnissen der rechtlichen Anforderungen und Richtlinien sowie der Kompetenz zur fachlichen und technischen Umsetzung von regulatorischen AnforderungenDas Erkennen und Durchdringen komplexer Prozesse ist für Dich kein ProblemKommunikationsstärke, ein sicheres Auftreten, Belastbarkeit und Flexibilität zeichnen Dich ausDu arbeitest selbständig, gewissenhaft, akkurat und zuverlässigDu arbeitest gerne in einem dynamischen, internationalen TeamIm Umgang mit moderner IT bist Du versiert und beherrschst verhandlungssicher Deutsch und Englisch in Wort und SchriftAusschreibungszeitraum: 20.06.2025 bis auf WeiteresWir bieten Ihnen:Ohne den Ehrgeiz unserer Mitarbeiter wären unsere Erfolge nicht möglich. Und es ist uns wichtig, dass Sie gerne zur Arbeit kommen – gesund, glücklich und wertgeschätzt. Bei der DWS haben Sie Zugriff auf eine Reihe von Benefits, aus denen Sie wählen können und die speziell auf Ihren Lebensstil abgestimmt sind. Egal, ob Sie sich für die Gesundheitsversorgung oder betriebliche Vergünstigungen interessieren oder über Ihre Altersvorsorge nachdenken, es ist für jeden etwas dabei.Einige unserer Benefits:Leistungen zur körperlichen und geistigen Gesundheit, einschließlich (aber nicht beschränkt auf) der gesetzlichen Krankenversicherung (BKK), Krankengeld und Support-Hotlines für MitarbeiterFamilienfreundliche Leistungen, einschließlich großzügiger Elternzeitpakete (unterstützt alle Varianten von Familienformen) und Unterstützung bei der Suche nach Kinderbetreuungsmöglichkeiten, einschließlich des DWS-eigenen KindergartenservicesEine Vielzahl an Pensionsplänen, persönlichen Budgetkonten zur Ermöglichung von Sabbaticals oder vorzeitigem Ruhestand sowie vermögenswirksamen LeistungenDie Möglichkeit, unsere CSR-Strategie zu unterstützen, die sich auf die Bekämpfung des Klimawandels und die Erreichung größerer sozialer Gerechtigkeit konzentriert. Sie können an unsere Partnerorganisationen spenden oder sich an Corporate-Volunteering-Möglichkeiten in Ihren lokalen Gemeinden beteiligen, indem Sie uns vor Ort unterstützenLeistungen zur Mobilität, beispielsweise ein subventioniertes Deutschlandticket sowie Angebote zu Firmenwagen und JobRadDas aktuelle Hybrid-Arbeitsmodell der DWS ist darauf ausgelegt, die Balance zwischen persönlicher Zusammenarbeit und Engagement im Büro zu finden, die den Kern unserer Arbeitskultur ausmacht. Wir setzen uns für die Unterstützung flexibler und hybrider Arbeitsvereinbarungen auf der ganzen Welt ein. Abhängig von dem Standort oder der Stelle, auf die Sie sich bewerben, wird die Aufteilung zwischen der Arbeit im Büro und der Arbeit zu Hause im Rahmen Ihres Bewerbungs- und Interviewprozesses besprochen.Wir werden unsere Arbeitsumgebungen und -methoden weiterhin überprüfen und weiterentwickeln, um bestmögliche Arbeitsbedingungen für unsere Mitarbeiter zu schaffen.Wenn Sie aus irgendeinem Grund, einschließlich oder im Zusammenhang mit einer Behinderung oder einem langfristigen Gesundheitszustand, Anpassungen oder Änderungen am Bewerbungsprozess benötigen, wenden Sie sich bitte an Ihren Recruiter und teilen Sie uns mit, welche Unterstützung Sie möglicherweise benötigen. Beispiele für Anpassungen sind die Änderung des Interviewformats oder die Bereitstellung von Unterstützung in den Räumlichkeiten der DWS. Dies hat keine Auswirkungen auf Ihre Bewerbung und Ihr Rekrutierungsteam wird die Optionen mit Ihnen besprechen.#LI-EL1 #LI-02 Wir streben eine Unternehmenskultur an, in der wir gemeinsam jeden Tag das Beste geben. Dazu gehören verantwortungsvolles Handeln, wirtschaftliches Denken, Initiative ergreifen und zielgerichtete Zusammenarbeit.Gemeinsam teilen und feiern wir die Erfolge unserer Mitarbeiter*innen. Gemeinsam sind wir die Deutsche Bank Gruppe.Wir begrüßen Bewerbungen von allen Menschen und fördern ein positives, faires und integratives Arbeitsumfeld.",
    "requirements": [],
    "location": {
      "city": "Frankfurt",
      "state": "Hessen",
      "country": "Deutschland",
      "remote_options": false
    },
    "employment_details": {
      "type": "Unbefristet",
      "schedule": "Vollzeit",
      "career_level": "kein Corporate Title",
      "salary_range": null,
      "benefits": []
    },
    "organization": {
      "name": "Deutsche Bank",
      "division": "Frankfurt",
      "division_id": 4
    },
    "posting_details": {
      "publication_date": "2025-07-03",
      "position_uri": "/index.php?ac=jobad&id=64904",
      "hiring_year": "2025"
    }
  },
  "evaluation_results": {
    "cv_to_role_match": null,
    "match_confidence": null,
    "evaluation_date": null,
    "evaluator": null,
    "domain_knowledge_assessment": null,
    "decision": {
      "apply": null,
      "rationale": null,
      "estimated_prep_time": null
    },
    "strengths": [],
    "weaknesses": []
  },
  "processing_log": [
    {
      "timestamp": "2025-07-04T06:42:23.438354",
      "action": "job_fetched",
      "processor": "enhanced_job_fetcher_v6.1",
      "status": "success",
      "details": "Successfully fetched job 64904 from Deutsche Bank API"
    },
    {
      "timestamp": "2025-07-04T06:42:23.438354",
      "action": "description_enriched",
      "processor": "web_scraper",
      "status": "success",
      "details": "Successfully fetched job description (8288 characters)"
    }
  ],
  "raw_source_data": {
    "api_response": {
      "MatchedObjectId": "64904",
      "MatchedObjectDescriptor": {
        "PositionOfferingType": [
          {
            "Name": "Unbefristet"
          }
        ],
        "PositionSchedule": [
          {
            "Name": "Vollzeit"
          }
        ],
        "PublicationChannel": [
          {
            "StartDate": "2025-07-03"
          }
        ],
        "PositionTitle": "DWS - Know Your Client (KYC) Analyst (m/f/d)",
        "PositionLocation": [
          {
            "CityName": "Frankfurt",
            "CountrySubDivisionName": "Hessen",
            "CountryName": "Deutschland"
          }
        ],
        "PositionURI": "/index.php?ac=jobad&id=64904",
        "PositionID": "64904",
        "OrganizationName": "Frankfurt",
        "PositionHiringYear": "2025",
        "UserArea": {
          "ProDivision": 4
        },
        "CareerLevel": [
          {
            "Name": "kein Corporate Title"
          }
        ],
        "PublicationStartDate": "2025-07-03"
      },
      "RelevanceScore": 0,
      "RelevanceRank": 1
    },
    "specialist_analysis": {},
    "description_source": "web_scraping"
  }
}