{
  "job_metadata": {
    "job_id": "64326",
    "version": "1.0",
    "created_at": "2025-07-04T06:42:41.952778",
    "last_modified": "2025-07-04T06:42:41.952778",
    "source": "deutsche_bank_api",
    "processor": "enhanced_job_fetcher_v6.1",
    "status": "fetched"
  },
  "job_content": {
    "title": "Germany / EMEA Regional Lead Preventing Facilitation of Tax Evasion (d/m/w)",
    "description": "Germany / EMEA Regional Lead Preventing Facilitation of Tax Evasion (d/m/w) Job ID:R0386985 Full/Part-Time: Full-time Regular/Temporary: Regular Listed: 2025-07-01 Location: Frankfurt Position Overview Über den BereichDie Deutsche Bank (DB) kann auf eine sehr erfahrene und engagierte Abteilung für die Bekämpfung von Finanzkriminalität (Anti Financial Crime, AFC) zurückgreifen. Diese spielt eine entscheidende Rolle dabei, der Finanzkriminalität bei Geschäftsaktivitäten und globalen Finanzdienstleistungen der DB vorzubeugen und gleichzeitig die Interessen der Bank und der Gesellschaft zu wahren.Um Finanzkriminalität wirksam zu bekämpfen und flexibel auf Herausforderungen zu reagieren, hat AFC eine Matrixstruktur, die regionale, geschäftsbereichsbezogene und globale Funktionen vereint. Sie teilt sich in die folgenden Kernbereiche auf: Anti-Money Laundering, Sanctions & Embargoes, Anti-Fraud, Bribery & Corruption, Investigations & Intelligence, Monitoring & Screening und Risk Assessment. Teil unseres Engagements ist es, eine enge Zusammenarbeit mit allen Geschäftsbereichen und Unterstützungsfunktionen innerhalb unserer Bank zu stärken.Was AFC für Sie tun wirdAFC hilft der Deutschen Bank, langfristig Vertrauen und Mehrwert für unsere Kunden, Mitarbeiter*innen und die Gesellschaft zu schaffen. Dabei wenden wir die höchsten Verhaltensstandards an, um den Erfolg der DB bei der Bekämpfung der Finanzkriminalität zu gewährleisten. Wir bieten Ihnen herausfordernde Möglichkeiten, zu lernen, einen Beitrag zu leisten und von Ihrer Reise mit uns zu profitieren. Wir fördern eine offene und integrative Teamkultur mit dem Ziel, eine gesunde, engagierte und gut unterstützte vielfältige Belegschaft aufzubauen und zu erhalten, die in der Lage ist, ihr Bestes zu geben.Group AML & PFoTE ist ein zentrales Team, das für die Entwicklung, Dokumentation und Förderung der Umsetzung von Leitprinzipien in AFC für die Risikotypen ML und FoTE gesamthaft zuständig ist. Dieses Team stellt die notwendige Governance und Aufsicht für den Konzerngeldwäschebeauftragten zur Verfügung, um zu gewährleisten und diesen darin zu unterstützen, dass die zur ordnungsgemäßen Erfüllung bestimmter gesetzlicher Verpflichtungen nach dem GwG erforderlichen Informationen im ausreichenden Maße vorhanden sind und die Bank auch ihrer Verpflichtungen gemäß HRMC 6 Guiding Principles nachkommt.Ihre AufgabenGroup PFoTE „Prevention of the Facilitation of Tax Evasion“ (Verhinderung der Beihilfe zur Steuerhinterziehung) ist ein zentrales Steuerungsteam, das für die Entwicklung, Dokumentation und Lenkung der Implementierung leitender Grundsätze in AFC, insbesondere für den entsprechenden Risikotyp verantwortlich ist. Neben einer Anzahl weiterer Aufgaben ist das Team auch zuständig für die Durchführung von Schulungen, die Schaffung von Bewusstsein, die Festlegung weltweit geltender Anforderungen und Maßnahmen und die Förderung einer Kultur, die die Beihilfe zur Steuerhinterziehung in der gesamten Bank entschlossen verhindert.Sie treiben Aktivitäten voran für die weitere Implementierung des Risikotyps, einschließlich der Koordination relevanter Stakeholder in den Business Bereichen und AFCSie sind für den Aufbau, die Entwicklung und die Aktualisierung der Strukturen für den Risikotyp zuständigSie verantworten individuelle und komplexe Aufgaben, die funktionsübergreifendes Management erfordernSie fungieren als zentraler Ansprechpartner für alle relevante SchlüsselakteureSie beraten AFC, Compliance und Kollegen im Business zum Thema „Verhinderung der Beihilfe zur Steuerhinterziehung“Ihre Fähigkeiten und ErfahrungenSie haben einen juristischen, wirtschaftsrechtlichen oder betriebswirtschaftlichen Abschluss einer akkreditierten Hochschule bzw. Universität und haben sich im Steuerrecht spezialisiert und/oder sind Steuerberater mit beruflicher Erfahrung im Bereich Finanzdienstleistungen oder der Abwicklung von Finanztransaktionen und M&A DealsSie verfügen über eine erfolgreiche Erfolgsbilanz im Programm- oder Projektmanagement und Erfahrung in der bereichsübergreifenden Zusammenarbeit und den damit verbundenen potenzielle HürdenSie besitzen ein ausgeprägtes Verständnis und Wissen im Bereich der Verhinderung der Beihilfe zur SteuerhinterziehungSie können mit einer hohen Komplexität umgehen, effektiv in einer Matrix-Organisation mit einer komplexen Stakeholder-Struktur arbeiten und haben die Fähigkeit, Probleme aus einer breiten Spanne von Themen aufzunehmen und gut fundierte Beurteilungen abzugebenSie besitzen die Fähigkeit in einem kleinen, zweckgetriebenen Team mit erfahrenen Kollegen Aufgaben vollständig zu übernehmen, sich mit Ihren Kollegen abzustimmen und Ihre Aufgaben zu einem erfolgreichen Abschluss zu bringenSie müssen komplexe Themen in Deutsch und Englisch kommunizieren können, diese, sofern erforderlich, vereinfachen und schriftlich darstellen könnenWas wir Ihnen bietenWir bieten eine breite Palette von Leistungen, die all Ihre beruflichen und persönlichen Bedürfnisse abdecken.Emotional ausgeglichenEine positive Haltung hilft uns, die Herausforderungen des Alltags zu meistern – beruflich wie privat. Profitieren Sie von Angeboten wie Beratung in schwierigen Lebenssituationen und Angeboten zur Förderung mentaler Gesundheit.Körperlich fitMit Angeboten zur Aufrechterhaltung Ihrer persönlichen Gesundheit und einem förderlichen beruflichen Umfeld hilft Ihnen die Bank, körperlich fit zu bleiben. Profitieren Sie von Angeboten wie umfangreichen Check-up Untersuchungen, Impfangeboten und Beratung zur gesunden Lebensführung.Sozial vernetztDer Austausch mit anderen eröffnet uns neue Perspektiven, bringt uns beruflich wie persönlich voran und stärkt unser Selbstvertrauen und Wohlbefinden. Profitieren Sie von Angeboten wie Unterstützung durch den pme Familienservice, das FitnessCenter Job, flexible Arbeitszeitmodelle (bspw. Teilzeit, Jobtandem, hybrides Arbeiten) sowie einer umfangreichen Kultur der Vielfalt, Chancengleichheit und Teilhabe.Finanziell abgesichertDie Bank sichert Sie nicht nur während Ihrer aktiven Karriere, sondern auch für die Zukunft finanziell ab und unterstützt Ihre Flexibilität sowie Mobilität – egal ob privat oder beruflich. Profitieren Sie von Angeboten wie Beitragsplänen für Altersvorsorge, Bankdienstleistungen für Mitarbeiter*innen, Firmenfahrrad oder dem Deutschlandticket.Da die Benefits je nach Standort geringfügig variieren, gehen Sie bitte bei konkreten Fragen auf Ihren Recruiter / Ihre Recruiterin zu.Die Stelle wird in Voll- und in Teilzeit angeboten.Bei Fragen zum Rekrutierungsprozess steht Ihnen Pierre Kujat gerne zur Verfügung.Kontakt Pierre Kujat: +49 1605138367 Wir streben eine Unternehmenskultur an, in der wir gemeinsam jeden Tag das Beste geben. Dazu gehören verantwortungsvolles Handeln, wirtschaftliches Denken, Initiative ergreifen und zielgerichtete Zusammenarbeit.Gemeinsam teilen und feiern wir die Erfolge unserer Mitarbeiter*innen. Gemeinsam sind wir die Deutsche Bank Gruppe.Wir begrüßen Bewerbungen von allen Menschen und fördern ein positives, faires und integratives Arbeitsumfeld.",
    "requirements": [],
    "location": {
      "city": "Frankfurt",
      "state": "Hessen",
      "country": "Deutschland",
      "remote_options": false
    },
    "employment_details": {
      "type": "Unbefristet",
      "schedule": "Vollzeit",
      "career_level": "Vice President",
      "salary_range": null,
      "benefits": []
    },
    "organization": {
      "name": "Deutsche Bank",
      "division": "Frankfurt",
      "division_id": 10056
    },
    "posting_details": {
      "publication_date": "2025-07-01",
      "position_uri": "/index.php?ac=jobad&id=64326",
      "hiring_year": "2025"
    }
  },
  "evaluation_results": {
    "cv_to_role_match": null,
    "match_confidence": null,
    "evaluation_date": null,
    "evaluator": null,
    "domain_knowledge_assessment": null,
    "decision": {
      "apply": null,
      "rationale": null,
      "estimated_prep_time": null
    },
    "strengths": [],
    "weaknesses": []
  },
  "processing_log": [
    {
      "timestamp": "2025-07-04T06:42:41.952778",
      "action": "job_fetched",
      "processor": "enhanced_job_fetcher_v6.1",
      "status": "success",
      "details": "Successfully fetched job 64326 from Deutsche Bank API"
    },
    {
      "timestamp": "2025-07-04T06:42:41.952778",
      "action": "description_enriched",
      "processor": "web_scraper",
      "status": "success",
      "details": "Successfully fetched job description (7079 characters)"
    }
  ],
  "raw_source_data": {
    "api_response": {
      "MatchedObjectId": "64326",
      "MatchedObjectDescriptor": {
        "PositionOfferingType": [
          {
            "Name": "Unbefristet"
          }
        ],
        "PositionSchedule": [
          {
            "Name": "Vollzeit"
          }
        ],
        "PublicationChannel": [
          {
            "StartDate": "2025-07-01"
          }
        ],
        "PositionTitle": "Germany / EMEA Regional Lead Preventing Facilitation of Tax Evasion (d/m/w)",
        "PositionLocation": [
          {
            "CityName": "Frankfurt",
            "CountrySubDivisionName": "Hessen",
            "CountryName": "Deutschland"
          }
        ],
        "PositionURI": "/index.php?ac=jobad&id=64326",
        "PositionID": "64326",
        "OrganizationName": "Frankfurt",
        "PositionHiringYear": "2025",
        "UserArea": {
          "ProDivision": 10056
        },
        "CareerLevel": [
          {
            "Name": "Vice President"
          }
        ],
        "PublicationStartDate": "2025-07-01"
      },
      "RelevanceScore": 0,
      "RelevanceRank": 8
    },
    "specialist_analysis": {},
    "description_source": "web_scraping"
  }
}