{
  "job_metadata": {
    "job_id": "64914",
    "version": "1.0",
    "created_at": "2025-07-06T18:40:54.740776",
    "last_modified": "2025-07-06T18:40:54.740776",
    "source": "deutsche_bank_api",
    "processor": "enhanced_job_fetcher_v6.1",
    "status": "fetched"
  },
  "job_content": {
    "title": "DWS - AFC &amp; Compliance Officer - Sanctions Advisor (m/f/d)",
    "description": "DWS - AFC & Compliance Officer - Sanctions Advisor (m/f/d) Job ID:R0394557 Full/Part-Time: Full-time Regular/Temporary: Regular Listed: 2025-07-03 Location: Frankfurt Position Overview Über die DWSHeutzutage sind die Märkte einer ganzen Reihe von Risiken ausgesetzt - aber auch einer ganzen Reihe von Chancen. Die Chance, anders zu innovieren. Die Chance, verantwortungsvoll zu investieren. Und die Chance, etwas zu verändern.Kommen Sie zu DWS und werden Sie Teil eines branchenführenden Unternehmens mit globaler Präsenz. Hier werden Sie bestärkt, ehrgeizige Programme zu leiten, um die Zukunft des Investierens zu gestalten und unsere Kunden, lokale Gemeinschaften und die Umwelt zu unterstützen.Wir suchen kreative Denker und Innovatoren, um die Chancen von morgen zu nutzen und die bestmögliche Grundlage für die finanzielle Zukunft unserer Kunden zu schaffen. Aus diesem Grund sind wir \"Investors for a new now\".Im Gegenzug bieten wir Ihnen die Plattform, die Sie brauchen, um etwas zu bewirken, indem Sie mit einigen der größten Vordenker der Branche zusammenarbeiten.Das ist Ihre Chance, Ihre Ziele zu erreichen und eine außergewöhnliche Karriere zu führen. Das ist Ihre Chance, in Ihre Zukunft zu investieren.Lesen Sie hier mehr über DWS und wer wir sind (www.dws.com/de-de/)Team- / Divisionbeschreibung Die DWS Group verpflichtet sich zu den höchsten Standards der Bekämpfung von Geldwäsche (AML), Sanktionen und Embargos, Anti-Korruption und Bestechung (ABC) sowie Betrugsbekämpfung (gemeinsam als Bekämpfung von Finanzkriminalität bezeichnet). Die DWS-Geschäftsleitung und alle Mitarbeiter sind verpflichtet, diese Standards einzuhalten, um die DWS und unseren Ruf davor zu schützen, dass unsere Produkte und Dienstleistungen für Geldwäsche, Bestechung, Korruption, Betrug und / oder Terrorismusfinanzierung (CTF) Zwecke missbraucht werden.Die DWS Group überprüft ihre Strategien, Ziele und Vorgaben zur Bekämpfung von Finanzkriminalität (AFC) kontinuierlich um ein effektives Programm, das den Best Practices eines diversifizierten, globalen Finanzdienstleisters entspricht, aufrechtzuerhalten.AFC dient dazu, sicherzustellen, dass die DWS mit Integrität und Disziplin im Hinblick auf die rechtlichen und regulatorischen Anforderungen des Geldwäsche-Regimes handelt, einschließlich der Anforderungen etwaiger relevanter Sanktionsbehörden.Das DWS-Sanctions Office ist Teil des globalen AFC-Team, das als Kontrollfunktion der zweiten Verteidigungslinie (2nd LoD) agiert und alle notwendigen Initiativen umsetzt, um allen aktuellen Standards im Bereich der Bekämpfung von Finanzkriminalität für die DWS-Gruppe und deren Kunden, einschließlich DWS Deutschland, gerecht zu werden. Das DWS Sanktions-Team bietet fachspezifische Expertise und Beratung zu Sanktionen für die DWS-Gruppeneinheiten weltweit.Rollenbeschreibung Als AFC & Compliance Officer gehört zu Ihren Aufgaben:Unterstützung des Global Head of Sanctions & Embargoes beim Schutz der DWS vor rechtlichen, regulatorischen und reputationellen Risiken im Zusammenhang mit sanktionierten Unternehmen und / oder Ländern inklusive des Reporting für die EMEA-RegionAnsprechpartner zu allen Fragestellungen im Zusammenhang mit Sanktionen und Embargos in der EMEA-RegionKontinuierliche Überwachung von wesentlichen Änderungen der Sanktionsvorschriften und Unterstützung des Unternehmens in der EMEA-Region und deren Auswirkungen auf das Geschäftsmodell der DWS.Sorgfältige Überprüfung von handelsbezogenen Anfragen und Entscheidung über die Zulässigkeit der vorgeschlagenen Handelsaktivität, um die Einhaltung der geltenden Sanktionsvorschriften und relevanten Sanktionsrichtlinien sicherzustellen.Unterstützung bei der Prüfung von sanktionsbezogenen Aspekten im Rahmen von NPA- und Deal-Team-Aktivitäten, einschließlich der Überprüfung von Abweichungen von den internen Standardsanktions KlauselnUnterstützung bei ad-hoc-Projekten zur Verbesserung des Sanktions-Compliance-ProgrammsUnterstützung bei globalen Schulungen zum Thema Sanktionen.Teilnahme an allen sanktionsrelevanten Sitzungen der DB Group in der EMEA-Region, einschließlich der Vorbereitung von DWS-spezifischen Folien und RedebeizträgenWir suchenAbgeschlossenes Hochschulstudium, Bankausbildung oder vergleichbare Ausbildungidealerweise Erfahrung im Finanzsektor oder bei einer Beratungsfirma mit Bezug zu Anti-Financial Crime und Sanktionen und EmbargosVerhandlungssichere Kommunikationsfähigkeiten in Deutsch und Englisch (in Wort und Schrift), mit internen und externen Ansprechpartnern auf unterschiedlichen Ebenen sowie Fähigkeiten zur KonfliktbewältigungEigenmotivation, Eigeninitiative sowie rasche Lern- und Auffassungsgabe gepaart mit TeamfähigkeitAnalytisches Denkvermögen, sorgfältige und genaue ArbeitsweiseGute Kenntnisse in Word, Excel und PowerPointAusschreibungszeitraum: 18.06.2025 bis auf WeiteresWir bieten Ihnen:Ohne den Ehrgeiz unserer Mitarbeiter wären unsere Erfolge nicht möglich. Und es ist uns wichtig, dass Sie gerne zur Arbeit kommen – gesund, glücklich und wertgeschätzt. Bei der DWS haben Sie Zugriff auf eine Reihe von Benefits, aus denen Sie wählen können und die speziell auf Ihren Lebensstil abgestimmt sind. Egal, ob Sie sich für die Gesundheitsversorgung oder betriebliche Vergünstigungen interessieren oder über Ihre Altersvorsorge nachdenken, es ist für jeden etwas dabei.Einige unserer Benefits:Leistungen zur körperlichen und geistigen Gesundheit, einschließlich (aber nicht beschränkt auf) der gesetzlichen Krankenversicherung (BKK), Krankengeld und Support-Hotlines für MitarbeiterFamilienfreundliche Leistungen, einschließlich großzügiger Elternzeitpakete (unterstützt alle Varianten von Familienformen) und Unterstützung bei der Suche nach Kinderbetreuungsmöglichkeiten, einschließlich des DWS-eigenen KindergartenservicesEine Vielzahl an Pensionsplänen, persönlichen Budgetkonten zur Ermöglichung von Sabbaticals oder vorzeitigem Ruhestand sowie vermögenswirksamen LeistungenDie Möglichkeit, unsere CSR-Strategie zu unterstützen, die sich auf die Bekämpfung des Klimawandels und die Erreichung größerer sozialer Gerechtigkeit konzentriert. Sie können an unsere Partnerorganisationen spenden oder sich an Corporate-Volunteering-Möglichkeiten in Ihren lokalen Gemeinden beteiligen, indem Sie uns vor Ort unterstützenLeistungen zur Mobilität, beispielsweise ein subventioniertes Deutschlandticket sowie Angebote zu Firmenwagen und JobRadDas aktuelle Hybrid-Arbeitsmodell der DWS ist darauf ausgelegt, die Balance zwischen persönlicher Zusammenarbeit und Engagement im Büro zu finden, die den Kern unserer Arbeitskultur ausmacht. Wir setzen uns für die Unterstützung flexibler und hybrider Arbeitsvereinbarungen auf der ganzen Welt ein. Abhängig von dem Standort oder der Stelle, auf die Sie sich bewerben, wird die Aufteilung zwischen der Arbeit im Büro und der Arbeit zu Hause im Rahmen Ihres Bewerbungs- und Interviewprozesses besprochen.Wir werden unsere Arbeitsumgebungen und -methoden weiterhin überprüfen und weiterentwickeln, um bestmögliche Arbeitsbedingungen für unsere Mitarbeiter zu schaffen.Wenn Sie aus irgendeinem Grund, einschließlich oder im Zusammenhang mit einer Behinderung oder einem langfristigen Gesundheitszustand, Anpassungen oder Änderungen am Bewerbungsprozess benötigen, wenden Sie sich bitte an Ihren Recruiter und teilen Sie uns mit, welche Unterstützung Sie möglicherweise benötigen. Beispiele für Anpassungen sind die Änderung des Interviewformats oder die Bereitstellung von Unterstützung in den Räumlichkeiten der DWS. Dies hat keine Auswirkungen auf Ihre Bewerbung und Ihr Rekrutierungsteam wird die Optionen mit Ihnen besprechen.#LI-EL1 #LI-02 Wir streben eine Unternehmenskultur an, in der wir gemeinsam jeden Tag das Beste geben. Dazu gehören verantwortungsvolles Handeln, wirtschaftliches Denken, Initiative ergreifen und zielgerichtete Zusammenarbeit.Gemeinsam teilen und feiern wir die Erfolge unserer Mitarbeiter*innen. Gemeinsam sind wir die Deutsche Bank Gruppe.Wir begrüßen Bewerbungen von allen Menschen und fördern ein positives, faires und integratives Arbeitsumfeld.",
    "requirements": [],
    "location": {
      "city": "Frankfurt",
      "state": "Hessen",
      "country": "Deutschland",
      "remote_options": false
    },
    "employment_details": {
      "type": "Unbefristet",
      "schedule": "Vollzeit",
      "career_level": "Assistant Vice President",
      "salary_range": null,
      "benefits": []
    },
    "organization": {
      "name": "Deutsche Bank",
      "division": "Frankfurt",
      "division_id": 4
    },
    "posting_details": {
      "publication_date": "2025-07-03",
      "position_uri": "/index.php?ac=jobad&id=64914",
      "hiring_year": "2025"
    }
  },
  "evaluation_results": {
    "cv_to_role_match": null,
    "match_confidence": null,
    "evaluation_date": null,
    "evaluator": null,
    "domain_knowledge_assessment": null,
    "decision": {
      "apply": null,
      "rationale": null,
      "estimated_prep_time": null
    },
    "strengths": [],
    "weaknesses": []
  },
  "processing_log": [
    {
      "timestamp": "2025-07-06T18:40:54.740776",
      "action": "job_fetched",
      "processor": "enhanced_job_fetcher_v6.1",
      "status": "success",
      "details": "Successfully fetched job 64914 from Deutsche Bank API"
    },
    {
      "timestamp": "2025-07-06T18:40:54.740776",
      "action": "description_enriched",
      "processor": "web_scraper",
      "status": "success",
      "details": "Successfully fetched job description (8082 characters)"
    }
  ],
  "raw_source_data": {
    "api_response": {
      "MatchedObjectId": "64914",
      "MatchedObjectDescriptor": {
        "PositionOfferingType": [
          {
            "Name": "Unbefristet"
          }
        ],
        "PositionSchedule": [
          {
            "Name": "Vollzeit"
          }
        ],
        "PublicationChannel": [
          {
            "StartDate": "2025-07-03"
          }
        ],
        "PositionTitle": "DWS - AFC &amp; Compliance Officer - Sanctions Advisor (m/f/d)",
        "PositionLocation": [
          {
            "CityName": "Frankfurt",
            "CountrySubDivisionName": "Hessen",
            "CountryName": "Deutschland"
          }
        ],
        "PositionURI": "/index.php?ac=jobad&id=64914",
        "PositionID": "64914",
        "OrganizationName": "Frankfurt",
        "PositionHiringYear": "2025",
        "UserArea": {
          "ProDivision": 4
        },
        "CareerLevel": [
          {
            "Name": "Assistant Vice President"
          }
        ],
        "PublicationStartDate": "2025-07-03"
      },
      "RelevanceScore": 0,
      "RelevanceRank": 5
    },
    "specialist_analysis": {},
    "description_source": "web_scraping"
  }
}