{
  "job_metadata": {
    "job_id": "65047",
    "version": "1.0",
    "created_at": "2025-07-10T11:37:58.984345",
    "last_modified": "2025-07-10T11:37:58.984345",
    "source": "deutsche_bank_api",
    "processor": "enhanced_job_fetcher_v6.1",
    "status": "fetched"
  },
  "job_content": {
    "title": "Head of Digital Marketing &amp; Sales (f/m/x) - leading",
    "description": "Head of Digital Marketing & Sales (f/m/x) - leading Job ID:R0393480 Full/Part-Time: Full-time Regular/Temporary: Regular Listed: 2025-07-08 Location: Frankfurt Position Overview The Head of Digital Sales & Marketing for Wealth Management & Private Banking Germany creates and executes the Digital Sales and Marketing strategy for Deutsche Bank across Wealth Management and Private Banking clients in its home market.DB's Wealth Management & Private Banking Germany segment covers private individuals, UHNWIs, entrepreneurs and family offices. We are the strategic partner for our clients' long lasting success by providing holistic advisory, extensive products and access to DB's global network. In addition, we are working on a dedicated remote advisory proposition to cater to evolving client’s demand of digital, and multichannel banking.If you are passionate about making a significant impact and leading a team to new heights, this is the opportunity for you. Join us and be part of a journey that shapes the future of private banking in our home market.Your key responsibilitiesUtilize customer data to segment audiences for better personalizationImplement strategies to re-engage users that did not complete the sales funnelDeveloping and executing digital campaigns (email, online banking, app) to nurture leads, engage customers and drive sales onlineSearch-Engine and Display Marketing: Managing pay-per-click campaigns on search engines and digital platformsSteering & customizing technology to enhance sales tracking, personalization & reporting capabilitiesPartnerships/contractual relationsReach new customers/prospects on ATL channelsCrafting overall brand and marketing strategy and ensuring consistent visual identity, segment approaches and alignment with company vision and positioningLead your team, fostering a collaborative culture and ensuring connectivity across global marketing teams, with a focus on talentLead the dialogue on content segmentation and personalised client experiences to enhance client engagementIntegrate AI technologies to enhance marketing efficiency and effectiveness; including SEO optimisationActively identify ideas to acquire new business and where to tap client potential in close cooperation with Client AdvisorsEnsure consistent implementation of brand guidelines and messages for all Marketing activitiesDrive strategic marketing excellence in event execution, client engagement, content development, digital (incl. social media) and advertisingEffectively manages external vendors and partnerships to ensure delivery of quality of client engagementSupports global campaigns and events for regional roll-outProvides strategic and tactical counsel to key internal stakeholdersEnsures adherence to policies related to internal legal, compliance and creative reviews and approvals for marketing campaignsManage and maintain all aspects of budget efficiency and transparencyManage a team of approx 8 FTEYour skills and experience University degree or equivalentExtensive experience and business acumen to create country & state-specific marketing strategies, establish priorities, and communicate expectations effectively with clear deliverablesStrong digital sales and marketing and data acumen, with a proven track record in delivering successful digital marketing campaigns and initiativesStrategic and creative thinker with the ability to formulate strategy and demonstrate solid project management capabilities to take marketing plans from strategy to executionProven team leadership experience, with the ability to grow and manage teams across a broad spectrum of levels and experience, and demonstrated ability to coach, motivate, and manage teams in a collaborative cultureGood understanding of Sustainable investing and ESG landscape within Financial Services or similar industriesAt least 10 years of relevant experience in MarketingExperience in Wealth Management / Private BankingExcellent stakeholder management capabilitiesExperience with social media, outstanding digital marketing/content creation and editing skillsExcellent communication skills as well as positive interaction with superiors and colleagues on all levelsExperience leading a data-focused marketing teamThriving in a fast paced, high-pressured environmentTravelling within Germany will be requiredFluent in both English & GermanWhat we offerWe provide you with a comprehensive portfolio of benefits and offerings to support both, your private and professional needs.Emotionally and mentally balancedA positive mind helps us master the challenges of everyday life – both professionally and privately. We offer consultation in difficult life situations as well as mental health awareness trainings.Physically thrivingWe support you in staying physically fit through an offering to maintain personal health and a professional environment. You can benefit from health check-ups; vaccination drives as well as advice on healthy living and nutrition.Socially connectedNetworking opens up new perspectives, helps us thrive professionally and personally as well as strengthens our self-confidence and well-being. You can benefit from PME family service, FitnessCenter Job, flexible working (e.g parttime, hybrid working, job tandem) as well as an extensive culture of diversity, equity and inclusion.Financially secureWe provide you with financial security not only during your active career but also for the future. You can benefit from offerings such as pension plans, banking services, company bicycle or “Deutschlandticket”.Since our offerings slightly vary across locations, please contact your recruiter with specific questions.This job is available in full and parttime.In case of any recruitment related questions, please get in touch with Vanessa Lips.Contact Vanessa Lips: +49 (69) 910-34272 Wir streben eine Unternehmenskultur an, in der wir gemeinsam jeden Tag das Beste geben. Dazu gehören verantwortungsvolles Handeln, wirtschaftliches Denken, Initiative ergreifen und zielgerichtete Zusammenarbeit.Gemeinsam teilen und feiern wir die Erfolge unserer Mitarbeiter*innen. Gemeinsam sind wir die Deutsche Bank Gruppe.Wir begrüßen Bewerbungen von allen Menschen und fördern ein positives, faires und integratives Arbeitsumfeld.",
    "requirements": [
      "10 years of relevant experience in MarketingExperience in Wealth Management / Private BankingExcellent stakeholder management capabilitiesExperience with social media",
      "MarketingExperience in Wealth Management / Private BankingExcellent stakeholder management capabilitiesExperience with social media"
    ],
    "location": {
      "city": "Frankfurt",
      "state": "Hessen",
      "country": "Deutschland",
      "remote_options": false
    },
    "employment_details": {
      "type": "Unbefristet",
      "schedule": "Vollzeit",
      "career_level": "Director",
      "salary_range": null,
      "benefits": []
    },
    "organization": {
      "name": "Deutsche Bank",
      "division": "Frankfurt",
      "division_id": 10032
    },
    "posting_details": {
      "publication_date": "2025-07-08",
      "position_uri": "/index.php?ac=jobad&id=65047",
      "hiring_year": "2025"
    }
  },
  "evaluation_results": {
    "cv_to_role_match": null,
    "match_confidence": null,
    "evaluation_date": null,
    "evaluator": null,
    "domain_knowledge_assessment": null,
    "decision": {
      "apply": null,
      "rationale": null,
      "estimated_prep_time": null
    },
    "strengths": [],
    "weaknesses": []
  },
  "processing_log": [
    {
      "timestamp": "2025-07-10T11:37:58.984345",
      "action": "job_fetched",
      "processor": "enhanced_job_fetcher_v6.1",
      "status": "success",
      "details": "Successfully fetched job 65047 from Deutsche Bank API"
    },
    {
      "timestamp": "2025-07-10T11:37:58.984345",
      "action": "description_enriched",
      "processor": "web_scraper",
      "status": "success",
      "details": "Successfully fetched job description (6263 characters)"
    }
  ],
  "raw_source_data": {
    "api_response": {
      "MatchedObjectId": "65047",
      "MatchedObjectDescriptor": {
        "PositionOfferingType": [
          {
            "Name": "Unbefristet"
          }
        ],
        "PositionSchedule": [
          {
            "Name": "Vollzeit"
          }
        ],
        "PublicationChannel": [
          {
            "StartDate": "2025-07-08"
          }
        ],
        "PositionTitle": "Head of Digital Marketing &amp; Sales (f/m/x) - leading",
        "PositionLocation": [
          {
            "CityName": "Frankfurt",
            "CountrySubDivisionName": "Hessen",
            "CountryName": "Deutschland"
          }
        ],
        "PositionURI": "/index.php?ac=jobad&id=65047",
        "PositionID": "65047",
        "OrganizationName": "Frankfurt",
        "PositionHiringYear": "2025",
        "UserArea": {
          "ProDivision": 10032
        },
        "CareerLevel": [
          {
            "Name": "Director"
          },
          {
            "Name": "Director"
          }
        ],
        "PublicationStartDate": "2025-07-08"
      },
      "RelevanceScore": 0,
      "RelevanceRank": 7
    },
    "specialist_analysis": {},
    "description_source": "web_scraping"
  }
}