{
  "job_metadata": {
    "job_id": "64981",
    "version": "1.0",
    "created_at": "2025-07-10T11:42:56.664324",
    "last_modified": "2025-07-10T11:42:56.664324",
    "source": "deutsche_bank_api",
    "processor": "enhanced_job_fetcher_v6.1",
    "status": "fetched"
  },
  "job_content": {
    "title": "Model Validation Senior Specialist (f/m/x)",
    "description": "Model Validation Senior Specialist (f/m/x) Job ID:R0391192 Full/Part-Time: Full-time Regular/Temporary: Regular Listed: 2025-07-07 Location: Frankfurt Position Overview Hintergrundinformationen zu Model Risk Management und Credit Validation:Model Risk Management ist für das übergreifende Management von Modell Risiko zuständig. Dazu gehören die unabhängige Validierung von internen Modellen sowie die Identifikation, das Messen und die Überwachung des Modell Risikos.Innerhalb von Model Risk Management ist das Team Credit Validation für die Validierung und das Management von Modell Risiko der Kreditrisikomodelle der Deutsche Bank zuständig. Dies beinhaltet unter anderem die Validierung von Ratingmethoden sowie die Validierung aller betreffenden Kreditrisikoparameter.Ihre AufgabenSie führen quantitative Validierungen von Ratingmethoden und Kreditrisikoparametern der Kreditrisikomodelle der Deutschen Bank durchSie sind verantwortlich für den Umfassenden Einsatz von Datenanalysen und statistischen Methoden (Klassifikation, Regression) zur Validierung von KreditrisikomodellenSie tragen zur stetigen Verbesserung und Weiterentwicklung der Validierungsmethoden, insbesondere unter Berücksichtigung von regulatorischen Anforderungen beiSie sichern die Einhaltung von Modell Risiko Management Anforderungen, wie z.B. „SR11-07“ ValidierungsstandardsFachliche und persönliche AnforderungenAkademische Ausbildung in einer quantitativen Disziplin (z.B. Finanzmathematik / Statistik etc.) mit AnwendungsfokusErfahrung in der Aufbereitung sowie deskriptiven und explorativen Analyse von Ausfall- und Verlustdaten sowie praktische Kenntnisse in der Modellierung oder Validierung von Kreditrisikoparametern (PD, LGD, CCF)Erste Berufserfahrung im Bereich Risk ManagementErfahrungen mit statistischer und anderer Software (SAS, Python)Konzeptuelle und analytische FähigkeitenVerhandlungssicheres Englisch in Wort und Schrift, Deutschkenntnisse sind von VorteilWas wir Ihnen bietenWir bieten eine breite Palette von Leistungen, die all Ihre beruflichen und persönlichen Bedürfnisse abdecken.Emotional ausgeglichenEine positive Haltung hilft uns, die Herausforderungen des Alltags zu meistern – beruflich wie privat. Profitieren Sie von Angeboten wie Beratung in schwierigen Lebenssituationen und Angeboten zur Förderung mentaler Gesundheit.Körperlich fitMit Angeboten zur Aufrechterhaltung Ihrer persönlichen Gesundheit und einem förderlichen beruflichen Umfeld hilft Ihnen die Bank, körperlich fit zu bleiben. Profitieren Sie von Angeboten wie umfangreichen Check-up Untersuchungen, Impfangeboten und Beratung zur gesunden Lebensführung.Sozial vernetztDer Austausch mit anderen eröffnet uns neue Perspektiven, bringt uns beruflich wie persönlich voran und stärkt unser Selbstvertrauen und Wohlbefinden. Profitieren Sie von Angeboten wie Unterstützung durch den pme Familienservice, das FitnessCenter Job, flexible Arbeitszeitmodelle (bspw. Teilzeit, Jobtandem, hybrides Arbeiten) sowie einer umfangreichen Kultur der Vielfalt, Chancengleichheit und Teilhabe.Finanziell abgesichertDie Bank sichert Sie nicht nur während Ihrer aktiven Karriere, sondern auch für die Zukunft finanziell ab und unterstützt Ihre Flexibilität sowie Mobilität – egal ob privat oder beruflich. Profitieren Sie von Angeboten wie Beitragsplänen für Altersvorsorge, Bankdienstleistungen für Mitarbeiter*innen, Firmenfahrrad oder dem Deutschlandticket.Da die Benefits je nach Standort geringfügig variieren, gehen Sie bitte bei konkreten Fragen auf Ihren Recruiter / Ihre Recruiterin zu.Die Stelle wird in Voll- und in Teilzeit angeboten.Bei Fragen zum Rekrutierungsprozess steht Ihnen Pierre Kujat gerne zur Verfügung.Kontakt Pierre Kujat: +49 (160) 5138 367**********************************************************************************Background information on RM and CFI Rating Methodologies:Model Risk Management is responsible for holistic management of model risk. This includes the independent validation of internal models as well as the identification and the monitoring & controlling of model risk.Within Model Risk Management, Credit Validation is responsible for the validation and model risk management of credit risk models of Deutsche Bank Group. This scope includes validation of rating methodologies and of according credit risk parameters.Your key responsibilitiesYou perform quantitative validation of rating methodologies and credit risk parameters of credit risk models of Deutsche BankYou make extensive use of sophisticated data analysis and statistical methods (classification, regression) for validation of credit risk modelsYou support the continuous improvement and enhancement of validation approaches, especially taking into account regulatory requirementsYou assure the compliance with Model Risk Management requirements, e.g. SR11-07 validation standardsYour skills and experiencesAcademic degree in a quantitative discipline (e.g. Mathematical Finance / Statistics) with a focus on applicationExperience in preparation as well as descriptive and explorative analysis of default and loss data as well as practical knowledge in the modeling of credit risk parameters (PD, LGD, CCF)Professional experience in financial risk management in generalKnowledge of statistical and other software packages (SAS, R, Python)Pronounced conceptual and analytical skillsBusiness fluent written and verbal skills in English, German language skills are beneficialWhat we offerWe provide you with a comprehensive portfolio of benefits and offerings to support both, your private and professional needs.Emotionally and mentally balancedA positive mind helps us master the challenges of everyday life – both professionally and privately. We offer consultation in difficult life situations as well as mental health awareness trainings.Physically thrivingWe support you in staying physically fit through an offering to maintain personal health and a professional environment. You can benefit from health check-ups; vaccination drives as well as advice on healthy living and nutrition.Socially connectedNetworking opens up new perspectives, helps us thrive professionally and personally as well as strengthens our self-confidence and well-being. You can benefit from PME family service, FitnessCenter Job, flexible working (e.g parttime, hybrid working, job tandem) as well as an extensive culture of diversity, equity and inclusion.Financially secureWe provide you with financial security not only during your active career but also for the future. You can benefit from offerings such as pension plans, banking services, company bicycle or “Deutschlandticket”.Since our offerings slightly vary across locations, please contact your recruiter with specific questions.This job is available in full and parttime.In case of any recruitment related questions, please get in touch with Pierre Kujat.Contact Pierre Kujat: +49 (160) 5138 367 Wir streben eine Unternehmenskultur an, in der wir gemeinsam jeden Tag das Beste geben. Dazu gehören verantwortungsvolles Handeln, wirtschaftliches Denken, Initiative ergreifen und zielgerichtete Zusammenarbeit.Gemeinsam teilen und feiern wir die Erfolge unserer Mitarbeiter*innen. Gemeinsam sind wir die Deutsche Bank Gruppe.Wir begrüßen Bewerbungen von allen Menschen und fördern ein positives, faires und integratives Arbeitsumfeld.",
    "requirements": [
      "preparation as well as descriptive and explorative analysis of default and loss data as well as practical knowledge in the modeling of credit risk parameters (PD",
      "financial risk management in generalKnowledge of statistical and other software packages (SAS"
    ],
    "location": {
      "city": "Frankfurt",
      "state": "Hessen",
      "country": "Deutschland",
      "remote_options": false
    },
    "employment_details": {
      "type": "Unbefristet",
      "schedule": "Vollzeit",
      "career_level": "Assistant Vice President",
      "salary_range": null,
      "benefits": []
    },
    "organization": {
      "name": "Deutsche Bank",
      "division": "Frankfurt",
      "division_id": 9
    },
    "posting_details": {
      "publication_date": "2025-07-07",
      "position_uri": "/index.php?ac=jobad&id=64981",
      "hiring_year": "2025"
    }
  },
  "evaluation_results": {
    "cv_to_role_match": null,
    "match_confidence": null,
    "evaluation_date": null,
    "evaluator": null,
    "domain_knowledge_assessment": null,
    "decision": {
      "apply": null,
      "rationale": null,
      "estimated_prep_time": null
    },
    "strengths": [],
    "weaknesses": []
  },
  "processing_log": [
    {
      "timestamp": "2025-07-10T11:42:56.664324",
      "action": "job_fetched",
      "processor": "enhanced_job_fetcher_v6.1",
      "status": "success",
      "details": "Successfully fetched job 64981 from Deutsche Bank API"
    },
    {
      "timestamp": "2025-07-10T11:42:56.664324",
      "action": "description_enriched",
      "processor": "web_scraper",
      "status": "success",
      "details": "Successfully fetched job description (7348 characters)"
    }
  ],
  "raw_source_data": {
    "api_response": {
      "MatchedObjectId": "64981",
      "MatchedObjectDescriptor": {
        "PositionOfferingType": [
          {
            "Name": "Unbefristet"
          }
        ],
        "PositionSchedule": [
          {
            "Name": "Vollzeit"
          }
        ],
        "PublicationChannel": [
          {
            "StartDate": "2025-07-07"
          }
        ],
        "PositionTitle": "Model Validation Senior Specialist (f/m/x)",
        "PositionLocation": [
          {
            "CityName": "Frankfurt",
            "CountrySubDivisionName": "Hessen",
            "CountryName": "Deutschland"
          }
        ],
        "PositionURI": "/index.php?ac=jobad&id=64981",
        "PositionID": "64981",
        "OrganizationName": "Frankfurt",
        "PositionHiringYear": "2025",
        "UserArea": {
          "ProDivision": 9
        },
        "CareerLevel": [
          {
            "Name": "Assistant Vice President"
          }
        ],
        "PublicationStartDate": "2025-07-07"
      },
      "RelevanceScore": 0,
      "RelevanceRank": 12
    },
    "specialist_analysis": {},
    "description_source": "web_scraping"
  }
}