{
  "job_metadata": {
    "job_id": "64978",
    "version": "1.0",
    "created_at": "2025-07-10T11:37:59.654914",
    "last_modified": "2025-07-10T11:37:59.654914",
    "source": "deutsche_bank_api",
    "processor": "enhanced_job_fetcher_v6.1",
    "status": "fetched"
  },
  "job_content": {
    "title": "Team Assistant – Investment Bank – Origination &amp; Advisory (d/m/w)",
    "description": "Team Assistant – Investment Bank – Origination & Advisory (d/m/w) Job ID:R0353388 Full/Part-Time: Full-time Regular/Temporary: Regular Listed: 2025-07-07 Location: Frankfurt Position Overview Über den BereichInvestment Bank - Origination & AdvisoryOrigination & Advisory ist bestrebt, langfristige, vertrauensvolle und für beide Seiten vorteilhafte Beziehungen zu den wichtigsten Unternehmen, Finanzinstituten, Finanzsponsoren und Staaten in aller Welt aufzubauen.Unsere Geschäftsbereiche: Investment Banking CoverageBietet die am besten geeigneten Produkte in den Bereichen Beratung, Kapitalmärkte, Risikomanagement und Transaktionsbanking sowohl für die C-Suite als auch für Treasurer an. Zu unseren Kunden zählen große Unternehmen, Finanzinstitute, Finanzsponsoren, Regierungen und Staaten in aller Welt. Unsere Branchenexpertise umfasst Verbraucher- und Einzelhandelsdienstleistungen, Finanzinstitutionen, Finanzsponsoren, Gesundheitswesen, Industrie, Technologie, Medien und Telekommunikation, natürliche Ressourcen sowie Immobilien, Hotels und Freizeit.DCM FremdkapitalmärkteVerwaltet Neuemissionen von Investment-Grade-Schuldtiteln, Kreditkapitalmärkten und Privatplatzierungen für Unternehmen, Finanzinstitute, Staaten, supranationale Organisationen, Agenturen und Emittenten aus Schwellenländern. Die Gruppe umfasst unsere Teams für Rating Advisory und Liability Management. ECM AktienkapitalmärkteBietet primäre Aktienprodukte wie IPOs, Folgeemissionen, Bezugsrechte, Block Trades, Wandel- und Umtauschanleihen sowie strukturierte Aktientransaktionen an. LDCM Leveraged Debt Capital MarketsKombiniert ein erstklassiges High-Yield-Marktgeschäft mit vielfältigen Möglichkeiten der Fremdfinanzierung. Die Bank ist in der Lage, Senior-, Mezzanine- und High-Yield-Transaktionen in allen wichtigen Finanzzentren zu bewerten, zu strukturieren, zu zeichnen und zu vertreiben. M&A Fusionen und ÜbernahmenDer Bereich Mergers & Acquisitions umfasst öffentliche Übernahmen, Beratung im Bereich Verteidigung, Fusionen und Veräußerungen, zweigleisige Börsengänge, Überprüfung von Unternehmensportfolios und Suche nach Übernahmen, Wettbewerbsstrategien und -analysen, Bilanzoptimierung, Dividendenpolitik und Corporate Governance.Ihre AufgabenUmfassende Team Assistenz für MDs/Ds in O&A und eine Gruppe von Junior BankernTerminkoordination bis hin zur kompletten Organisation von internen und externen Meetings/Events (national und international) sowie Video- und TelefonkonferenzenReiseplanung und -organisation sowie Erstellung und Prüfung von ReisekostenabrechnungenEigenverantwortliche Erledigung von klassischen Sekretariatsaufgaben, inklusive Vor- und Nachbereitung von MeetingsManagen bzw. vorsortieren der eingehenden Anfragen per Telefon und E-MailVertretung innerhalb des Teams/SekretariatsIhre Fähigkeiten und ErfahrungenFachliche Anforderungen:Sekretariatsausbildung oder eine vergleichbare, kaufmännische AusbildungFundierte Berufserfahrung als Assistenz, idealerweise auf Senior Management Ebene in einem internationalen UmfeldErfahrung im Umgang mit hochrangigen Persönlichkeiten und der VorstandsebeneGute Vernetzung innerhalb der Deutschen Bank, ergänzt um gute Kenntnisse der internen Strukturen und Abläufe von VorteilSehr gutes Organisationstalent, Flexibilität und die Bereitschaft, neue Aufgaben schnell anzunehmenUnterstützung des Teams durch ein effizientes Termin-, Reise- und DokumentenmanagementSicherstellung des reibungslosen Ablaufs der Geschäfts- und VerwaltungsprozesseKoordination und Planung von Meetings und GeschäftsreisenKorrespondenz und operative Koordination zwischen den Bereichen und Abteilungen, auch internationalÜbernahme organisatorischer TätigkeitenPersönliche Anforderungen:Freude an herausfordernden Situationen und die Fähigkeit, in diesen den Überblick zu behaltenFreundliches, souveränes und verbindliches Auftreten im Kontakt mit Kunden, Führungskräften, Mitarbeitern/-innen und AuftraggebernSchnelle Auffassungsgabe, selbständiges und strukturiertes ArbeitenHoher Grad an Begeisterung und EigeninitiativeAusgeprägte Kommunikations- und Teamfähigkeit und ServiceorientierungHohes Maß an Integrität sowie die Fähigkeit, diskret mit sensiblen Themen umzugehenGute Kenntnisse der MS Office Anwendungen (Word, Excel, PowerPoint) sowie idealerweise ergänzt um DB-spezifische Systeme, u.a. DB Concur oder dbBuyerSehr gute Deutsch- und Englischkenntnisse in Wort und SchriftWas wir Ihnen bietenWir bieten eine breite Palette von Leistungen, die all Ihre beruflichen und persönlichen Bedürfnisse abdecken.Emotional ausgeglichenEine positive Haltung hilft uns, die Herausforderungen des Alltags zu meistern – beruflich wie privat. Profitieren Sie von Angeboten wie Beratung in schwierigen Lebenssituationen und Angeboten zur Förderung mentaler Gesundheit.Körperlich fitMit Angeboten zur Aufrechterhaltung Ihrer persönlichen Gesundheit und einem förderlichen beruflichen Umfeld hilft Ihnen die Bank, körperlich fit zu bleiben. Profitieren Sie von Angeboten wie umfangreichen Check-up Untersuchungen, Impfangeboten und Beratung zur gesunden Lebensführung.Sozial vernetztDer Austausch mit anderen eröffnet uns neue Perspektiven, bringt uns beruflich wie persönlich voran und stärkt unser Selbstvertrauen und Wohlbefinden. Profitieren Sie von Angeboten wie Unterstützung durch den pme Familienservice, das FitnessCenter Job, flexible Arbeitszeitmodelle (bspw. Teilzeit, Jobtandem, hybrides Arbeiten) sowie einer umfangreichen Kultur der Vielfalt, Chancengleichheit und Teilhabe.Finanziell abgesichertDie Bank sichert Sie nicht nur während Ihrer aktiven Karriere, sondern auch für die Zukunft finanziell ab und unterstützt Ihre Flexibilität sowie Mobilität – egal ob privat oder beruflich. Profitieren Sie von Angeboten wie Beitragsplänen für Altersvorsorge, Bankdienstleistungen für Mitarbeiter*innen, Firmenfahrrad oder dem Deutschlandticket.Da die Benefits je nach Standort geringfügig variieren, gehen Sie bitte bei konkreten Fragen auf Ihren Recruiter/ Ihre Recruiterin zu.Die Stelle wird in Voll- und in Teilzeit angeboten.Bei Fragen zum Rekrutierungsprozess steht Ihnen Philipp Maass gerne zur Verfügung.Kontakt Philipp Maass: +49(69)910-48515 Wir streben eine Unternehmenskultur an, in der wir gemeinsam jeden Tag das Beste geben. Dazu gehören verantwortungsvolles Handeln, wirtschaftliches Denken, Initiative ergreifen und zielgerichtete Zusammenarbeit.Gemeinsam teilen und feiern wir die Erfolge unserer Mitarbeiter*innen. Gemeinsam sind wir die Deutsche Bank Gruppe.Wir begrüßen Bewerbungen von allen Menschen und fördern ein positives, faires und integratives Arbeitsumfeld.",
    "requirements": [],
    "location": {
      "city": "Frankfurt",
      "state": "Hessen",
      "country": "Deutschland",
      "remote_options": false
    },
    "employment_details": {
      "type": "Unbefristet",
      "schedule": "Vollzeit",
      "career_level": "kein Corporate Title",
      "salary_range": null,
      "benefits": []
    },
    "organization": {
      "name": "Deutsche Bank",
      "division": "Frankfurt",
      "division_id": 2
    },
    "posting_details": {
      "publication_date": "2025-07-07",
      "position_uri": "/index.php?ac=jobad&id=64978",
      "hiring_year": "2025"
    }
  },
  "evaluation_results": {
    "cv_to_role_match": null,
    "match_confidence": null,
    "evaluation_date": null,
    "evaluator": null,
    "domain_knowledge_assessment": null,
    "decision": {
      "apply": null,
      "rationale": null,
      "estimated_prep_time": null
    },
    "strengths": [],
    "weaknesses": []
  },
  "processing_log": [
    {
      "timestamp": "2025-07-10T11:37:59.654914",
      "action": "job_fetched",
      "processor": "enhanced_job_fetcher_v6.1",
      "status": "success",
      "details": "Successfully fetched job 64978 from Deutsche Bank API"
    },
    {
      "timestamp": "2025-07-10T11:37:59.654914",
      "action": "description_enriched",
      "processor": "web_scraper",
      "status": "success",
      "details": "Successfully fetched job description (6620 characters)"
    }
  ],
  "raw_source_data": {
    "api_response": {
      "MatchedObjectId": "64978",
      "MatchedObjectDescriptor": {
        "PositionOfferingType": [
          {
            "Name": "Unbefristet"
          }
        ],
        "PositionSchedule": [
          {
            "Name": "Vollzeit"
          }
        ],
        "PublicationChannel": [
          {
            "StartDate": "2025-07-07"
          }
        ],
        "PositionTitle": "Team Assistant – Investment Bank – Origination &amp; Advisory (d/m/w)",
        "PositionLocation": [
          {
            "CityName": "Frankfurt",
            "CountrySubDivisionName": "Hessen",
            "CountryName": "Deutschland"
          }
        ],
        "PositionURI": "/index.php?ac=jobad&id=64978",
        "PositionID": "64978",
        "OrganizationName": "Frankfurt",
        "PositionHiringYear": "2025",
        "UserArea": {
          "ProDivision": 2
        },
        "CareerLevel": [
          {
            "Name": "kein Corporate Title"
          }
        ],
        "PublicationStartDate": "2025-07-07"
      },
      "RelevanceScore": 0,
      "RelevanceRank": 8
    },
    "specialist_analysis": {},
    "description_source": "web_scraping"
  }
}