{
  "job_metadata": {
    "job_id": "64976",
    "version": "1.0",
    "created_at": "2025-07-10T11:38:01.831980",
    "last_modified": "2025-07-10T11:38:01.831980",
    "source": "deutsche_bank_api",
    "processor": "enhanced_job_fetcher_v6.1",
    "status": "fetched"
  },
  "job_content": {
    "title": "Lead Engineer (d/m/w) – Bare Metal as-a-Service (BMaaS)",
    "description": "Lead Engineer (d/m/w) – Bare Metal as-a-Service (BMaaS) Job ID:R0389237 Full/Part-Time: Full-time Regular/Temporary: Regular Listed: 2025-07-07 Location: Frankfurt Position Overview Über den BereichDeutsche Bank AG - TDI (Technology, Data and Innovation) Technologie spielt eine entscheidende Rolle bei der Transformation der Deutschen Bank. Um sicherzustellen, dass wir Technologie und digitale Lösungen in der gesamten Bank wesentlich umfassender einsetzen werden, wurde Technology, Data and Innovation (TDI) als die Technologieabteilung etabliert, welche eine globale, integrierte IT-, Daten- und Sicherheitsagenda vorantreibt. Die Funktion ist verantwortlich für die Umsetzung der Technologiestrategie der Bank, die sich auf die Stärkung des Engineering-Know-hows, die Einführung eines agilen Bereitstellungsmodells, die Reduzierung des Verwaltungsaufwands, die Entkopplung von Vermögenswerten innerhalb unseres IT-Bestands für eine schnellere und kostengünstigere Bereitstellung sowie die Modernisierung der IT-Infrastruktur der Bank mit langfristigen Investitionen und die Nutzung von Cloud Computing konzentriert.Ihre AufgabenAls Mitglied/Lead eines interdisziplinären, globalen Teams von Expert*innen entwickeln Sie Lösungen für BMaaS und VMaaS (Virtual Machine as-a-Service) und nutzen dafür Software Produkte vom Markt und/oder selbst entwickelte SW LösungenSie arbeiten teamübergreifend mit Kolleg*innen aus den Bereichen Architektur, Produktmanagement, Infrastruktur, Transformation und DevOps, um diese Lösungen zu entwickeln und intern bereitzustellenFür die Lösungen, welche Sie entwickeln, analysieren Sie dabei die vorhandenen Integrationen in unsere IT Management Systeme für Configuration, Change, Incident und Security Management und arbeiten dabei eng mit SW Herstellern zusammen; Sie achten dabei insbesondere auf Benutzerfreundlichkeit und die Möglichkeit, Ihre Lösungen auch programmatisch (API) zu benutzenSie entwickeln Lösungen, welche sich nahtlos in andere Plattformen wie „Cloud Management“ integrieren und setzen dabei zielsicher Branchenstandards wie TFE von Hashicorp oder Ansible einÜber DevOps Automatisierung und Dokumentation stellen Sie sicher, dass Ihre Lösungen vollautomatisiert konsumierbar sindIhre Fähigkeiten und ErfahrungenAbgeschlossenes Studium im Bereich Informatik oder vergleichbare ErfahrungSehr gute Erfahrung als SW Entwickler*in in Python und mit YAML/HCL und Git/GithubGutes Verständnis/Erfahrung mit Bare Metal Konzepten und AutomatisierungGutes Verständnis von Netzwerk Virtualisierung (SDN Software Defined Networks & Overlays)Erfahrung mit Terraform und TFE Provider IntegrationErfahrung mit Hyperscaler/Compute Angeboten, vorzugsweise Google Cloud PlatformGutes Verständnis von Server Virtualisierungstechnologien, vorzugsweise VMware Was wir Ihnen bietenWir bieten eine breite Palette von Leistungen, die all Ihre beruflichen und persönlichen Bedürfnisse abdecken.Emotional ausgeglichenEine positive Haltung hilft uns, die Herausforderungen des Alltags zu meistern – beruflich wie privat. Profitieren Sie von Angeboten wie Beratung in schwierigen Lebenssituationen und Angeboten zur Förderung mentaler Gesundheit.Körperlich fitMit Angeboten zur Aufrechterhaltung Ihrer persönlichen Gesundheit und einem förderlichen beruflichen Umfeld hilft Ihnen die Bank, körperlich fit zu bleiben. Profitieren Sie von Angeboten wie umfangreichen Check-up Untersuchungen, Impfangeboten und Beratung zur gesunden Lebensführung.Sozial vernetztDer Austausch mit anderen eröffnet uns neue Perspektiven, bringt uns beruflich wie persönlich voran und stärkt unser Selbstvertrauen und Wohlbefinden. Profitieren Sie von Angeboten wie Unterstützung durch den pme Familienservice, das FitnessCenter Job, flexible Arbeitszeitmodelle (bspw. Teilzeit, Jobtandem, hybrides Arbeiten) sowie einer umfangreichen Kultur der Vielfalt, Chancengleichheit und Teilhabe.Finanziell abgesichertDie Bank sichert Sie nicht nur während Ihrer aktiven Karriere, sondern auch für die Zukunft finanziell ab und unterstützt Ihre Flexibilität sowie Mobilität – egal ob privat oder beruflich. Profitieren Sie von Angeboten wie Beitragsplänen für Altersvorsorge, Bankdienstleistungen für Mitarbeiter*innen, Firmenfahrrad oder dem Deutschlandticket.Da die Benefits je nach Standort geringfügig variieren, gehen Sie bitte bei konkreten Fragen auf Ihren Recruiter / Ihre Recruiterin zu.Die Stelle wird in Voll- und in Teilzeit angeboten.Bei Fragen zum Rekrutierungsprozess steht Ihnen Michaela Peschke gerne zur Verfügung.Kontakt Michaela Peschke: 069-910-43951 Wir streben eine Unternehmenskultur an, in der wir gemeinsam jeden Tag das Beste geben. Dazu gehören verantwortungsvolles Handeln, wirtschaftliches Denken, Initiative ergreifen und zielgerichtete Zusammenarbeit.Gemeinsam teilen und feiern wir die Erfolge unserer Mitarbeiter*innen. Gemeinsam sind wir die Deutsche Bank Gruppe.Wir begrüßen Bewerbungen von allen Menschen und fördern ein positives, faires und integratives Arbeitsumfeld.",
    "requirements": [],
    "location": {
      "city": "Frankfurt",
      "state": "Hessen",
      "country": "Deutschland",
      "remote_options": false
    },
    "employment_details": {
      "type": "Unbefristet",
      "schedule": "Vollzeit",
      "career_level": "Vice President",
      "salary_range": null,
      "benefits": []
    },
    "organization": {
      "name": "Deutsche Bank",
      "division": "Frankfurt",
      "division_id": 10052
    },
    "posting_details": {
      "publication_date": "2025-07-07",
      "position_uri": "/index.php?ac=jobad&id=64976",
      "hiring_year": "2025"
    }
  },
  "evaluation_results": {
    "cv_to_role_match": null,
    "match_confidence": null,
    "evaluation_date": null,
    "evaluator": null,
    "domain_knowledge_assessment": null,
    "decision": {
      "apply": null,
      "rationale": null,
      "estimated_prep_time": null
    },
    "strengths": [],
    "weaknesses": []
  },
  "processing_log": [
    {
      "timestamp": "2025-07-10T11:38:01.831980",
      "action": "job_fetched",
      "processor": "enhanced_job_fetcher_v6.1",
      "status": "success",
      "details": "Successfully fetched job 64976 from Deutsche Bank API"
    },
    {
      "timestamp": "2025-07-10T11:38:01.831980",
      "action": "description_enriched",
      "processor": "web_scraper",
      "status": "success",
      "details": "Successfully fetched job description (5005 characters)"
    }
  ],
  "raw_source_data": {
    "api_response": {
      "MatchedObjectId": "64976",
      "MatchedObjectDescriptor": {
        "PositionOfferingType": [
          {
            "Name": "Unbefristet"
          }
        ],
        "PositionSchedule": [
          {
            "Name": "Vollzeit"
          }
        ],
        "PublicationChannel": [
          {
            "StartDate": "2025-07-07"
          }
        ],
        "PositionTitle": "Lead Engineer (d/m/w) – Bare Metal as-a-Service (BMaaS)",
        "PositionLocation": [
          {
            "CityName": "Frankfurt",
            "CountrySubDivisionName": "Hessen",
            "CountryName": "Deutschland"
          }
        ],
        "PositionURI": "/index.php?ac=jobad&id=64976",
        "PositionID": "64976",
        "OrganizationName": "Frankfurt",
        "PositionHiringYear": "2025",
        "UserArea": {
          "ProDivision": 10052
        },
        "CareerLevel": [
          {
            "Name": "Vice President"
          }
        ],
        "PublicationStartDate": "2025-07-07"
      },
      "RelevanceScore": 0,
      "RelevanceRank": 11
    },
    "specialist_analysis": {},
    "description_source": "web_scraping"
  }
}