{
  "job_metadata": {
    "job_id": "65054",
    "version": "1.0",
    "created_at": "2025-07-10T11:36:20.056945",
    "last_modified": "2025-07-10T11:36:20.056945",
    "source": "deutsche_bank_api",
    "processor": "enhanced_job_fetcher_v6.1",
    "status": "fetched"
  },
  "job_content": {
    "title": "Sustainability Data Analyst im Chief Sustainability Office (f/m/x)",
    "description": "Sustainability Data Analyst im Chief Sustainability Office (f/m/x) Job ID:R0393771 Full/Part-Time: Full-time Regular/Temporary: Regular Listed: 2025-07-08 Location: Frankfurt Position Overview *English version below*Über den BereichDas Chief Sustainability Office ist dafür verantwortlich, die Nachhaltigkeitsstrategie der Bank zu entwickeln und ihre Umsetzung über alle Geschäftsbereiche, Infrastruktureinheiten und Regionen hinweg voranzutreiben. Ihre Hauptaufgaben sind, den Strategierahmen zu definieren, die nachhaltigen Finanzaktivitäten der Bank zu koordinieren, die ESG-Standards festzulegen sowie die regulatorischen und Offenlegungspflichten zu überwachen. Es besteht aus den vier Teams “Strategy & Regional Governance”, “Execution, Data & Regulatory”, “Group Sustainability” and “ESG Transparency”.Strategie & Regionale Governance entwickelt und koordiniert die Nachhaltigkeitsstrategie und -Governance des Konzerns sowie unterstützt die Geschäftsbereiche und bereichsübergreifende Geschäftsopportunitäten und koordiniert die Planung der Sustainable Finance Ziele.Execution, Data & Regulatory verantwortet die Umsetzung der strategischen Nachhaltigkeitsziele der Bank über das Sustainability Key Deliverable (KD) und deckt auch die zentral gesteuerten nicht KD-Umsetzungsprojekte mit ESG-Nexus ab. Zudem identifiziert und bewertet es ESG-bezogene Vorschriften und unterstützt Geschäftsbereiche und Funktionen bei der Umsetzung, arbeitet mit externen Stakeholdern bei regulatorischen ESG-Aufgaben zusammen und verknüpft Technologie, Daten und Innovation zu nachhaltigkeitsbezogenen Daten.Group Sustainability ist zuständig für die Etablierung bankweiter Standards und Prozesse für ökologische und soziale Nachhaltigkeit, einschließlich der Menschenrechte, überwacht die Einhaltung der Standards, einschließlich der verbesserten ökologischen und sozialen Sorgfaltspflicht (ES) sowie der Klassifizierung nachhaltiger Finanzen.ESG Transparency trägt maßgeblich dazu bei, die Transparenz zur Nachhaltigkeitsagenda und – Leistung der Bank sowie den Dialog mit wichtigen Stakeholder-Gruppen zu verbessern. Es entwickelt und implementiert den Ansatz der Deutschen Bank zur Bewertung der Wesentlichkeit von Nachhaltigkeitsthemen und koordiniert wesentliche ESG-Rating-Anfragen.Deine AufgabenDu unterstützt internationale Projekte an der Schnittstelle zwischen CSO und TDI in enger Zusammenarbeit mit Geschäfts- und Infrastrukturfunktionen.Du arbeitest eng mit der Leitung des Sustainability Data and Technology Programme, den Umsetzungsteams und Stakeholdern zusammen, um Fortschritte zu verstehen, Projektblockaden zu lösen, sicherzustellen, dass Pläne der Realität entsprechen, und die finanzielle, personelle und Investitionssteuerung des Workstreams zu kontrollieren.Du managst aktiv Risiken, Probleme und Abhängigkeiten mit anderen Funktionen und Initiativen innerhalb der Bank gemäß den Governance-Standards der Bank.Du arbeitest mit verschiedenen Bereichen der Bank zusammen, von Geschäfts- bis Infrastrukturfunktionen, und interagierst mit unterschiedlichen Hierarchieebenen intern und extern.Deine Fähigkeiten und ErfahrungenDu hast ein abgeschlossenes Hochschulstudium mit einem Masterabschluss mit Schwerpunkt auf Wirtschaft und/oder Technologie.Du verfügst über umfassende Projektmanagement-Erfahrung, einschließlich der Leitung internationaler Projekte mit mehreren Lieferobjekten.Du hast nachweisliche Erfahrung in der Optimierung und Implementierung von Prozessen, idealerweise einschließlich Kontrollen.Du lieferst auch unter Zeitdruck qualitativ hochwertige Ergebnisse, kombiniert mit starken analytischen, konzeptionellen Problemlösungsfähigkeiten und exzellenten Konfliktlösungsfähigkeiten.Du bist in der Lage, mehrere Aufgaben gleichzeitig zu managen, die Lieferung entsprechend zu priorisieren und effektiv mit Stakeholdern zu verhandeln.Du hast ein starkes Interesse an ESG/Nachhaltigkeit, vorzugsweise belegt durch entsprechende Berufserfahrung.Du beherrschst Englisch und Deutsch fließend.Was wir Ihnen bietenWir bieten eine breite Palette von Leistungen, die all Ihre beruflichen und persönlichen Bedürfnisse abdecken.Emotional ausgeglichenEine positive Haltung hilft uns, die Herausforderungen des Alltags zu meistern – beruflich wie privat. Profitieren Sie von Angeboten wie Beratung in schwierigen Lebenssituationen und Angeboten zur Förderung mentaler Gesundheit.Körperlich fitMit Angeboten zur Aufrechterhaltung Ihrer persönlichen Gesundheit und einem förderlichen beruflichen Umfeld hilft Ihnen die Bank, körperlich fit zu bleiben. Profitieren Sie von Angeboten wie umfangreichen Check-up Untersuchungen, Impfangeboten und Beratung zur gesunden Lebensführung.Sozial vernetztDer Austausch mit anderen eröffnet uns neue Perspektiven, bringt uns beruflich wie persönlich voran und stärkt unser Selbstvertrauen und Wohlbefinden. Profitieren Sie von Angeboten wie Unterstützung durch den pme Familienservice, das FitnessCenter Job, flexible Arbeitszeitmodelle (bspw. Teilzeit, Jobtandem, hybrides Arbeiten) sowie einer umfangreichen Kultur der Vielfalt, Chancengleichheit und Teilhabe.Finanziell abgesichertDie Bank sichert Sie nicht nur während Ihrer aktiven Karriere, sondern auch für die Zukunft finanziell ab und unterstützt Ihre Flexibilität sowie Mobilität – egal ob privat oder beruflich. Profitieren Sie von Angeboten wie Beitragsplänen für Altersvorsorge, Bankdienstleistungen für Mitarbeiter*innen, Firmenfahrrad oder dem Deutschlandticket.Da die Benefits je nach Standort geringfügig variieren, gehen Sie bitte bei konkreten Fragen auf Ihre Recruiter / Ihre Recruiterin zu.Die Stelle wird in Voll- und in Teilzeit angeboten.Bei Fragen zum Rekrutierungsprozess steht Ihnen Stefanie Schumann gerne zur Verfügung.Kontakt Stefanie Schumann: +49(69)910-42578--------------------------------------------------------------------------------------------------------------------------------Details of the role and how it fits into the teamThe Chief Sustainability Office is responsible for developing Deutsche Bank’s sustainability strategy and driving its implementation across all business divisions, infrastructure functions, and regions. Its core responsibilities include defining the strategic framework, coordinating the Bank’s sustainable finance activities, setting ESG standards, and overseeing regulatory and disclosure obligations. It The Chief Sustainability Office comprises four teams: Strategy & Regional Governance, Execution, Data & Regulatory, Group Sustainability, and ESG Transparency.Strategy & Regional Governance develops and coordinates the Group’s sustainability strategy and governance. It supports the business divisions and cross-divisional business opportunities and coordinates the planning of the Bank’s Sustainable Finance targets.Execution, Data & Regulatory is responsible for implementing the Bank’s strategic sustainability objectives through the Sustainability Key Deliverable (KD) and also covers centrally managed non-KD implementation projects with an ESG nexus. In addition, it identifies and assesses ESG-related regulations, supports business divisions and functions in their implementation, collaborates with external stakeholders on regulatory ESG matters, and integrates technology, data, and innovation into sustainability-related data.Group Sustainability is tasked with establishing bank-wide standards and processes for environmental and social sustainability, including human rights. It controls and oversees the adherence to these standards, including enhanced environmental and social due diligence (ES), and oversees the classification of sustainable finance.ESG Transparency plays a key role in enhancing transparency regarding the Bank’s sustainability agenda and performance, as well as in fostering dialogue with key stakeholder groups. It develops and implements Deutsche Bank’s approach to assessing the materiality of sustainability topics at a strategic level (Double Materiality) and coordinates responses to key ESG rating requests.ESG is a key element of the strategic priorities of the group-wide transformational strategy of Deutsche Bank. We are investing in the platforms, data and technology that will ensure we meet our ESG reporting requirements, and help our clients manage their Sustainability goals and transition to a Net Zero Carbon economy. The Chief Sustainability Office is partnering with Sustainability Technology to drive the Sustainability Data and Technology Programme. This is an outstanding opportunity for a Project Management professional to drive projects at the interface between the Chief Sustainability Office and TDI, incl. driving the development of the ESG Data workstream within the Sustainability Strategy KD and gain knowledge and experience in the fast-growing ESG market.Your key responsibilitiesYou support international projects at the interface between CSO and TDI in close cooperation with business and infrastructure functionsYou work closely with the Sustainability Data and Technology Programme lead, delivery teams and stakeholders to understand progress, resolve project blockers, ensure plans reflect reality, and to control the financial, resourcing and investment governance of the workstream.You actively manage risks, issues and dependencies with other functions and initiatives in the bank in line with bank governance standards.You will deal with various areas of the bank, ranging from business to infrastructure functions and interact with different levels of seniority, internally and externallyYour skills and experiencesYou are a University graduates with a Master’s degree focusing on business and/or technology;You have strong project management experience including experience in managing international projects with multiple deliveriesYou have proven experience in optimizing and implementing processes, ideally including controlsYou are able to deliver quality even under time pressure, combined with strong analytical, conceptual problem-solving skills and excellent conflict resolution skills.You are able to manage multiple pieces of work, prioritise delivery as necessary & negotiate effectively with stakeholdersYou have a strong interest in ESG / sustainability an advantage, preferably proven by respective working experienceYou are fluent in English and GermanWhat we offerWe provide you with a comprehensive portfolio of benefits and offerings to support both, your private and professional needs.Emotionally and mentally balancedA positive mind helps us master the challenges of everyday life – both professionally and privately. We offer consultation in difficult life situations as well as mental health awareness trainings.Physically thrivingWe support you in staying physically fit through an offering to maintain personal health and a professional environment. You can benefit from health check-ups; vaccination drives as well as advice on healthy living and nutrition.Socially connectedNetworking opens up new perspectives, helps us thrive professionally and personally as well as strengthens our self-confidence and well-being. You can benefit from PME family service, FitnessCenter Job, flexible working (e.g parttime, hybrid working, job tandem) as well as an extensive culture of diversity, equity and inclusion.Financially secureWe provide you with financial security not only during your active career but also for the future. You can benefit from offerings such as pension plans, banking services, company bicycle or “Deutschlandticket”.Since our offerings slightly vary across locations, please contact your recruiter with specific questions.This job is available in full and parttime.In case of any recruitment related questions, please get in touch with Stefanie Schumann.Contact Stefanie Schumann: +49(69)910-42578 Wir streben eine Unternehmenskultur an, in der wir gemeinsam jeden Tag das Beste geben. Dazu gehören verantwortungsvolles Handeln, wirtschaftliches Denken, Initiative ergreifen und zielgerichtete Zusammenarbeit.Gemeinsam teilen und feiern wir die Erfolge unserer Mitarbeiter*innen. Gemeinsam sind wir die Deutsche Bank Gruppe.Wir begrüßen Bewerbungen von allen Menschen und fördern ein positives, faires und integratives Arbeitsumfeld.",
    "requirements": [
      "managing international projects with multiple deliveriesYou have proven experience in optimizing and implementing processes",
      "the fast-growing ESG market.Your key responsibilitiesYou support international projects at the interface between CSO and TDI in close cooperation with business and infrastructure functionsYou work closely with the Sustainability Data and Technology Programme lead"
    ],
    "location": {
      "city": "Frankfurt",
      "state": "Hessen",
      "country": "Deutschland",
      "remote_options": false
    },
    "employment_details": {
      "type": "Unbefristet",
      "schedule": "Vollzeit",
      "career_level": "kein Corporate Title",
      "salary_range": null,
      "benefits": []
    },
    "organization": {
      "name": "Deutsche Bank",
      "division": "Frankfurt",
      "division_id": 14
    },
    "posting_details": {
      "publication_date": "2025-07-08",
      "position_uri": "/index.php?ac=jobad&id=65054",
      "hiring_year": "2025"
    }
  },
  "evaluation_results": {
    "cv_to_role_match": null,
    "match_confidence": null,
    "evaluation_date": null,
    "evaluator": null,
    "domain_knowledge_assessment": null,
    "decision": {
      "apply": null,
      "rationale": null,
      "estimated_prep_time": null
    },
    "strengths": [],
    "weaknesses": []
  },
  "processing_log": [
    {
      "timestamp": "2025-07-10T11:36:20.056945",
      "action": "job_fetched",
      "processor": "enhanced_job_fetcher_v6.1",
      "status": "success",
      "details": "Successfully fetched job 65054 from Deutsche Bank API"
    },
    {
      "timestamp": "2025-07-10T11:36:20.056945",
      "action": "description_enriched",
      "processor": "web_scraper",
      "status": "success",
      "details": "Successfully fetched job description (12234 characters)"
    }
  ],
  "raw_source_data": {
    "api_response": {
      "MatchedObjectId": "65054",
      "MatchedObjectDescriptor": {
        "PositionOfferingType": [
          {
            "Name": "Unbefristet"
          }
        ],
        "PositionSchedule": [
          {
            "Name": "Vollzeit"
          }
        ],
        "PublicationChannel": [
          {
            "StartDate": "2025-07-08"
          }
        ],
        "PositionTitle": "Sustainability Data Analyst im Chief Sustainability Office (f/m/x)",
        "PositionLocation": [
          {
            "CityName": "Frankfurt",
            "CountrySubDivisionName": "Hessen",
            "CountryName": "Deutschland"
          }
        ],
        "PositionURI": "/index.php?ac=jobad&id=65054",
        "PositionID": "65054",
        "OrganizationName": "Frankfurt",
        "PositionHiringYear": "2025",
        "UserArea": {
          "ProDivision": 14
        },
        "CareerLevel": [
          {
            "Name": "kein Corporate Title"
          }
        ],
        "PublicationStartDate": "2025-07-08"
      },
      "RelevanceScore": 0,
      "RelevanceRank": 4
    },
    "specialist_analysis": {},
    "description_source": "web_scraping"
  }
}