{
  "job_metadata": {
    "job_id": "64045",
    "version": "1.0",
    "created_at": "2025-07-10T12:00:33.649553",
    "last_modified": "2025-07-10T12:00:33.649553",
    "source": "deutsche_bank_api",
    "processor": "enhanced_job_fetcher_v6.1",
    "status": "fetched"
  },
  "job_content": {
    "title": "Audit Manager (d/m/w)",
    "description": "Audit Manager (d/m/w) Job ID:R0380962 Full/Part-Time: Full-time Regular/Temporary: Regular Listed: 2025-06-06 Location: Frankfurt Position Overview Über den BereichIm Bereich Chief Security Office (CSO) sucht die Deutsche Bank eine/n Audit Specialist*in für das Endpoint Security Team. In dieser Rolle sind Sie für die Koordination zentraler Antworten auf alle Arten von Sicherheitsüberwachungsthemen verantwortlich und tragen kontinuierlich dazu bei, Verbesserungen für Prüfungspraktiken zu fördern, die die Gesamtintegrität sicherstellen.Ihre Rolle konzentriert sich auf die Koordination und Bereitstellung von Lösungen als Reaktion auf Audit-Ergebnisse. Durch die koordinierte Reaktion von Ingenieuren, Architekten und Bereichsleitern tragen Sie dazu bei, ein Umfeld technologischer Lösungen zu schaffen, das den aktuellen Vorschriften und Richtlinien entspricht und die hohen Standards der Deutschen Bank für die Einhaltung von Audit- und Regulierungsvorschriften aufrechterhält.Dies ist eine globale Rolle, die Teil eines breiteren Teams ist und die Zusammenarbeit mit mehreren Engineering- und Architekturteams umfasst. Unser Ansatz folgt einer zeitnahen Behebung aller offenen Punkte und der Implementierung branchenführender Standards für Prozesskontrollen und -verfahren, um zukünftige Audit-Ergebnisse in unserer Anwendungslandschaft zu vermeiden.Ihre AufgabenProaktive Koordination aller Aspekte des Endpoint Security Teams; Durchführung und Unterstützung der End-to-End-Bereitstellung sowie Erstellung einer qualitativ hochwertigen Validierung von Audit- und behördlichen LeistungenUnterstützung bei Festlegung der Teambeteiligung und individuellen Verantwortlichkeiten für jede Auditvalidierung.Durch die Überprüfung und Bereitstellung von Expertenmeinungen zu den von Kunden bereitgestellten Aktionsplänen helfen Sie dabei, die Wirksamkeit der Kontrollen zum Zeitpunkt der Problembehebungsvalidierung umfassend und angemessen zu dokumentierenDokumentation von Workflows, Fortschrittsverfolgung, Prozesskontrollen und Checklisten zum Schutz vor wiederholten Verstößen gegen unsere Engineering-LeistungenUnterstützung und Kommunikation der Auditpläne und Werte der Bank innerhalb des Teams sowie Sicherstellen des Verständnisses und der Ausrichtung.Sie unterstützen ein Umfeld, in dem Personalführung und -entwicklung oberste Priorität haben und in dem Sie Ihr Engagement für Ihr unmittelbares und das erweiterte Funktionsteam persönlich unter Beweis stellenIhre Fähigkeiten und ErfahrungenBachelor- oder gleichwertiger Abschluss erforderlich; weiterführende Abschlüsse und einschlägige berufliche Zertifizierungen bevorzugt, aber nicht erforderlichUmfangreiche und fundierte Kenntnisse über Risiken, Kontrollen und damit verbundene regulatorische EntwicklungenUmfassende Auditerfahrung innerhalb der internen Revision und/oder der Finanzdienstleistungsbranche im weiteren SinneSehr gute Kenntnisse im Hinblick auf Management und Planung, mit der Fähigkeit, Veränderungen positiv voranzutreibenSehr gute Deutsch- und Englischkenntnisse (in Wort und Schrift)Was wir Ihnen bietenWir bieten eine breite Palette von Leistungen, die all Ihre beruflichen und persönlichen Bedürfnisse abdecken.Emotional ausgeglichenEine positive Haltung hilft uns, die Herausforderungen des Alltags zu meistern – beruflich wie privat. Profitieren Sie von Angeboten wie Beratung in schwierigen Lebenssituationen und Angeboten zur Förderung mentaler Gesundheit.Körperlich fitMit Angeboten zur Aufrechterhaltung Ihrer persönlichen Gesundheit und einem förderlichen beruflichen Umfeld hilft Ihnen die Bank, körperlich fit zu bleiben. Profitieren Sie von Angeboten wie umfangreichen Check-up Untersuchungen, Impfangeboten und Beratung zur gesunden Lebensführung.Sozial vernetztDer Austausch mit anderen eröffnet uns neue Perspektiven, bringt uns beruflich wie persönlich voran und stärkt unser Selbstvertrauen und Wohlbefinden. Profitieren Sie von Angeboten wie Unterstützung durch den pme Familienservice, das FitnessCenter Job, flexible Arbeitszeitmodelle (bspw. Teilzeit, Jobtandem, hybrides Arbeiten) sowie einer umfangreichen Kultur der Vielfalt, Chancengleichheit und Teilhabe.Finanziell abgesichertDie Bank sichert Sie nicht nur während Ihrer aktiven Karriere, sondern auch für die Zukunft finanziell ab und unterstützt Ihre Flexibilität sowie Mobilität – egal ob privat oder beruflich. Profitieren Sie von Angeboten wie Beitragsplänen für Altersvorsorge, Bankdienstleistungen für Mitarbeiter*innen, Firmenfahrrad oder dem Deutschlandticket.Da die Benefits je nach Standort geringfügig variieren, gehen Sie bitte bei konkreten Fragen auf Ihren Recruiter/ Ihre Recruiterin zu.Die Stelle wird in Voll- und in Teilzeit angeboten.Bei Fragen zum Rekrutierungsprozess steht Ihnen Michaela Peschke gerne zur Verfügung.Kontakt Michaela Peschke: 069-910-43951 Wir streben eine Unternehmenskultur an, in der wir gemeinsam jeden Tag das Beste geben. Dazu gehören verantwortungsvolles Handeln, wirtschaftliches Denken, Initiative ergreifen und zielgerichtete Zusammenarbeit.Gemeinsam teilen und feiern wir die Erfolge unserer Mitarbeiter*innen. Gemeinsam sind wir die Deutsche Bank Gruppe.Wir begrüßen Bewerbungen von allen Menschen und fördern ein positives, faires und integratives Arbeitsumfeld.",
    "requirements": [],
    "location": {
      "city": "Frankfurt",
      "state": "Hessen",
      "country": "Deutschland",
      "remote_options": false
    },
    "employment_details": {
      "type": "Unbefristet",
      "schedule": "Vollzeit",
      "career_level": "Assistant Vice President",
      "salary_range": null,
      "benefits": []
    },
    "organization": {
      "name": "Deutsche Bank",
      "division": "Frankfurt",
      "division_id": 10052
    },
    "posting_details": {
      "publication_date": "2025-06-06",
      "position_uri": "/index.php?ac=jobad&id=64045",
      "hiring_year": "2025"
    }
  },
  "evaluation_results": {
    "cv_to_role_match": null,
    "match_confidence": null,
    "evaluation_date": null,
    "evaluator": null,
    "domain_knowledge_assessment": null,
    "decision": {
      "apply": null,
      "rationale": null,
      "estimated_prep_time": null
    },
    "strengths": [],
    "weaknesses": []
  },
  "processing_log": [
    {
      "timestamp": "2025-07-10T12:00:33.649553",
      "action": "job_fetched",
      "processor": "enhanced_job_fetcher_v6.1",
      "status": "success",
      "details": "Successfully fetched job 64045 from Deutsche Bank API"
    },
    {
      "timestamp": "2025-07-10T12:00:33.649553",
      "action": "description_enriched",
      "processor": "web_scraper",
      "status": "success",
      "details": "Successfully fetched job description (5277 characters)"
    }
  ],
  "raw_source_data": {
    "api_response": {
      "MatchedObjectId": "64045",
      "MatchedObjectDescriptor": {
        "PositionOfferingType": [
          {
            "Name": "Unbefristet"
          }
        ],
        "PositionSchedule": [
          {
            "Name": "Vollzeit"
          }
        ],
        "PublicationChannel": [
          {
            "StartDate": "2025-06-06"
          }
        ],
        "PositionTitle": "Audit Manager (d/m/w)",
        "PositionLocation": [
          {
            "CityName": "Frankfurt",
            "CountrySubDivisionName": "Hessen",
            "CountryName": "Deutschland"
          }
        ],
        "PositionURI": "/index.php?ac=jobad&id=64045",
        "PositionID": "64045",
        "OrganizationName": "Frankfurt",
        "PositionHiringYear": "2025",
        "UserArea": {
          "ProDivision": 10052
        },
        "CareerLevel": [
          {
            "Name": "Assistant Vice President"
          }
        ],
        "PublicationStartDate": "2025-06-06"
      },
      "RelevanceScore": 0,
      "RelevanceRank": 47
    },
    "specialist_analysis": {},
    "description_source": "web_scraping"
  }
}