{
  "job_metadata": {
    "job_id": "64726",
    "version": "1.0",
    "created_at": "2025-07-06T18:50:06.391106",
    "last_modified": "2025-07-06T18:50:06.391106",
    "source": "deutsche_bank_api",
    "processor": "enhanced_job_fetcher_v6.1",
    "status": "fetched"
  },
  "job_content": {
    "title": "Strategic Development Senior Analyst  - Strategy &amp; CEO Office (d/m/w)",
    "description": "Strategic Development Senior Analyst - Strategy & CEO Office (d/m/w) Job ID:R0391013 Full/Part-Time: Full-time Regular/Temporary: Regular Listed: 2025-06-25 Location: Frankfurt Position Overview Corporate TitleDas Strategy & CEO Office unterstützt die Definition der strategischen Agenda des Top-Managements und koordiniert zentrale CEO-Themen über alle Geschäfts- und Infrastrukturbereiche hinweg. Wir unterstützen das strategische Wachstum und die Zielsetzung der Deutschen Bank auf dem Weg zum European Champion. Als Teil unseres Teams profitiertest du von einer steilen Lernkurve, baust dir ein qualitatives und quantitatives analytisches Skillset auf und unterstützt bei der Entscheidungsfindung in einem dynamischen Umfeld. Deine Hauptverantwortlichkeiten Unterstütze bei der Definition und Weiterentwicklung der Konzernstrategie und übernehme Verantwortung für Aufgaben von (Teil-)Projekten im Kontext der Konzern- und CEO Prioritäten Unterstütze bei der Entwicklung eines ganzheitlichen Konzepts zur frühzeitigen Erkennung von Chancen und Risiken, die sich aus internen und externen Veränderungen ergeben Bereite Entscheidungsvorlagen für leitende Führungskräfte, den Vorstand und wichtige Stakeholder vor Ergreife die Initiative, um unsere Zusammenarbeit stetig zu verbessern – Bringe deine Erfahrungen und Expertise ein, um die Effizienz des Teams stetig zu steigern Werde Teil des Teams und ein verantwortungsvoller Ansprechpartner für unseren Vorstand, Geschäftsbereiche und Infrastrukturfunktionen Deine Expertise Hervorragender akademischer Werdegang mit mindestens 2-3 Jahren Berufserfahrung im M&A, einer dedizierten Strategierolle im Finanzdienstleistungssektor (Associate oder äquivalent) oder in der Strategieberatung (Junior Projektleiter oder äquivalent) Hervorragende analytische Fähigkeiten und starke schriftliche/verbale Kommunikationsfähigkeiten; verhandlungssichere Englisch- und Deutschkenntnisse sind eine Voraussetzung Exzellente Kommunikationsfähigkeiten, die es erlauben, komplexe Zusammenhänge verschiedenen Zielgruppen zu vermitteln und mit einer Vielzahl von Stakeholdern in Dialog zu treten Fähigkeit zur Konzeption und Umsetzung strategischer Initiativen Erfahrung in einem herausfordernden, dynamischen und internationalen Umfeld in enger Zusammenarbeit mit dem Top-Management zu arbeiten Unternehmerisches Mindset und “Getting Things Done”- Mentalität mit ausgeprägtem Sinn zur Priorisierung von Themen in Situationen mit begrenzter Anleitung Hoher Grad an persönlicher Integrität und Empathie im Umgang mit verschiedenen Stakeholder-Gruppen Was wir Ihnen bietenWir bieten eine breite Palette von Leistungen, die all Ihre beruflichen und persönlichen Bedürfnisse abdecken.Emotional ausgeglichenEine positive Haltung hilft uns, die Herausforderungen des Alltags zu meistern – beruflich wie privat. Profitieren Sie von Angeboten wie Beratung in schwierigen Lebenssituationen und Angeboten zur Förderung mentaler Gesundheit.Körperlich fitMit Angeboten zur Aufrechterhaltung Ihrer persönlichen Gesundheit und einem förderlichen beruflichen Umfeld hilft Ihnen die Bank, körperlich fit zu bleiben. Profitieren Sie von Angeboten wie umfangreichen Check-up Untersuchungen, Impfangeboten und Beratung zur gesunden Lebensführung.Sozial vernetztDer Austausch mit anderen eröffnet uns neue Perspektiven, bringt uns beruflich wie persönlich voran und stärkt unser Selbstvertrauen und Wohlbefinden. Profitieren Sie von Angeboten wie Unterstützung durch den pme Familienservice, das FitnessCenter Job, flexible Arbeitszeitmodelle (bspw. Teilzeit, Jobtandem, hybrides Arbeiten) sowie einer umfangreichen Kultur der Vielfalt, Chancengleichheit und Teilhabe.Finanziell abgesichertDie Bank sichert Sie nicht nur während Ihrer aktiven Karriere, sondern auch für die Zukunft finanziell ab und unterstützt Ihre Flexibilität sowie Mobilität – egal ob privat oder beruflich. Profitieren Sie von Angeboten wie Beitragsplänen für Altersvorsorge, Bankdienstleistungen für Mitarbeiter*innen, Firmenfahrrad oder dem Deutschlandticket.Da die Benefits je nach Standort geringfügig variieren, gehen Sie bitte bei konkreten Fragen auf Ihre Recruiterin zu.Die Stelle wird in Voll- und in Teilzeit angeboten.Bei Fragen zum Rekrutierungsprozess steht Ihnen Stefanie Schumann gerne zur Verfügung.Kontakt Stefanie Schumann: +49 69 91042578 Wir streben eine Unternehmenskultur an, in der wir gemeinsam jeden Tag das Beste geben. Dazu gehören verantwortungsvolles Handeln, wirtschaftliches Denken, Initiative ergreifen und zielgerichtete Zusammenarbeit.Gemeinsam teilen und feiern wir die Erfolge unserer Mitarbeiter*innen. Gemeinsam sind wir die Deutsche Bank Gruppe.Wir begrüßen Bewerbungen von allen Menschen und fördern ein positives, faires und integratives Arbeitsumfeld.",
    "requirements": [],
    "location": {
      "city": "Frankfurt",
      "state": "Hessen",
      "country": "Deutschland",
      "remote_options": false
    },
    "employment_details": {
      "type": "Unbefristet",
      "schedule": "Vollzeit",
      "career_level": "Assistant Vice President",
      "salary_range": null,
      "benefits": []
    },
    "organization": {
      "name": "Deutsche Bank",
      "division": "Frankfurt",
      "division_id": 14
    },
    "posting_details": {
      "publication_date": "2025-06-25",
      "position_uri": "/index.php?ac=jobad&id=64726",
      "hiring_year": "2025"
    }
  },
  "evaluation_results": {
    "cv_to_role_match": null,
    "match_confidence": null,
    "evaluation_date": null,
    "evaluator": null,
    "domain_knowledge_assessment": null,
    "decision": {
      "apply": null,
      "rationale": null,
      "estimated_prep_time": null
    },
    "strengths": [],
    "weaknesses": []
  },
  "processing_log": [
    {
      "timestamp": "2025-07-06T18:50:06.391106",
      "action": "job_fetched",
      "processor": "enhanced_job_fetcher_v6.1",
      "status": "success",
      "details": "Successfully fetched job 64726 from Deutsche Bank API"
    },
    {
      "timestamp": "2025-07-06T18:50:06.391106",
      "action": "description_enriched",
      "processor": "web_scraper",
      "status": "success",
      "details": "Successfully fetched job description (4776 characters)"
    }
  ],
  "raw_source_data": {
    "api_response": {
      "MatchedObjectId": "64726",
      "MatchedObjectDescriptor": {
        "PositionOfferingType": [
          {
            "Name": "Unbefristet"
          }
        ],
        "PositionSchedule": [
          {
            "Name": "Vollzeit"
          }
        ],
        "PublicationChannel": [
          {
            "StartDate": "2025-06-25"
          }
        ],
        "PositionTitle": "Strategic Development Senior Analyst  - Strategy &amp; CEO Office (d/m/w)",
        "PositionLocation": [
          {
            "CityName": "Frankfurt",
            "CountrySubDivisionName": "Hessen",
            "CountryName": "Deutschland"
          }
        ],
        "PositionURI": "/index.php?ac=jobad&id=64726",
        "PositionID": "64726",
        "OrganizationName": "Frankfurt",
        "PositionHiringYear": "2025",
        "UserArea": {
          "ProDivision": 14
        },
        "CareerLevel": [
          {
            "Name": "Assistant Vice President"
          }
        ],
        "PublicationStartDate": "2025-06-25"
      },
      "RelevanceScore": 0,
      "RelevanceRank": 19
    },
    "specialist_analysis": {},
    "description_source": "web_scraping"
  }
}