{
  "job_metadata": {
    "job_id": "63507",
    "version": "1.0",
    "created_at": "2025-07-10T12:18:02.542870",
    "last_modified": "2025-07-10T12:18:02.542870",
    "source": "deutsche_bank_api",
    "processor": "enhanced_job_fetcher_v6.1",
    "status": "fetched"
  },
  "job_content": {
    "title": "Senior Network Engineer (f/m/x) – Zero Trust Networks",
    "description": "Senior Network Engineer (f/m/x) – Zero Trust Networks Job ID:R0385287 Full/Part-Time: Full-time Regular/Temporary: Regular Listed: 2025-05-19 Location: Frankfurt Position Overview Über den JobDeutsche Bank Technology in FrankfurtDB Technology ist ein globales Team von Technologiespezialist*innen, verteilt über mehrere Handelszentren und Technologiezentren. Wir legen großen Wert auf technische Exzellenz – unsere Engineers arbeiten an der Spitze der Innovation im Finanzdienstleistungssektor und nutzen modernste Technologien.Wir sind bestrebt, eine vielfältige Belegschaft aufzubauen und hervorragende Möglichkeiten für talentierte Engineers und Technolog*innen zu schaffen. Unsere Technologieteams und Geschäftseinheiten arbeiten agil, um #GlobalHausbank-Lösungen aus unserem Heimatmarkt zu schaffen.Global Network Engineering ist Teil der Infrastructure Core Products Organisation und verantwortlich für die Bereitstellung globaler Lösungen und Standards für die groß angelegte Netzwerk-Infrastruktur der Deutschen Bank. Unser Netzwerk Security Engineering arbeitet mit führenden Architekt*innen und anderen Technologieteams zusammen, um Netzwerk-, Sicherheits-, Unternehmens-, Domänen- und Lösungsarchitekturen abzustimmen.Als Senior Network Engineer werden Sie groß angelegte Netzwerklösungen entwickeln, testen und dokumentieren, bevor Sie sie zur Implementierung übergeben. Ihr Fachgebiet wird Netzwerk Sicherheit sein (Zero Trust Network) welches die Zukunft unserer IT-Netzwerkinfrastruktur maßgeblich beeinflussen wird.Ihre VerantwortlichkeitenZu Ihren Hauptaufgaben im Network Security Engineering Team gehören:Entwerfen einer neuen Netzwerk-Architektur und Entwickeln von globalen StandardsAuswahl eines Netzwerk Produkts, welches unsere Anforderungen erfülltEnge Zusammenarbeit mit wichtigen Interessensgruppen; Anforderungen sammeln und Lösungen ermittelnProduktprüfung und -bewertungPräsentation von Designs und StandardsSchulung des Personals zu spezifischen Technologien und DesignsIhre Fähigkeiten & ErfahrungStudium oder Ausbildung in Informatik, Elektrotechnik, Wirtschaftsinformatik oder einem verwandten BereichMindestens 10 Jahre Berufserfahrung im Bereich Netzwerk SicherheitFundierte Erfahrung im Netzwerkdesign und in der Architektur, eine TOGAF-Zertifizierung ist vorteilhaftUmfangreiche Design- und Engineering Erfahrung in der Entwicklung von Netzwerksicherheitslösungen für große Unternehmensumgebungen; eine Vielzahl von branchenweiten Zertifizierungen im IT-Sicherheitsbereich wird stark bevorzugt; IT-Audit-Zertifizierungen sind von VorteilNachweisliche Erfolge im Design groß angelegter Netzwerklösungen, einschließlich Durchführung von Proof of concepts, High Level Design/Low Level Design-Dokumentation, 3rd-Level-Support, Produktschulung und ÜbergabeTiefgreifende Technische Kenntnisse über 2 oder mehr der folgenden Anbieter/Produkte: Cisco/Arista routing/switching; Checkpoint/Fortinet firewalls; Cisco ISE; VMware NSXWas wir Ihnen bietenWir bieten eine breite Palette von Leistungen, die all Ihre beruflichen und persönlichen Bedürfnisse abdecken.Emotional ausgeglichenEine positive Haltung hilft uns, die Herausforderungen des Alltags zu meistern – beruflich wie privat. Profitieren Sie von Angeboten wie Beratung in schwierigen Lebenssituationen und Angeboten zur Förderung mentaler Gesundheit.Körperlich fitMit Angeboten zur Aufrechterhaltung Ihrer persönlichen Gesundheit und einem förderlichen beruflichen Umfeld hilft Ihnen die Bank, körperlich fit zu bleiben. Profitieren Sie von Angeboten wie umfangreichen Check-up Untersuchungen, Impfangeboten und Beratung zur gesunden Lebensführung.Sozial vernetzt Der Austausch mit anderen eröffnet uns neue Perspektiven, bringt uns beruflich wie persönlich voran und stärkt unser Selbstvertrauen und Wohlbefinden. Profitieren Sie von Angeboten wie Unterstützung durch den pme Familienservice, das FitnessCenter Job, flexible Arbeitszeitmodelle (bspw. Teilzeit, Jobtandem, hybrides Arbeiten) sowie einer umfangreichen Kultur der Vielfalt, Chancengleichheit und Teilhabe.Finanziell abgesichertDie Bank sichert Sie nicht nur während Ihrer aktiven Karriere, sondern auch für die Zukunft finanziell ab und unterstützt Ihre Flexibilität sowie Mobilität – egal ob privat oder beruflich. Profitieren Sie von Angeboten wie Beitragsplänen für Altersvorsorge, Bankdienstleistungen für Mitarbeiter*innen, Firmenfahrrad oder dem Deutschlandticket.Da die Benefits je nach Standort geringfügig variieren, gehen Sie bitte bei konkreten Fragen auf Ihren Recruiter / Ihre Recruiterin zu.Die Stelle wird in Voll- und in Teilzeit angeboten.Bei Fragen zum Rekrutierungsprozess steht Ihnen Michaela Peschke gerne zur Verfügung.Kontakt Michaela Peschke: 069-910-43951*********************************************************************************About the jobDeutsche Bank Technology in FrankfurtDB Technology is a global team of technology specialists, spread across multiple trading hubs and tech centres. We have a strong focus on promoting technical excellence – our engineers work at the forefront of financial services innovation using cutting-edge technologies. Our Frankfurt location is our most recent addition to our global network of tech centres and growing strongly. We are committed to building a diverse workforce and to creating excellent opportunities for talented engineers and technologists. Our tech teams and business units use agile ways of working to create #GlobalHausbank solutions from our home market.Global Network Engineering is part of the Infrastructure Core Products organization and responsible for providing global solutions and standards for Deutsche Bank’s large-scale network infrastructure. Transport Engineering is partnering with Senior Architecture leaders and other technology teams to align Network, Security, Enterprise, Domain and Solution architecture.As a Senior Network Engineer, you will be engineering, testing and documenting large scale network solutions before handing them over for implementation. Your area of expertise will be Zero Trust networks, an exciting design principle which is going to influence the future of our IT network infrastructure.Your key responsibilitiesKey responsibilities of a team member in the Network Security Engineering Team include:Design new Network infrastructure and develop global standardsSelection of a network product that meets our requirementsWork closely with key stakeholders; gather requirements and determine solutionsProduct testing and evaluationPresentation of designs and standards to business leadersTraining staff on specific technologies and designsYour skills and experiencesDegree in Computer Engineering, Business Information Science or related fieldAt least 10 years of professional experience in the field of network securitySolid experience in Network Design and Architecture, a TOGAF certification is strongly preferredSenior design and engineering experience developing network security solutions for large enterprise environments; a variate of industry-wide certifications in the IT security field is strongly preferred; IT Audit certifications are a plusProven track record to design large-scale network solutions, including POC testing, HLD/LLD documentation, 3rd level operational support, product training and handoverEngineering-level knowledge of 2 or more of the following vendors/products: Cisco/Arista routing/switching; Checkpoint/Fortinet firewalls; Cisco ISE; VMware NSXWhat we offerWe provide you with a comprehensive portfolio of benefits and offerings to support both, your private and professional needs.Emotionally and mentally balancedA positive mind helps us master the challenges of everyday life – both professionally and privately. We offer consultation in difficult life situations as well as mental health awareness trainings.Physically thrivingWe support you in staying physically fit through an offering to maintain personal health and a professional environment. You can benefit from health check-ups; vaccination drives as well as advice on healthy living and nutrition.Socially connectedNetworking opens up new perspectives, helps us thrive professionally and personally as well as strengthens our self-confidence and well-being. You can benefit from PME family service, FitnessCenter Job, flexible working (e.g parttime, hybrid working, job tandem) as well as an extensive culture of diversity, equity and inclusion.Financially secureWe provide you with financial security not only during your active career but also for the future. You can benefit from offerings such as pension plans, banking services, company bicycle or “Deutschlandticket”.Since our offerings slightly vary across locations, please contact your recruiter with specific questions.This job is available in full and parttime.In case of any recruitment related questions, please get in touch with Michaela Peschke.Contact Michaela Peschke: 069-910-43951 Wir streben eine Unternehmenskultur an, in der wir gemeinsam jeden Tag das Beste geben. Dazu gehören verantwortungsvolles Handeln, wirtschaftliches Denken, Initiative ergreifen und zielgerichtete Zusammenarbeit.Gemeinsam teilen und feiern wir die Erfolge unserer Mitarbeiter*innen. Gemeinsam sind wir die Deutsche Bank Gruppe.Wir begrüßen Bewerbungen von allen Menschen und fördern ein positives, faires und integratives Arbeitsumfeld.",
    "requirements": [
      "the field of network securitySolid experience in Network Design and Architecture",
      "10 years of professional experience in the field of network securitySolid experience in Network Design and Architecture",
      "2 or more of the following vendors/products: Cisco/Arista routing/switching; Checkpoint/Fortinet firewalls; Cisco ISE; VMware NSXWhat we offerWe provide you with a comprehensive portfolio of benefits and offerings to support both"
    ],
    "location": {
      "city": "Frankfurt",
      "state": "Hessen",
      "country": "Deutschland",
      "remote_options": false
    },
    "employment_details": {
      "type": "Unbefristet",
      "schedule": "Vollzeit",
      "career_level": "Vice President",
      "salary_range": null,
      "benefits": []
    },
    "organization": {
      "name": "Deutsche Bank",
      "division": "Frankfurt",
      "division_id": 10052
    },
    "posting_details": {
      "publication_date": "2025-05-19",
      "position_uri": "/index.php?ac=jobad&id=63507",
      "hiring_year": "2025"
    }
  },
  "evaluation_results": {
    "cv_to_role_match": null,
    "match_confidence": null,
    "evaluation_date": null,
    "evaluator": null,
    "domain_knowledge_assessment": null,
    "decision": {
      "apply": null,
      "rationale": null,
      "estimated_prep_time": null
    },
    "strengths": [],
    "weaknesses": []
  },
  "processing_log": [
    {
      "timestamp": "2025-07-10T12:18:02.542870",
      "action": "job_fetched",
      "processor": "enhanced_job_fetcher_v6.1",
      "status": "success",
      "details": "Successfully fetched job 63507 from Deutsche Bank API"
    },
    {
      "timestamp": "2025-07-10T12:18:02.542870",
      "action": "description_enriched",
      "processor": "web_scraper",
      "status": "success",
      "details": "Successfully fetched job description (9368 characters)"
    }
  ],
  "raw_source_data": {
    "api_response": {
      "MatchedObjectId": "63507",
      "MatchedObjectDescriptor": {
        "PositionOfferingType": [
          {
            "Name": "Unbefristet"
          }
        ],
        "PositionSchedule": [
          {
            "Name": "Vollzeit"
          }
        ],
        "PublicationChannel": [
          {
            "StartDate": "2025-05-19"
          }
        ],
        "PositionTitle": "Senior Network Engineer (f/m/x) – Zero Trust Networks",
        "PositionLocation": [
          {
            "CityName": "Frankfurt",
            "CountrySubDivisionName": "Hessen",
            "CountryName": "Deutschland"
          }
        ],
        "PositionURI": "/index.php?ac=jobad&id=63507",
        "PositionID": "63507",
        "OrganizationName": "Frankfurt",
        "PositionHiringYear": "2025",
        "UserArea": {
          "ProDivision": 10052
        },
        "CareerLevel": [
          {
            "Name": "Vice President"
          }
        ],
        "PublicationStartDate": "2025-05-19"
      },
      "RelevanceScore": 0,
      "RelevanceRank": 55
    },
    "specialist_analysis": {},
    "description_source": "web_scraping"
  }
}