{
  "job_metadata": {
    "job_id": "63232",
    "version": "1.0",
    "created_at": "2025-07-10T12:47:16.337192",
    "last_modified": "2025-07-10T12:47:16.337192",
    "source": "deutsche_bank_api",
    "processor": "enhanced_job_fetcher_v6.1",
    "status": "fetched"
  },
  "job_content": {
    "title": "Sektor Banker Technology (d/m/w) – Corporate Finance",
    "description": "Sektor Banker Technology (d/m/w) – Corporate Finance Job ID:R0375251 Full/Part-Time: Full-time Regular/Temporary: Regular Listed: 2025-05-09 Location: Frankfurt Position Overview Über den BereichDer Bereich Corporate Finance in der Unternehmensbank (Corporate Bank) ist verantwortlich für die strategische Kundenberatung und der Entwicklung von Produktlösungen in den Bereichen M&A, ECM und DCM unserer Kunden unterhalb des Large-Cap Segmentes. Wir beraten Kunden (strategische, institutionelle und private) bei der Strukturierung und Durchführung von Unternehmens- und Finanzierungstransaktionen. Wir beraten gezielt den gehobenen deutschsprachigen Mittelstand und sind auch im angrenzenden Ausland tätig, entwickeln und setzen maßgeschneiderte Lösungsansätze für unsere Kunden, vom Start-up bis hin zum börsennotierten Großkunden, um.Ihre AufgabenSie unterstützen das Team und die Senior Banker beim Führen strategischer Dialoge auf Ebene der Entscheider (C-Suite) und Eigner, um deren Herausforderungen und strategische Prioritäten zu verstehen und das Potenzial für M&A sowie Kapitalmarktlösungen auf der Debt- und Equityseite zu erkennen und in spezifische Mandate umzuwandelnNeben einem ausgeprägten Akquisitionstalent und Sektorverständnis im Bereich Technology/Software verfügen Sie über die technischen, quantitativen und qualitativen Tools, um maßgeschneiderte Lösungen für die Kunden zu entwickeln und die Erstellung von Analysen, Pitch-Unterlagen und Projektunterlagen für M&A und Kapitalmarktprodukte mit Ihrem Projektteam federführend umzusetzen.Sie entwickeln zusammen mit Produktkollegen maßgeschneiderte Produktlösungen mit Fokus auf die Corporate Finance Beratungsangebote der Bank und können diese in die Entwicklung von Kundenbeziehungen pro-aktiv mit einbringenZusammen mit den Senior Investment Bankern interagieren Sie mit Entscheidern unserer wichtigsten strategischen Firmenkunden, Konzernen oder auch Private Equity Gesellschaften und Family Offices professionell, proaktiv, umsichtig und versiert, um ein vertrauensvoller und kompetenter Partner auf Augenhöhe zu seinSie haben inzwischen ein Netzwerk im Technology/Software Sektor sowie bei relevanten Stakeholdern wie z.B. Private Equity Funds aufgebaut und erweitern kontinuierlich das relevante Netzwerk der potenziellen Zielkunden der Bank, indem Sie den Dialog mit den Entscheidungsträgern aktiv suchen und wertbringend gestaltenInnerhalb des Corporate Finance Teams der Unternehmensbank managen Sie als Projektleiter und erfahrener Sektor Banker die wichtige Schnittstelle zwischen den Produktbereichen, anderen Industriegruppen/Sektorexperten und den regionalen Betreuungseinheiten der Corporate BankSie berichten direkt an den Leiter der Einheit.Ihre Fähigkeiten und ErfahrungenUniversitätsabschluss in VWL, BWL, Wi.-Ing., Jura o.ä., idealerweise mit einer internationalen Ausrichtung und Schwerpunkt auf Corporate Finance und/oder M&ARelevante, langjährige Arbeitserfahrung im Tätigkeitsfeld Corporate Finance, idealerweise mit Fokus auf die Produktebereiche M&A, Equity- und/oder Debt Capital Markets in einer Finanzinstitution, einem Corporate oder Private Equity UnternehmenErfahrung und Kenntnis im Bereich Technologie und Software mit entsprechendem NetzwerkErfahrung im Umgang mit Projektverantwortlichen und Entscheidern von Unternehmen gepaart mit guten Kommunikationsfähigkeiten auf allen Ebenen, um ein Projekt hauptverantwortlich zu managen und ein interdisziplinäres Projektteam eigenständig zu führenSehr gute Projektmanagement- und Organisationsfähigkeit sowie die Fähigkeit, zu priorisieren und Aufgaben parallel unter Zeitdruck zu bewältigenAusgeprägte Leistungsbereitschaft, Eigeninitiative und ReisebereitschaftExzellente Deutsch- und Englischkenntnisse mit einer starken PräsentationskompetenzWas wir Ihnen bietenWir bieten eine breite Palette von Leistungen, die all Ihre beruflichen und persönlichen Bedürfnisse abdecken.Emotional ausgeglichenEine positive Haltung hilft uns, die Herausforderungen des Alltags zu meistern – beruflich wie privat. Profitieren Sie von Angeboten wie Beratung in schwierigen Lebenssituationen und Angeboten zur Förderung mentaler Gesundheit.Körperlich fitMit Angeboten zur Aufrechterhaltung Ihrer persönlichen Gesundheit und einem förderlichen beruflichen Umfeld hilft Ihnen die Bank, körperlich fit zu bleiben. Profitieren Sie von Angeboten wie umfangreichen Check-up Untersuchungen, Impfangeboten und Beratung zur gesunden Lebensführung.Sozial vernetztDer Austausch mit anderen eröffnet uns neue Perspektiven, bringt uns beruflich wie persönlich voran und stärkt unser Selbstvertrauen und Wohlbefinden. Profitieren Sie von Angeboten wie Unterstützung durch den pme Familienservice, das FitnessCenter Job, flexible Arbeitszeitmodelle (bspw. Teilzeit, Jobtandem, hybrides Arbeiten) sowie einer umfangreichen Kultur der Vielfalt, Chancengleichheit und Teilhabe.Finanziell abgesichertDie Bank sichert Sie nicht nur während Ihrer aktiven Karriere, sondern auch für die Zukunft finanziell ab und unterstützt Ihre Flexibilität sowie Mobilität – egal ob privat oder beruflich. Profitieren Sie von Angeboten wie Beitragsplänen für Altersvorsorge, Bankdienstleistungen für Mitarbeiter*innen, Firmenfahrrad oder dem Deutschlandticket.Da die Benefits je nach Standort geringfügig variieren, gehen Sie bitte bei konkreten Fragen auf Ihren Recruiter / Ihre Recruiterin zu.Die Stelle wird in Voll- und in Teilzeit angeboten.Bei Fragen zum Rekrutierungsprozess steht Ihnen Philipp Maaß gerne zur Verfügung.Kontakt Philipp Maaß: +49 (69) 910 48515 Wir streben eine Unternehmenskultur an, in der wir gemeinsam jeden Tag das Beste geben. Dazu gehören verantwortungsvolles Handeln, wirtschaftliches Denken, Initiative ergreifen und zielgerichtete Zusammenarbeit.Gemeinsam teilen und feiern wir die Erfolge unserer Mitarbeiter*innen. Gemeinsam sind wir die Deutsche Bank Gruppe.Wir begrüßen Bewerbungen von allen Menschen und fördern ein positives, faires und integratives Arbeitsumfeld.",
    "requirements": [],
    "location": {
      "city": "Frankfurt",
      "state": "Hessen",
      "country": "Deutschland",
      "remote_options": false
    },
    "employment_details": {
      "type": "Unbefristet",
      "schedule": "Vollzeit",
      "career_level": "Vice President",
      "salary_range": null,
      "benefits": []
    },
    "organization": {
      "name": "Deutsche Bank",
      "division": "Frankfurt",
      "division_id": 10050
    },
    "posting_details": {
      "publication_date": "2025-05-09",
      "position_uri": "/index.php?ac=jobad&id=63232",
      "hiring_year": "2025"
    }
  },
  "evaluation_results": {
    "cv_to_role_match": null,
    "match_confidence": null,
    "evaluation_date": null,
    "evaluator": null,
    "domain_knowledge_assessment": null,
    "decision": {
      "apply": null,
      "rationale": null,
      "estimated_prep_time": null
    },
    "strengths": [],
    "weaknesses": []
  },
  "processing_log": [
    {
      "timestamp": "2025-07-10T12:47:16.337192",
      "action": "job_fetched",
      "processor": "enhanced_job_fetcher_v6.1",
      "status": "success",
      "details": "Successfully fetched job 63232 from Deutsche Bank API"
    },
    {
      "timestamp": "2025-07-10T12:47:16.337192",
      "action": "description_enriched",
      "processor": "web_scraper",
      "status": "success",
      "details": "Successfully fetched job description (6004 characters)"
    }
  ],
  "raw_source_data": {
    "api_response": {
      "MatchedObjectId": "63232",
      "MatchedObjectDescriptor": {
        "PositionOfferingType": [
          {
            "Name": "Unbefristet"
          }
        ],
        "PositionSchedule": [
          {
            "Name": "Vollzeit"
          }
        ],
        "PublicationChannel": [
          {
            "StartDate": "2025-05-09"
          }
        ],
        "PositionTitle": "Sektor Banker Technology (d/m/w) – Corporate Finance",
        "PositionLocation": [
          {
            "CityName": "Frankfurt",
            "CountrySubDivisionName": "Hessen",
            "CountryName": "Deutschland"
          }
        ],
        "PositionURI": "/index.php?ac=jobad&id=63232",
        "PositionID": "63232",
        "OrganizationName": "Frankfurt",
        "PositionHiringYear": "2025",
        "UserArea": {
          "ProDivision": 10050
        },
        "CareerLevel": [
          {
            "Name": "Vice President"
          }
        ],
        "PublicationStartDate": "2025-05-09"
      },
      "RelevanceScore": 0,
      "RelevanceRank": 58
    },
    "specialist_analysis": {},
    "description_source": "web_scraping"
  }
}