{
  "job_metadata": {
    "job_id": "63506",
    "version": "1.0",
    "created_at": "2025-07-10T12:18:01.679988",
    "last_modified": "2025-07-10T12:18:01.679988",
    "source": "deutsche_bank_api",
    "processor": "enhanced_job_fetcher_v6.1",
    "status": "fetched"
  },
  "job_content": {
    "title": "Production Specialist (f/m/x) – Network Security Deployment",
    "description": "Production Specialist (f/m/x) – Network Security Deployment Job ID:R0385814 Full/Part-Time: Full-time Regular/Temporary: Regular Listed: 2025-05-19 Location: Frankfurt Position Overview *English version below*Bereich & TeamDas Team „Network Security Deployment“ innerhalb des Bereichs TDI/ICP/Networks ist dafür verantwortlich, den Security-relevanten Bereich des Deutsche Bank Netzwerkes zu erweitern und nach Bedarf der Businessbereiche auszubauen und an die Anforderungen von internen und externen Regularien anzupassen.Aufgabenbeschreibung:Zusammenarbeit in einem internationalen Team, das für alle Security-Bereiche innerhalb des Netzwerkes zuständig istDeployment von sämtlichen Technologien (Router, Switches, Firewall, Proxy, etc.)Gemeinsames Erarbeiten von kundenspezifischen Lösungen mit den entsprechenden Engineering-Gruppen innerhalb von TDI/ICP/NetworksInbetriebnahme, Test, Übergabe an den Betrieb; Troubleshooting der Security-UmgebungImplementierung von Regelwerken auf Firewall/ProxySicherstellung von End-of-Life sowie Tech Road ComplianceAnforderungsprofil:Erfolgreich abgeschlossenes Studium im Bereich Informatik oder vergleichbare BerufserfahrungFachliche Kenntnisse im Bereich Netzwerk (Layer2/3, Routing und Switching); Netzwerk Security (Firewall, Proxy); CloudVertrautheit mit regulatorischen Anforderungen an die ITStarke analytische Fähigkeiten, ein lösungsorientierter Arbeitsstil verbunden mit einer ausgeprägten KommunikationsstärkeSichere Englisch- und Deutschkenntnisse in Wort und SchriftWas wir Ihnen bieten:Wir bieten eine breite Palette von Leistungen, die all Ihre beruflichen und persönlichen Bedürfnisse abdecken.Emotional ausgeglichenEine positive Haltung hilft uns, die Herausforderungen des Alltags zu meistern – beruflich wie privat. Profitieren Sie von Angeboten wie Beratung in schwierigen Lebenssituationen und Angeboten zur Förderung mentaler Gesundheit.Körperlich fitMit Angeboten zur Aufrechterhaltung Ihrer persönlichen Gesundheit und einem förderlichen beruflichen Umfeld hilft Ihnen die Bank, körperlich fit zu bleiben. Profitieren Sie von Angeboten wie umfangreichen Check-up Untersuchungen, Impfangeboten und Beratung zur gesunden Lebensführung.Sozial vernetzt Der Austausch mit anderen eröffnet uns neue Perspektiven, bringt uns beruflich wie persönlich voran und stärkt unser Selbstvertrauen und Wohlbefinden. Profitieren Sie von Angeboten wie Unterstützung durch den pme Familienservice, das FitnessCenter Job, flexible Arbeitszeitmodelle (bspw. Teilzeit, Jobtandem, hybrides Arbeiten) sowie einer umfangreichen Kultur der Vielfalt, Chancengleichheit und Teilhabe.Finanziell abgesichertDie Bank sichert Sie nicht nur während Ihrer aktiven Karriere, sondern auch für die Zukunft finanziell ab und unterstützt Ihre Flexibilität sowie Mobilität – egal ob privat oder beruflich. Profitieren Sie von Angeboten wie Beitragsplänen für Altersvorsorge, Bankdienstleistungen für Mitarbeiter*innen, Firmenfahrrad oder dem Deutschlandticket.Da die Benefits je nach Standort geringfügig variieren, gehen Sie bitte bei konkreten Fragen auf Ihren Recruiter / Ihre Recruiterin zu.Die Stelle wird in Voll- und in Teilzeit angeboten.Bei Fragen zum Rekrutierungsprozess steht Ihnen Michaela Peschke gerne zur Verfügung.Kontakt Michaela Peschke: 069-910-43951**********************************************************************************Department & Team The \"Network Security Deployment\" team within the TDI/ICP/Networks department is responsible for expanding the security-relevant areas of the Deutsche Bank network, expanding them as needed by the business units, and adapting them to the requirements of internal and external regulations.Job description:Collaboration in an international team that is responsible for all security areas within the networkDeployment of all technologies (routers, switches, firewalls, proxies, etc.)Joint development of customer-specific solutions with the relevant engineering groups within TDI/ICP/NetworksCommissioning, testing, handover to operations, and troubleshooting of the security environmentImplementation of firewall/proxy policyEnsuring end-of-life and tech road complianceRequirements profile:Successfully completed studies in computer science or comparable professional experienceTechnical knowledge in the area of ​​network (Layer 2/3, routing and switching); network security (firewall, proxy); cloudFamiliarity with regulatory requirements for ITStrong analytical skills, a solution-oriented working style combined with strong communication skillsFluent written and spoken English and GermanWhat we offer:We provide you with a comprehensive portfolio of benefits and offerings to support both, your private and professional needs.Emotionally and mentally balancedA positive mind helps us master the challenges of everyday life – both professionally and privately. We offer consultation in difficult life situations as well as mental health awareness trainings.Physically thrivingWe support you in staying physically fit through an offering to maintain personal health and a professional environment. You can benefit from health check-ups; vaccination drives as well as advice on healthy living and nutrition.Socially connectedNetworking opens up new perspectives, helps us thrive professionally and personally as well as strengthens our self-confidence and well-being. You can benefit from PME family service, FitnessCenter Job, flexible working (e.g parttime, hybrid working, job tandem) as well as an extensive culture of diversity, equity and inclusion.Financially secureWe provide you with financial security not only during your active career but also for the future. You can benefit from offerings such as pension plans, banking services, company bicycle or “Deutschlandticket”.Since our offerings slightly vary across locations, please contact your recruiter with specific questions.This job is available in full and parttime.In case of any recruitment related questions, please get in touch with Michaela Peschke.Contact Michaela Peschke: 069-910-43951 Wir streben eine Unternehmenskultur an, in der wir gemeinsam jeden Tag das Beste geben. Dazu gehören verantwortungsvolles Handeln, wirtschaftliches Denken, Initiative ergreifen und zielgerichtete Zusammenarbeit.Gemeinsam teilen und feiern wir die Erfolge unserer Mitarbeiter*innen. Gemeinsam sind wir die Deutsche Bank Gruppe.Wir begrüßen Bewerbungen von allen Menschen und fördern ein positives, faires und integratives Arbeitsumfeld.",
    "requirements": [],
    "location": {
      "city": "Frankfurt",
      "state": "Hessen",
      "country": "Deutschland",
      "remote_options": false
    },
    "employment_details": {
      "type": "Unbefristet",
      "schedule": "Vollzeit",
      "career_level": "Assistant Vice President",
      "salary_range": null,
      "benefits": []
    },
    "organization": {
      "name": "Deutsche Bank",
      "division": "Frankfurt",
      "division_id": 10052
    },
    "posting_details": {
      "publication_date": "2025-05-19",
      "position_uri": "/index.php?ac=jobad&id=63506",
      "hiring_year": "2025"
    }
  },
  "evaluation_results": {
    "cv_to_role_match": null,
    "match_confidence": null,
    "evaluation_date": null,
    "evaluator": null,
    "domain_knowledge_assessment": null,
    "decision": {
      "apply": null,
      "rationale": null,
      "estimated_prep_time": null
    },
    "strengths": [],
    "weaknesses": []
  },
  "processing_log": [
    {
      "timestamp": "2025-07-10T12:18:01.679988",
      "action": "job_fetched",
      "processor": "enhanced_job_fetcher_v6.1",
      "status": "success",
      "details": "Successfully fetched job 63506 from Deutsche Bank API"
    },
    {
      "timestamp": "2025-07-10T12:18:01.679988",
      "action": "description_enriched",
      "processor": "web_scraper",
      "status": "success",
      "details": "Successfully fetched job description (6494 characters)"
    }
  ],
  "raw_source_data": {
    "api_response": {
      "MatchedObjectId": "63506",
      "MatchedObjectDescriptor": {
        "PositionOfferingType": [
          {
            "Name": "Unbefristet"
          }
        ],
        "PositionSchedule": [
          {
            "Name": "Vollzeit"
          }
        ],
        "PublicationChannel": [
          {
            "StartDate": "2025-05-19"
          }
        ],
        "PositionTitle": "Production Specialist (f/m/x) – Network Security Deployment",
        "PositionLocation": [
          {
            "CityName": "Frankfurt",
            "CountrySubDivisionName": "Hessen",
            "CountryName": "Deutschland"
          }
        ],
        "PositionURI": "/index.php?ac=jobad&id=63506",
        "PositionID": "63506",
        "OrganizationName": "Frankfurt",
        "PositionHiringYear": "2025",
        "UserArea": {
          "ProDivision": 10052
        },
        "CareerLevel": [
          {
            "Name": "Assistant Vice President"
          }
        ],
        "PublicationStartDate": "2025-05-19"
      },
      "RelevanceScore": 0,
      "RelevanceRank": 54
    },
    "specialist_analysis": {},
    "description_source": "web_scraping"
  }
}