{
  "job_metadata": {
    "job_id": "50571",
    "version": "1.0",
    "created_at": "2025-07-06T18:49:47.246568",
    "last_modified": "2025-07-06T18:49:47.246568",
    "source": "deutsche_bank_api",
    "processor": "enhanced_job_fetcher_v6.1",
    "status": "fetched"
  },
  "job_content": {
    "title": "Senior Consultant (d/m/w) – Deutsche Bank Management Consulting",
    "description": "Senior Consultant (d/m/w) – Deutsche Bank Management Consulting Job ID:R0319547 Listed: 2025-07-01 Regular/Temporary: Regular Location: Frankfurt Position Overview Unser Team: https://management-consulting.db.com/Als Teil des Deutsche Bank Management Consulting (DBMC), der globalen Managementberatung der Deutschen Bank, arbeitest du mit Führungskräften zusammen, um zu den Erfolgen der Bank beizutragen. Zu unseren Beratungsschwerpunkten zählen die Umsetzung von Strategie- und Transformationsprojekten, u.a. hinsichtlich der Förderung von Innovations- und Wachstumsthemen sowie weiterer wichtiger Herausforderungen der Bank. Im Rahmen der Tätigkeit kannst Du engen Kontakt zu Führungskräften pflegen und Dir so ein Netzwerk innerhalb der Bank aufbauen.Um innovatives Denken zu fördern, setzen wir auf ein Team aus verschiedensten Persönlichkeiten. Wir legen Wert darauf, ein Arbeitsumfeld zu schaffen, in dem sich jedes Teammitglied zugehörig fühlen und authentisch sein kann. Was wir Dir bieten:Um die Transformation und die Wachstumsambitionen der Bank zu unterstützen, sind wir auf der Suche nach Engagement Managern für unser Team in Deutschland. Dich erwarten verantwortungsvolle und abwechslungsreiche Tätigkeiten – und das vom ersten Tag an. Alle 3-6 Monate rotierst Du in neue Projektteams und lernst so alle Unternehmensbereiche (Corporate & Investment Bank, DWS, Privat- und Firmenkundenbank) sowie Infrastrukturfunktionen (z.B. Risiko, Finanzen) der Bank kennen. Deine Tätigkeitsschwerpunkte:Du arbeitest an strategischen Projekten und übernimmst Verantwortung für Aufgaben in Teilprojekten und für TeammitgliederDu stehst im direkten Austausch mit unseren Kunden innerhalb der Bank und führst eigenständig Termine durchZusammen mit dem DBMC Engagement Manager verantwortest du die Vorbereitung von Entscheidungsvorlagen für das Senior Management und den VorstandDu unterstützt die Entwicklung deines Projektteams sowie die Konzeption von Best Practices und weiteren MethodenDein Profil: Wir sind auf der Suche nach Talenten mit überdurchschnittlichen akademischen Leistungen aller Fachrichtungen (Bachelor-/Master-Abschluss), um einen positiven Beitrag für unsere Kunden leisten zu können. Fachliche Qualifikation ist uns sehr wichtig, noch entscheidender für uns ist jedoch Deine Persönlichkeit.Du hast einschlägige Berufserfahrung gesammelt, idealerweise im Projektmanagement oder in einer UnternehmensberatungDu bist eine verantwortungsbewusste, engagierte Persönlichkeit mit hervorragenden analytischen Fähigkeiten und hast ein OrganisationstalentDu arbeitest gerne im Team und Deine verhandlungssicheren kommunikativen Fähigkeiten in Deutsch und Englisch ermöglichen die Arbeit in einem internationalen ArbeitsumfeldDu bist konfliktfähig und überzeugst andere gerne von Deinen Ideen und Lösungsansätzen Du legst großen Wert auf deine Aus- und Weiterbildung und unterstützt andere Kollegen hierbeiWas wir Dir auch bieten:Die Stelle wird in Voll- und in Teilzeit angeboten. Wir bieten eine breite Palette von Leistungen, die all Ihre beruflichen und persönlichen Bedürfnisse abdecken.Emotional ausgeglichen: Eine positive Haltung hilft uns, die Herausforderungen des Alltags zu meistern – beruflich wie privat. Profitieren Sie von Angeboten wie Beratung in schwierigen Lebenssituationen und Angeboten zur Förderung mentaler Gesundheit.Körperlich fit: Mit Angeboten zur Aufrechterhaltung Ihrer persönlichen Gesundheit und einem förderlichen beruflichen Umfeld hilft Ihnen die Bank, körperlich fit zu bleiben. Profitieren Sie von Angeboten wie umfangreichen Check-up Untersuchungen, Impfangeboten und Beratung zur gesunden Lebensführung.Sozial vernetzt: Der Austausch mit anderen eröffnet uns neue Perspektiven, bringt uns beruflich wie persönlich voran und stärkt unser Selbstvertrauen und Wohlbefinden. Profitieren Sie von Angeboten wie Unterstützung durch den pme Familienservice, das FitnessCenter Job, flexible Arbeitszeitmodelle (bspw. Teilzeit, Jobtandem, hybrides Arbeiten) sowie einer umfangreichen Kultur der Vielfalt, Chancengleichheit und Teilhabe.Finanziell abgesichert: Die Bank sichert Sie nicht nur während Ihrer aktiven Karriere, sondern auch für die Zukunft finanziell ab und unterstützt Ihre Flexibilität sowie Mobilität – egal ob privat oder beruflich. Profitieren Sie von Angeboten wie Beitragsplänen für Altersvorsorge, Bankdienstleistungen für Mitarbeiter*innen, Firmenfahrrad oder dem Deutschlandticket.Da die Benefits je nach Standort geringfügig variieren, gehe bitte bei konkreten Fragen auf Deinen Recruiter/Ihre Recruiterin zu.​Haben wir Dein Interesse geweckt? Dann freuen wir uns darauf, dich kennenzulernen!Bitte reiche deine Bewerbung online in Englisch inkl. CV, Anschreiben sowie den dazugehörigen akademischen und beruflichen Zeugnissen ein. Bei Fragen zum Rekrutierungsprozess steht Dir Nana Darko gerne zur Verfügung.Kontakt Nana Darko: +49 (0)175 - 6705312.....................................................................................................................................Our Team: https://management-consulting.db.com/You will be joining Deutsche Bank Management Consulting (DBMC), the Bank’s in-house management consulting global function that partners with senior executives across the bank to deliver impact. Our project portfolio covers a wide range of strategic and transformation topics, which can range from supporting the Bank’s transformation agenda, to driving innovation and growth, to other pressing issues across all areas of the Bank. Our team members obtain an unrivaled level of exposure and access to the Bank’s most senior executives.To deliver impact, we build an inclusive team with different backgrounds to drive innovative thinking. You will work in a team that pursues a working environment where everyone can be authentic and feels a sense of belonging. What we’ll offer you To support the transformation and growth ambitions of the bank in the best possible way, we are looking for an Engagement Manager to join our team in Germany. You can expect challenging and varying tasks - from day one. As part of your job, you will rotate into new project teams every 3-6 months and get to know all business divisions (Corporate & Investment Bank, DWS, Private Bank) as well as infrastructure functions (e.g., Risk, Finance) of the bank Your key responsibilitiesYou work on strategic projects and take responsibility for tasks in sub-projects and for team members.You are in direct contact with our clients within the bank and independently conduct meetings.Together with the DBMC Enagement Manager, you are responsible for preparing decision templates for senior management and the board.You support the development of your project team as well as the conception of best practices and other methods.Your skills and experienceWe are looking for talented individuals with above-average academic performance from all fields of study (Bachelor’s/Master’s degree) to make a positive contribution to our clients. Professional qualifications are very important to us, but even more crucial is your personality.You have relevant professional experience, ideally in project management or consulting.You are a responsible, committed individual with excellent analytical skills and organizational talent.You enjoy working in a team, and your fluent communication skills in German and English enable you to work in an international environment.You are capable of handling conflicts and enjoy convincing others of your ideas and solutions. You place great value on your education and training and support your colleagues in this regard.What we offerWe provide you with a comprehensive portfolio of benefits and offerings to support both, your private and professional needs.Emotionally and mentally balancedA positive mind helps us master the challenges of everyday life – both professionally and privately. We offer consultation in difficult life situations as well as mental health awareness trainings.Physically thrivingWe support you in staying physically fit through an offering to maintain personal health and a professional environment. You can benefit from health check-ups; vaccination drives as well as advice on healthy living and nutrition.Socially connectedNetworking opens up new perspectives, helps us thrive professionally and personally as well as strengthens our self-confidence and well-being. You can benefit from PME family service, FitnessCenter Job, flexible working (e.g parttime, hybrid working, job tandem) as well as an extensive culture of diversity, equity and inclusion.Financially secureWe provide you with financial security not only during your active career but also for the future. You can benefit from offerings such as pension plans, banking services, company bicycle or “Deutschlandticket”.Since our offerings slightly vary across locations, please contact your recruiter with specific questions.This job is available in full and parttime.In case of any recruitment related questions, please get in touch with Nana Darko.Contact Nana Darko: +49 (0)175 - 6705312 Wir streben eine Unternehmenskultur an, in der wir gemeinsam jeden Tag das Beste geben. Dazu gehören verantwortungsvolles Handeln, wirtschaftliches Denken, Initiative ergreifen und zielgerichtete Zusammenarbeit.Gemeinsam teilen und feiern wir die Erfolge unserer Mitarbeiter*innen. Gemeinsam sind wir die Deutsche Bank Gruppe.Wir begrüßen Bewerbungen von allen Menschen und fördern ein positives, faires und integratives Arbeitsumfeld.",
    "requirements": [],
    "location": {
      "city": "Frankfurt",
      "state": "Hessen",
      "country": "Deutschland",
      "remote_options": false
    },
    "employment_details": {
      "type": "Unbefristet",
      "schedule": "Vollzeit",
      "career_level": "Assistant Vice President",
      "salary_range": null,
      "benefits": []
    },
    "organization": {
      "name": "Deutsche Bank",
      "division": "Frankfurt",
      "division_id": 10058
    },
    "posting_details": {
      "publication_date": "2025-07-01",
      "position_uri": "/index.php?ac=jobad&id=50571",
      "hiring_year": "2025"
    }
  },
  "evaluation_results": {
    "cv_to_role_match": null,
    "match_confidence": null,
    "evaluation_date": null,
    "evaluator": null,
    "domain_knowledge_assessment": null,
    "decision": {
      "apply": null,
      "rationale": null,
      "estimated_prep_time": null
    },
    "strengths": [],
    "weaknesses": []
  },
  "processing_log": [
    {
      "timestamp": "2025-07-06T18:49:47.246568",
      "action": "job_fetched",
      "processor": "enhanced_job_fetcher_v6.1",
      "status": "success",
      "details": "Successfully fetched job 50571 from Deutsche Bank API"
    },
    {
      "timestamp": "2025-07-06T18:49:47.246568",
      "action": "description_enriched",
      "processor": "web_scraper",
      "status": "success",
      "details": "Successfully fetched job description (9513 characters)"
    }
  ],
  "raw_source_data": {
    "api_response": {
      "MatchedObjectId": "50571",
      "MatchedObjectDescriptor": {
        "PositionOfferingType": [
          {
            "Name": "Unbefristet"
          }
        ],
        "PositionSchedule": [
          {
            "Name": "Vollzeit"
          }
        ],
        "PublicationChannel": [
          {
            "StartDate": "2025-07-01"
          }
        ],
        "PositionTitle": "Senior Consultant (d/m/w) – Deutsche Bank Management Consulting",
        "PositionLocation": [
          {
            "CityName": "Frankfurt",
            "CountrySubDivisionName": "Hessen",
            "CountryName": "Deutschland"
          }
        ],
        "PositionURI": "/index.php?ac=jobad&id=50571",
        "PositionID": "50571",
        "OrganizationName": "Frankfurt",
        "PositionHiringYear": "2025",
        "UserArea": {
          "ProDivision": 10058
        },
        "CareerLevel": [
          {
            "Name": "Assistant Vice President"
          }
        ],
        "PublicationStartDate": "2025-07-01"
      },
      "RelevanceScore": 0,
      "RelevanceRank": 12
    },
    "specialist_analysis": {},
    "description_source": "web_scraping"
  }
}