{
  "job_metadata": {
    "job_id": "64841",
    "version": "1.0",
    "created_at": "2025-07-04T06:42:44.641092",
    "last_modified": "2025-07-04T06:42:44.641092",
    "source": "deutsche_bank_api",
    "processor": "enhanced_job_fetcher_v6.1",
    "status": "fetched"
  },
  "job_content": {
    "title": "Credit Analyst – CRM Leveraged and Structured Finance (f/m/x)",
    "description": "Credit Analyst – CRM Leveraged and Structured Finance (f/m/x) Job ID:R0389193 Full/Part-Time: Full-time Regular/Temporary: Regular Listed: 2025-07-01 Location: Frankfurt Position Overview *English version below*Über den BereichDer Bereich Risk hat die grundlegende Verantwortung, die Bank zu schützen. Durch unsere konzernweite Verantwortlichkeit für das Management und die Steuerung von Kredit-, Markt-, operationellen und Reputationsrisiken nehmen wir eine besondere Perspektive ein, die uns eine ganzheitliche Sicht auf unser Geschäft und unsere Kunden ermöglicht. Fast 4.000 Mitarbeiter arbeiten gemeinsam daran, unser Ziel zu erreichen, eine branchenweit führende Organisation im Risikomanagement zu sein.Leveraged Lending ist ein klar definiertes Produkt sowohl im Rahmen einer Richtlinie der EZB als auch der entsprechenden DB Produkt- und Prozessrichtlinien, die in den Risikomanagement Prozessen integriert sind.Aufgrund des hohen Risikogehaltes bei Kreditvergabe an hoch verschuldete Firmen, erfordert dieses Produkt einen spezialisierten Kreditprozess (von der Abteilung CRM LSF durchgeführt). Dieser beinhaltet eine für Leveraged Lending spezifisch detaillierte Kreditanalyse (inkl. Due Diligence), Risikorasterung und Kreditüberwachung.Im Rahmen unserer Strategie für große und mittelgroße Firmenkunden in Europa das Produkt \"Leveraged Lending\" zu vermarkten und anzubieten - sucht CRM LSF zur Verstärkung des Teams eine/-n Kreditanalyst*in.Ihre AufgabenAls Kreditanalyst*in mit Sitz in Frankfurt am Main sind Sie verantwortlich für die Einhaltung der definierten Risikoprozesse für dieses Geschäftsfeld und die Implementierung von passenden Risikostandards bei der Kreditvergabe (Markt- oder DB-Risikobereitschaft) und Risikorasterung. Als Teil des CRM LSF Teams werden Sie primär die Verantwortung für die Portfolio-Überwachung übernehmen. Darüber hinaus werden Sie in nationalen und internationalen Transaktionen als Kreditanalyst*in involviert.Aufgabenschwerpunkte:Laufende Portfolio-Überwachung von Krediten (ca. 30-40 Kreditengagements) für eine Vielzahl von Branchen. Pflege der Datenintegrität in den verschiedenen Kreditsystemen für alle Transaktionen im Portfolio.Generierung der Portfolio Berichte für das interne Reporting.Analyse der Leveraged Lending Kreditbeteiligungen bei neuen Transaktionen einschließlich Leveraged Buyouts (LBO), Mergers & Acquisitions (M&A), Amend-to-Extend und Waiver Anfragen.Analyse von Kreditanfragen für Fremdwährungs- / Zins- / Commodity-Derivate, Transaktionsbanking, Handelsfinanzierung usw.Bearbeitung der Kreditberichte von kritischer Analyse und Kommentierung des Erstentwurfes bis zu finalen Genehmigungsvorlage mit ausformulierter Kreditgenehmigung gemäß geltender Kreditkompetenzen sowie Präsentation von größeren Kreditanfragen vor dem Underwriting Committee.Teilnahme an diversen internen Projekten, mit dem Ziel die Effizienz zu verbessern.Unterstützende Funktion bei Interaktionen des Teams mit internen/externen Wirtschaftsprüfern und Aufsichtsbehörden.Ihre Fähigkeiten und ErfahrungenAkademischer Grad vorzugsweise im Bereich Betriebswirtschaftslehre, Finanzwirtschaft oder in vergleichbaren Fachrichtungen.Mehrjährige Erfahrung in den Produkt-Bereichen Leveraged Lending und/oder Structured Finance.Weitgehende analytische Fähigkeiten im Bereich Leveraged Lending und für die Strukturierung von High-Yield Transaktionen, Erstellung von Finanzprojektionen. Gutes Verständnis von makroökonomischen Sachverhalten.Kenntnisse der allgemeingültigen Leveraged Kreditvergaberichtlinien und Prozesse bei einer Bank (z.B. Anwendung von entsprechender Risikoeinschätzung und -rasterung) sowie der Kredit- und Marktrisiko Standards.Fähigkeit unter Zeitdruck zu arbeiten und sich gleichzeitig auf mehreren Transaktionen konzentrieren zu können.Hervoragende schriftliche und mündliche Kommunikationsfähigkeit auf Deutsch und Englisch.Was wir Ihnen bietenWir bieten eine breite Palette von Leistungen, die all Ihre beruflichen und persönlichen Bedürfnisse abdecken.Emotional ausgeglichenEine positive Haltung hilft uns, die Herausforderungen des Alltags zu meistern – beruflich wie privat. Profitieren Sie von Angeboten wie Beratung in schwierigen Lebenssituationen und Angeboten zur Förderung mentaler Gesundheit.Körperlich fitMit Angeboten zur Aufrechterhaltung Ihrer persönlichen Gesundheit und einem förderlichen beruflichen Umfeld hilft Ihnen die Bank, körperlich fit zu bleiben. Profitieren Sie von Angeboten wie umfangreichen Check-up Untersuchungen, Impfangeboten und Beratung zur gesunden Lebensführung.Sozial vernetztDer Austausch mit anderen eröffnet uns neue Perspektiven, bringt uns beruflich wie persönlich voran und stärkt unser Selbstvertrauen und Wohlbefinden. Profitieren Sie von Angeboten wie Unterstützung durch den pme Familienservice, das FitnessCenter Job, flexible Arbeitszeitmodelle (bspw. Teilzeit, Jobtandem, hybrides Arbeiten) sowie einer umfangreichen Kultur der Vielfalt, Chancengleichheit und Teilhabe.Finanziell abgesichertDie Bank sichert Sie nicht nur während Ihrer aktiven Karriere, sondern auch für die Zukunft finanziell ab und unterstützt Ihre Flexibilität sowie Mobilität – egal ob privat oder beruflich. Profitieren Sie von Angeboten wie Beitragsplänen für Altersvorsorge, Bankdienstleistungen für Mitarbeiter*innen, Firmenfahrrad oder dem Deutschlandticket.Da die Benefits je nach Standort geringfügig variieren, gehen Sie bitte bei konkreten Fragen auf Ihre Recruiter / Ihre Recruiterin zu.Die Stelle wird in Voll- und in Teilzeit angeboten.Bei Fragen zum Rekrutierungsprozess steht Ihnen Manuela Niedling gerne zur Verfügung.Kontakt Manuela Niedling: +49 173 1822591-------------------------------------------------------------------------------------------------------------------------------Details of the role and how it fits into the teamThe Risk division has a fundamental responsibility to protect the Bank. With group-wide responsibility for the management and control of credit, market, operational and reputational risks, we have a unique vantage point which allows us a holistic view of our businesses and our clients. Nearly 4,000 employees work together to achieve our ambition to be an industry-leading risk management organisation.Leveraged Lending is clearly defined as a product through ECB policy document, and further specified in the resulting DB product and process guidelines and integrated into existing risk management processes.Due to the high-risk classification of Leveraged Lending, this asset class requires specialized risk handling (currently managed within the CRM LSF unit); Leveraged Lending must follow specific due diligence as well as monitoring processes; including the use of a specific scorecard to determine the internal rating.As part of DB’s strategy to offer Leveraged Lending to our European large and medium-sized companies, CRM LSF is looking for a Credit Analyst to strengthen its European team.Your key responsibilitiesAs team member, based in Frankfurt, you will be responsible for the compliance with the defined Leveraged Lending risk processes for this business segment as well as the implementation of the applicable standards for credit assessment (market or DB risk appetite) and rating. As part of the wider CRM Leveraged Finance team, you will primarily take responsibility on Portfolio Management. Further, you will be involved in large national and cross boarder underwriting credit requests / transactions as credit analyst.Key responsibilities:Providing on-going portfolio monitoring of credits (ca. 30-40 counterparts) across a variety of industries. Maintaining data integrity in DB’s technology systems for all names / transactions in this portfolio.Generating reporting on the portfolio for internal processes.Analysing new Leveraged Finance transactions including Leveraged Buyouts, Mergers & Acquisitions (M&A) financing, Leveraged Loan participations, amend-to-extend and waiver requests.Reviewing and approving requests for FX/IR/commodity derivatives and transaction banking productsReview of credit reports throughout the entire credit process - starting with diligent analysis of first draft concluding with final version for approval with detailed credit recommendation, credit appetite and counterparty ratings. Providing credit approvals in line with individual credit authority and presenting to the Underwriting Committee for larger transactions.Participating in diverse internal projects that improve efficiency and helping Deutsche Bank to achieve key strategic objectives.Supporting the team’s interactions with internal and external auditors and regulatory authorities.Your skills and experiencesAcademic degree preferably in business or finance related field or equivalent experience/qualification.Preferably multi-year experience in product areas Leveraged Finance and/or Structured Finance.Excellent analytical skills, including Leveraged Loan and High Yield structuring, financial modelling / forecasting and understanding of derivative structures. Good understanding of macroeconomic drivers.Knowledge of generally applicable Leveraged Lending related policies and processes at a Bank (e.g.: application of the corresponding risk rating).Ability to work under time pressure and focus on multiple transactions at once.Excellent written and oral communication skills both in English and in German.What we offerWe provide you with a comprehensive portfolio of benefits and offerings to support both, your private and professional needs.Emotionally and mentally balancedA positive mind helps us master the challenges of everyday life – both professionally and privately. We offer consultation in difficult life situations as well as mental health awareness trainings.Physically thrivingWe support you in staying physically fit through an offering to maintain personal health and a professional environment. You can benefit from health check-ups; vaccination drives as well as advice on healthy living and nutrition.Socially connectedNetworking opens up new perspectives, helps us thrive professionally and personally as well as strengthens our self-confidence and well-being. You can benefit from PME family service, FitnessCenter Job, flexible working (e.g parttime, hybrid working, job tandem) as well as an extensive culture of diversity, equity and inclusion.Financially secureWe provide you with financial security not only during your active career but also for the future. You can benefit from offerings such as pension plans, banking services, company bicycle or “Deutschlandticket”.Since our offerings slightly vary across locations, please contact your recruiter with specific questions.This job is available in full and parttime.In case of any recruitment related questions, please get in touch with Manuela Niedling.Contact Manuela Niedling: +49 173 1822591 Wir streben eine Unternehmenskultur an, in der wir gemeinsam jeden Tag das Beste geben. Dazu gehören verantwortungsvolles Handeln, wirtschaftliches Denken, Initiative ergreifen und zielgerichtete Zusammenarbeit.Gemeinsam teilen und feiern wir die Erfolge unserer Mitarbeiter*innen. Gemeinsam sind wir die Deutsche Bank Gruppe.Wir begrüßen Bewerbungen von allen Menschen und fördern ein positives, faires und integratives Arbeitsumfeld.",
    "requirements": [
      "generally applicable Leveraged Lending related policies and processes at a Bank (e.g.: application of the corresponding risk rating).Ability to work under time pressure and focus on multiple transactions at once.Excellent written and oral communication skills both in English and in German.What we offerWe provide you with a comprehensive portfolio of benefits and offerings to support both",
      "product areas Leveraged Finance and/or Structured Finance.Excellent analytical skills"
    ],
    "location": {
      "city": "Frankfurt",
      "state": "Hessen",
      "country": "Deutschland",
      "remote_options": false
    },
    "employment_details": {
      "type": "Unbefristet",
      "schedule": "Vollzeit",
      "career_level": "Assistant Vice President",
      "salary_range": null,
      "benefits": []
    },
    "organization": {
      "name": "Deutsche Bank",
      "division": "Frankfurt",
      "division_id": 9
    },
    "posting_details": {
      "publication_date": "2025-07-01",
      "position_uri": "/index.php?ac=jobad&id=64841",
      "hiring_year": "2025"
    }
  },
  "evaluation_results": {
    "cv_to_role_match": null,
    "match_confidence": null,
    "evaluation_date": null,
    "evaluator": null,
    "domain_knowledge_assessment": null,
    "decision": {
      "apply": null,
      "rationale": null,
      "estimated_prep_time": null
    },
    "strengths": [],
    "weaknesses": []
  },
  "processing_log": [
    {
      "timestamp": "2025-07-04T06:42:44.641092",
      "action": "job_fetched",
      "processor": "enhanced_job_fetcher_v6.1",
      "status": "success",
      "details": "Successfully fetched job 64841 from Deutsche Bank API"
    },
    {
      "timestamp": "2025-07-04T06:42:44.641092",
      "action": "description_enriched",
      "processor": "web_scraper",
      "status": "success",
      "details": "Successfully fetched job description (11286 characters)"
    }
  ],
  "raw_source_data": {
    "api_response": {
      "MatchedObjectId": "64841",
      "MatchedObjectDescriptor": {
        "PositionOfferingType": [
          {
            "Name": "Unbefristet"
          }
        ],
        "PositionSchedule": [
          {
            "Name": "Vollzeit"
          }
        ],
        "PublicationChannel": [
          {
            "StartDate": "2025-07-01"
          }
        ],
        "PositionTitle": "Credit Analyst – CRM Leveraged and Structured Finance (f/m/x)",
        "PositionLocation": [
          {
            "CityName": "Frankfurt",
            "CountrySubDivisionName": "Hessen",
            "CountryName": "Deutschland"
          }
        ],
        "PositionURI": "/index.php?ac=jobad&id=64841",
        "PositionID": "64841",
        "OrganizationName": "Frankfurt",
        "PositionHiringYear": "2025",
        "UserArea": {
          "ProDivision": 9
        },
        "CareerLevel": [
          {
            "Name": "Assistant Vice President"
          }
        ],
        "PublicationStartDate": "2025-07-01"
      },
      "RelevanceScore": 0,
      "RelevanceRank": 9
    },
    "specialist_analysis": {},
    "description_source": "web_scraping"
  }
}