{
  "job_metadata": {
    "job_id": "65048",
    "version": "1.0",
    "created_at": "2025-07-10T11:36:19.264830",
    "last_modified": "2025-07-10T11:36:19.264830",
    "source": "deutsche_bank_api",
    "processor": "enhanced_job_fetcher_v6.1",
    "status": "fetched"
  },
  "job_content": {
    "title": "Program Director – AI-enabled Core Banking Renewal (Strategic Program Lead) (f/m/x)",
    "description": "Program Director – AI-enabled Core Banking Renewal (Strategic Program Lead) (f/m/x) Job ID:R0395143 Full/Part-Time: Full-time Regular/Temporary: Regular Listed: 2025-07-08 Location: Frankfurt Position Overview About PB TransformationPB Transformation runs Private Bank global change portfolio. We are distributed around the world, across all regions where we operate. Within our organization, everyone is empowered to shape and drive the transformation in line with Business and Technology strategic goals by fostering innovation. We are leveraging the latest technologies to modernize our products and processes by enhancing the way in which we serve our clients.Join us on one of the most transformative journeys in banking today. As part of our AI-enabled PB core platform renewal, we’re reimagining how banking infrastructure operates — intelligent, adaptive, and real-time at its foundation.To make this vision actionable and scalable, we are strategically structuring the Target Operating Modell transformation into focused, modular programs, each driving critical pillars of change. As Program Director, you will lead one of these flagship initiatives — delivering a distinct, high-impact slice of the core renewal, with a strong emphasis on AI built into the platform itself, not as an add-on.Your key responsibilitiesTake ownership of one of several interlinked transformation tracks (e.g., product engine renewal, intelligent transaction processing, etc)Deliver outcomes aligned to the broader Target Operating Model vision, with clear accountability, autonomy, and strategic visibilityShape roadmaps and execution plans that are outcome driven, measurable, and capable of scaling across the bank.Lead delivery of AI-embedded capabilities as native components of the core banking fabric — from intelligent orchestration and autonomous decisioning to real-time data integrationEnsure that machine learning and data science models are not isolated use cases, but intrinsic to platform operation and resiliencePartner with other Program Directors, architecture leaders, and business sponsors to ensure cross-program alignment.Operate in a networked leadership environment — shaping your own program while contributing to the success of the broader initiativeYour skills and experiencesMaster’s degree in Business, Engineering, Computer Science, or a related field15+ years of experience leading complex technology initiatives in banking, fintech, or enterprise platformsDeep exposure to Banking core banking transformation, especially involving modular architectures, real-time systemsStrong understanding of banking operations, digital transformation, and regulatory environments as well AIProficiency in agile, hybrid, and traditional program management frameworksExceptional stakeholder management, communication, and influencing skills at the executive levelStrategic mindset with a hands-on, delivery-oriented approachStrong leadership in matrixed environments, managing internal and external teams, vendors, and senior stakeholdersConfidence navigating both legacy environments and next-generation platform thinking (e.g., cloud-native, API-first, event-driven)Fluent written and oral communication in English and GermanWhat we offerWe provide you with a comprehensive portfolio of benefits and offerings to support both, your private and professional needs.Emotionally and mentally balancedA positive mind helps us master the challenges of everyday life – both professionally and privately. We offer consultation in difficult life situations as well as mental health awareness trainings.Physically thrivingWe support you in staying physically fit through an offering to maintain personal health and a professional environment. You can benefit from health check-ups; vaccination drives as well as advice on healthy living and nutrition.Socially connectedNetworking opens up new perspectives, helps us thrive professionally and personally as well as strengthens our self-confidence and well-being. You can benefit from PME family service, FitnessCenter Job, flexible working (e.g parttime, hybrid working, job tandem) as well as an extensive culture of diversity, equity and inclusion.Financially secureWe provide you with financial security not only during your active career but also for the future. You can benefit from offerings such as pension plans, banking services, company bicycle or “Deutschlandticket”.Since our offerings slightly vary across locations, please contact your recruiter with specific questions.This job is available in full and parttime.In case of any recruitment related questions, please get in touch with Vanessa Lips.Contact Vanessa Lips: +49 69 910-34272 Wir streben eine Unternehmenskultur an, in der wir gemeinsam jeden Tag das Beste geben. Dazu gehören verantwortungsvolles Handeln, wirtschaftliches Denken, Initiative ergreifen und zielgerichtete Zusammenarbeit.Gemeinsam teilen und feiern wir die Erfolge unserer Mitarbeiter*innen. Gemeinsam sind wir die Deutsche Bank Gruppe.Wir begrüßen Bewerbungen von allen Menschen und fördern ein positives, faires und integratives Arbeitsumfeld.",
    "requirements": [],
    "location": {
      "city": "Frankfurt",
      "state": "Hessen",
      "country": "Deutschland",
      "remote_options": false
    },
    "employment_details": {
      "type": "Unbefristet",
      "schedule": "Vollzeit",
      "career_level": "Director",
      "salary_range": null,
      "benefits": []
    },
    "organization": {
      "name": "Deutsche Bank",
      "division": "Frankfurt",
      "division_id": 10032
    },
    "posting_details": {
      "publication_date": "2025-07-08",
      "position_uri": "/index.php?ac=jobad&id=65048",
      "hiring_year": "2025"
    }
  },
  "evaluation_results": {
    "cv_to_role_match": null,
    "match_confidence": null,
    "evaluation_date": null,
    "evaluator": null,
    "domain_knowledge_assessment": null,
    "decision": {
      "apply": null,
      "rationale": null,
      "estimated_prep_time": null
    },
    "strengths": [],
    "weaknesses": []
  },
  "processing_log": [
    {
      "timestamp": "2025-07-10T11:36:19.264830",
      "action": "job_fetched",
      "processor": "enhanced_job_fetcher_v6.1",
      "status": "success",
      "details": "Successfully fetched job 65048 from Deutsche Bank API"
    },
    {
      "timestamp": "2025-07-10T11:36:19.264830",
      "action": "description_enriched",
      "processor": "web_scraper",
      "status": "success",
      "details": "Successfully fetched job description (5132 characters)"
    }
  ],
  "raw_source_data": {
    "api_response": {
      "MatchedObjectId": "65048",
      "MatchedObjectDescriptor": {
        "PositionOfferingType": [
          {
            "Name": "Unbefristet"
          }
        ],
        "PositionSchedule": [
          {
            "Name": "Vollzeit"
          }
        ],
        "PublicationChannel": [
          {
            "StartDate": "2025-07-08"
          }
        ],
        "PositionTitle": "Program Director – AI-enabled Core Banking Renewal (Strategic Program Lead) (f/m/x)",
        "PositionLocation": [
          {
            "CityName": "Frankfurt",
            "CountrySubDivisionName": "Hessen",
            "CountryName": "Deutschland"
          }
        ],
        "PositionURI": "/index.php?ac=jobad&id=65048",
        "PositionID": "65048",
        "OrganizationName": "Frankfurt",
        "PositionHiringYear": "2025",
        "UserArea": {
          "ProDivision": 10032
        },
        "CareerLevel": [
          {
            "Name": "Director"
          },
          {
            "Name": "Director"
          }
        ],
        "PublicationStartDate": "2025-07-08"
      },
      "RelevanceScore": 0,
      "RelevanceRank": 3
    },
    "specialist_analysis": {},
    "description_source": "web_scraping"
  }
}