{
  "job_metadata": {
    "job_id": "62800",
    "version": "1.0",
    "created_at": "2025-07-10T11:38:01.045913",
    "last_modified": "2025-07-10T11:38:01.045913",
    "source": "deutsche_bank_api",
    "processor": "enhanced_job_fetcher_v6.1",
    "status": "fetched"
  },
  "job_content": {
    "title": "IFRS Reporting Manager (f/m/x)",
    "description": "IFRS Reporting Manager (f/m/x) Job ID:R0376954 Full/Part-Time: Full-time Regular/Temporary: Regular Listed: 2025-07-07 Location: Frankfurt Position Overview *English version below*Rollenbeschreibung und TeamdetailsAls Financial and Regulatory Reporting Senior Analyst (IFRS Financial Reporting) übernehmen Sie eine zentrale Rolle in der Erstellung und Weiterentwicklung der externen Finanzberichterstattung des Deutsche Bank Konzerns nach internationalen Rechnungslegungsstandards (IFRS). Sie arbeiten eng mit internen Fachabteilungen und externen Partnern zusammen und gestalten aktiv Veränderungsprozesses im Finanzbereich mit.Ihre HauptaufgabenVerantwortung für die termingerechte Erstellung wesentlicher Teile der quartärlichen und jährlichen Berichterstattung für den Deutsche Bank Konzern nach IFRSAnalyse und Kommentierung von KonzernkennzahlenMitwirkung bei der Erstellung des Konzernabschlusses nach IFRS, der Anhangangaben sowie des KonzernlageberichtsVerantwortung für die Erstellung wichtiger Präsentationen zu Themen der BerichterstattungUmfassende Kommunikation und Partnerschaft mit einem sehr anspruchsvollen internen und externen AdressatenkreisMitwirkung bei Projekten im Finanzbereich sowie der Weiterentwicklung von Reportingprozessen und -toolsIhre Fähigkeiten und ErfahrungenAbgeschlossenes wirtschaftswissenschaftliches Studium mit Schwerpunkt Rechnungswesen, Finanzen oder ControllingMehrjährige Erfahrung im Bereich Konzernrechnungslegung, IFRS-Reporting oder WirtschaftsprüfungFundierte Kenntnisse der IFRS sowie ein gutes Verständnis für Konzernstrukturen und -prozesseIdealerweise Erfahrung in der fachlichen Führung von Mitarbeitern oder ProjektteamsPräsentationsfähigkeiten, analytische Denkweise, strukturierte Arbeitsweise und hohe EigeninitiativeAusgeprägte Problemlösungsfähigkeiten; Teamplayer/-in, der/die ein eigenes Netzwerk mitbringtExzellente Kommunikationsfähigkeiten in Englisch und Deutsch (mündlich und schriftlich)Was wir Ihnen bietenWir bieten eine breite Palette von Leistungen, die all Ihre beruflichen und persönlichen Bedürfnisse abdecken.Emotional ausgeglichenEine positive Haltung hilft uns, die Herausforderungen des Alltags zu meistern – beruflich wie privat. Profitieren Sie von Angeboten wie Beratung in schwierigen Lebenssituationen und Angeboten zur Förderung mentaler Gesundheit.Körperlich fitMit Angeboten zur Aufrechterhaltung Ihrer persönlichen Gesundheit und einem förderlichen beruflichen Umfeld hilft Ihnen die Bank, körperlich fit zu bleiben. Profitieren Sie von Angeboten wie umfangreichen Check-up Untersuchungen, Impfangeboten und Beratung zur gesunden Lebensführung.Sozial vernetztDer Austausch mit anderen eröffnet uns neue Perspektiven, bringt uns beruflich wie persönlich voran und stärkt unser Selbstvertrauen und Wohlbefinden. Profitieren Sie von Angeboten wie Unterstützung durch den pme Familienservice, das FitnessCenter Job, flexible Arbeitszeitmodelle (bspw. Teilzeit, Jobtandem, hybrides Arbeiten) sowie einer umfangreichen Kultur der Vielfalt, Chancengleichheit und Teilhabe.Finanziell abgesichertDie Bank sichert Sie nicht nur während Ihrer aktiven Karriere, sondern auch für die Zukunft finanziell ab und unterstützt Ihre Flexibilität sowie Mobilität – egal ob privat oder beruflich. Profitieren Sie von Angeboten wie Beitragsplänen für Altersvorsorge, Bankdienstleistungen für Mitarbeiter*innen, Firmenfahrrad oder dem Deutschlandticket.Da die Benefits je nach Standort geringfügig variieren, gehen Sie bitte bei konkreten Fragen auf Ihren Recruiter / Ihre Recruiterin zu.Die Stelle wird in Voll- und in Teilzeit angeboten.Bei Fragen zum Rekrutierungsprozess steht Ihnen Evangelia Tseliou gerne zur Verfügung.Kontakt Evangelia Tseliou: +49 69 910-45463************************************************************Job description and Team detailsAs a Financial and Regulatory Reporting Senior Analyst (IFRS Financial Reporting), you will play a key role in the preparation and development of the Deutsche Bank Group's external financial reporting in accordance with international accounting standards (IFRS). You will work closely with internal departments and external stakeholders and actively contribute to process improvements in the Finance organization.Your main responsibilitiesResponsible for the timely preparation of key parts of the quarterly and annual reporting for Deutsche Bank Group in accordance with IFRSAnalyse and prepare commentary on the Group’s key financial figuresSupport in the preparation of the consolidated financial statements, the notes to the financial statements and the Group management reportResponsible for the preparation of key presentations on reporting topicsManage the communication and partnership with a very demanding internal and external stakeholder groupParticipate in projects in the Finance organization as well as the support the development of reporting processes and toolsYour skills and experienceMaster degree in economics with a focus on accounting, finance or controllingSeveral years of professional experience in Group accounting, IFRS reporting or auditingSound knowledge of IFRS as well as a good understanding of Group structures and processesIdeally, experience in the managing teams or projectsPresentation skills, analytical thinking, structured working method and high level of self-initiativeStrong problem-solving skills; team player who brings their own networkExcellent communication skills in English and German (oral and written)What we offerWe provide you with a comprehensive portfolio of benefits and offerings to support both, your private and professional needs.Emotionally and mentally balancedA positive mind helps us master the challenges of everyday life – both professionally and privately. We offer consultation in difficult life situations as well as mental health awareness trainings.Physically thrivingWe support you in staying physically fit through an offering to maintain personal health and a professional environment. You can benefit from health check-ups; vaccination drives as well as advice on healthy living and nutrition.Socially connectedNetworking opens up new perspectives, helps us thrive professionally and personally as well as strengthens our self-confidence and well-being. You can benefit from PME family service, FitnessCenter Job, flexible working (e.g parttime, hybrid working, job tandem) as well as an extensive culture of diversity, equity and inclusion.Financially secureWe provide you with financial security not only during your active career but also for the future. You can benefit from offerings such as pension plans, banking services, company bicycle or “Deutschlandticket”.Since our offerings slightly vary across locations, please contact your recruiter with specific questions.This job is available in full and parttime.In case of any recruitment related questions, please get in touch with Evangelia Tseliou.Contact Evangelia Tseliou: +49 69 910-45463 Wir streben eine Unternehmenskultur an, in der wir gemeinsam jeden Tag das Beste geben. Dazu gehören verantwortungsvolles Handeln, wirtschaftliches Denken, Initiative ergreifen und zielgerichtete Zusammenarbeit.Gemeinsam teilen und feiern wir die Erfolge unserer Mitarbeiter*innen. Gemeinsam sind wir die Deutsche Bank Gruppe.Wir begrüßen Bewerbungen von allen Menschen und fördern ein positives, faires und integratives Arbeitsumfeld.",
    "requirements": [
      "Group accounting",
      "IFRS as well as a good understanding of Group structures and processesIdeally",
      "the managing teams or projectsPresentation skills"
    ],
    "location": {
      "city": "Frankfurt",
      "state": "Hessen",
      "country": "Deutschland",
      "remote_options": false
    },
    "employment_details": {
      "type": "Unbefristet",
      "schedule": "Vollzeit",
      "career_level": "Assistant Vice President",
      "salary_range": null,
      "benefits": []
    },
    "organization": {
      "name": "Deutsche Bank",
      "division": "Frankfurt",
      "division_id": 8
    },
    "posting_details": {
      "publication_date": "2025-07-07",
      "position_uri": "/index.php?ac=jobad&id=62800",
      "hiring_year": "2025"
    }
  },
  "evaluation_results": {
    "cv_to_role_match": null,
    "match_confidence": null,
    "evaluation_date": null,
    "evaluator": null,
    "domain_knowledge_assessment": null,
    "decision": {
      "apply": null,
      "rationale": null,
      "estimated_prep_time": null
    },
    "strengths": [],
    "weaknesses": []
  },
  "processing_log": [
    {
      "timestamp": "2025-07-10T11:38:01.045913",
      "action": "job_fetched",
      "processor": "enhanced_job_fetcher_v6.1",
      "status": "success",
      "details": "Successfully fetched job 62800 from Deutsche Bank API"
    },
    {
      "timestamp": "2025-07-10T11:38:01.045913",
      "action": "description_enriched",
      "processor": "web_scraper",
      "status": "success",
      "details": "Successfully fetched job description (7392 characters)"
    }
  ],
  "raw_source_data": {
    "api_response": {
      "MatchedObjectId": "62800",
      "MatchedObjectDescriptor": {
        "PositionOfferingType": [
          {
            "Name": "Unbefristet"
          }
        ],
        "PositionSchedule": [
          {
            "Name": "Vollzeit"
          }
        ],
        "PublicationChannel": [
          {
            "StartDate": "2025-07-07"
          }
        ],
        "PositionTitle": "IFRS Reporting Manager (f/m/x)",
        "PositionLocation": [
          {
            "CityName": "Frankfurt",
            "CountrySubDivisionName": "Hessen",
            "CountryName": "Deutschland"
          }
        ],
        "PositionURI": "/index.php?ac=jobad&id=62800",
        "PositionID": "62800",
        "OrganizationName": "Frankfurt",
        "PositionHiringYear": "2025",
        "UserArea": {
          "ProDivision": 8
        },
        "CareerLevel": [
          {
            "Name": "Assistant Vice President"
          }
        ],
        "PublicationStartDate": "2025-07-07"
      },
      "RelevanceScore": 0,
      "RelevanceRank": 10
    },
    "specialist_analysis": {},
    "description_source": "web_scraping"
  }
}