{
  "job_metadata": {
    "job_id": "63715",
    "version": "1.0",
    "created_at": "2025-07-10T12:15:05.562734",
    "last_modified": "2025-07-10T12:15:05.562734",
    "source": "deutsche_bank_api",
    "processor": "enhanced_job_fetcher_v6.1",
    "status": "fetched"
  },
  "job_content": {
    "title": "DWS - Senior Asset Manager &amp; Team Lead Real Estate (m/f/d)",
    "description": "DWS - Senior Asset Manager & Team Lead Real Estate (m/f/d) Job ID:R0391905 Full/Part-Time: Full-time Regular/Temporary: Regular Listed: 2025-05-27 Location: Frankfurt Position Overview Über die DWSHeutzutage sind die Märkte einer ganzen Reihe von Risiken ausgesetzt - aber auch einer ganzen Reihe von Chancen. Die Chance, anders zu innovieren. Die Chance, verantwortungsvoll zu investieren. Und die Chance, etwas zu verändern.Kommen Sie zu DWS und werden Sie Teil eines branchenführenden Unternehmens mit globaler Präsenz. Hier werden Sie bestärkt, ehrgeizige Programme zu leiten, um die Zukunft des Investierens zu gestalten und unsere Kunden, lokale Gemeinschaften und die Umwelt zu unterstützen.Wir suchen kreative Denker und Innovatoren, um die Chancen von morgen zu nutzen und die bestmögliche Grundlage für die finanzielle Zukunft unserer Kunden zu schaffen. Aus diesem Grund sind wir \"Investors for a new now\".Im Gegenzug bieten wir Ihnen die Plattform, die Sie brauchen, um etwas zu bewirken, indem Sie mit einigen der größten Vordenker der Branche zusammenarbeiten.Das ist Ihre Chance, Ihre Ziele zu erreichen und eine außergewöhnliche Karriere zu führen. Das ist Ihre Chance, in Ihre Zukunft zu investieren.Lesen Sie hier mehr über DWS und wer wir sind (www.dws.com/de-de/)Team- / Divisionbeschreibung Sie arbeiten im Team in Frankfurt für die Europäische Asset Management Plattform der DWS mit weiteren Büros in London, Paris, Madrid, Mailand und Warschau. Das Frankfurter Team verantwortet ein Portfolio aus Gewerbe- und Wohnimmobilien im Volumen von ca. 7,4 Mrd. Euro für alle DWS-Fonds, die in Deutschland investieren.Rollenbeschreibung Wir suchen einen Senior Asset Manager (m/f/d) und Team Lead Real Estate mit Fokus Handel/Shopping Center.Zu Ihren Aufgaben gehören:Führen eines Teams von 5 Asset Managern. Die Berichtslinie erfolgt an den Head of Asset Management Germany (DACH)Asset Management von nationalen gewerblichen Immobilien mit Fokus auf Handel und Shopping-Center – gehalten von Offenen Immobilienfonds und Spezialfonds der DWS.Implementierung von Nachhaltigkeitszielen der DWS Real Estate im zugeordneten Teilportpolio sowie Umsetzung von definierten ESG-Maßnahmen ggf. in Zusammenarbeit mit externen PartnernÜbernahme der Verantwortung für die Performance Ihrer Assets und dabei insbesondere Identifikation von Entwicklungspotenzialen und deren Umsetzung – bis hin zum Management von Restrukturierungen.Identifizierung und Berücksichtigung von Trends und Marktentwicklungen in der strategischen Ausrichtung der Immobilieninvestition.Auswahl, Vergabe und aktive Steuerung und Kontrolle der externen Dienstleister - insbesondere von Center-Managern, Vermietungsmanagern, kaufmännischen und technischen Property-Managern, Technischen Beratern, Architekten und Ingenieure, Rechts- und Steuerberatern.Immobilien- und finanzwirtschaftliche Optimierung der Ihnen zugeordneten Objekte, sowie Rendite- und Wirtschaftlichkeitsberechnungen z.B. mithilfe von DCF-Analysen.Erstellung von Budgets und Businessplänen sowie Hold-Sell-Analysen, verbunden mit regelmäßigen Quartals-Reportings an das Funds Management, sowie der stetigen Identifikation von Kostentreibern und renditemindernden Faktoren.Wahrnehmung der Bauherrenfunktion bei Ausbau- und Modernisierungsmaßnahmen sowie Projektentwicklungen ebenso wie Unterstützung des Transaktionsmanagements bei Verkäufen und Ankäufen.Wir suchenErfolgreich abgeschlossenes (Fach-)Hochschulstudium der Wirtschaftswissenschaften, der Immobilienökonomie ggf. mit Zusatzqualifikation im Immobilienbereich (Master of Real Estate, Immobilienökonom, RICS usw.).mehrjährige Berufserfahrung in der ganzheitlichen Betreuung von Immobilien und/oder Nachweis von Immobilienerfahrung durch entsprechende Praktika.Kaufmännisches Verständnis und sicherer Umgang mit Cashflow-Modellen.Führungserfahrung in managen eines TeamsKreativität, eine selbstständige Arbeitsweise und hohes Engagement für die Aufgabe.Überzeugendes Auftreten verbunden mit starken kommunikativen und analytischen Fähigkeiten.Verhandlungssichere Deutschkenntnisse und sehr gutes Englisch in Wort und Schrift.Fundierte Erfahrung im Management von Immobilen mit Einzelhandelsnutzung oder Shopping Centern, Erfahrung im Management von Immobilien der Asset Klassen Health Care und Residential ist wünschenswert.Ausschreibungszeitraum: 27.05.2025 bis auf WeiteresWir bieten Ihnen:Ohne den Ehrgeiz unserer Mitarbeiter wären unsere Erfolge nicht möglich. Und es ist uns wichtig, dass Sie gerne zur Arbeit kommen – gesund, glücklich und wertgeschätzt. Bei der DWS haben Sie Zugriff auf eine Reihe von Benefits, aus denen Sie wählen können und die speziell auf Ihren Lebensstil abgestimmt sind. Egal, ob Sie sich für die Gesundheitsversorgung oder betriebliche Vergünstigungen interessieren oder über Ihre Altersvorsorge nachdenken, es ist für jeden etwas dabei.Einige unserer Benefits:Leistungen zur körperlichen und geistigen Gesundheit, einschließlich (aber nicht beschränkt auf) der gesetzlichen Krankenversicherung (BKK), Krankengeld und Support-Hotlines für MitarbeiterFamilienfreundliche Leistungen, einschließlich großzügiger Elternzeitpakete (unterstützt alle Varianten von Familienformen) und Unterstützung bei der Suche nach Kinderbetreuungsmöglichkeiten, einschließlich des DWS-eigenen KindergartenservicesEine Vielzahl an Pensionsplänen, persönlichen Budgetkonten zur Ermöglichung von Sabbaticals oder vorzeitigem Ruhestand sowie vermögenswirksamen LeistungenDie Möglichkeit, unsere CSR-Strategie zu unterstützen, die sich auf die Bekämpfung des Klimawandels und die Erreichung größerer sozialer Gerechtigkeit konzentriert. Sie können an unsere Partnerorganisationen spenden oder sich an Corporate-Volunteering-Möglichkeiten in Ihren lokalen Gemeinden beteiligen, indem Sie uns vor Ort unterstützenLeistungen zur Mobilität, beispielsweise ein subventioniertes Deutschlandticket sowie Angebote zu Firmenwagen und JobRadDas aktuelle Hybrid-Arbeitsmodell der DWS ist darauf ausgelegt, die Balance zwischen persönlicher Zusammenarbeit und Engagement im Büro zu finden, die den Kern unserer Arbeitskultur ausmacht. Wir setzen uns für die Unterstützung flexibler und hybrider Arbeitsvereinbarungen auf der ganzen Welt ein. Abhängig von dem Standort oder der Stelle, auf die Sie sich bewerben, wird die Aufteilung zwischen der Arbeit im Büro und der Arbeit zu Hause im Rahmen Ihres Bewerbungs- und Interviewprozesses besprochen.Wir werden unsere Arbeitsumgebungen und -methoden weiterhin überprüfen und weiterentwickeln, um bestmögliche Arbeitsbedingungen für unsere Mitarbeiter zu schaffen.Wenn Sie aus irgendeinem Grund, einschließlich oder im Zusammenhang mit einer Behinderung oder einem langfristigen Gesundheitszustand, Anpassungen oder Änderungen am Bewerbungsprozess benötigen, wenden Sie sich bitte an Ihren Recruiter und teilen Sie uns mit, welche Unterstützung Sie möglicherweise benötigen. Beispiele für Anpassungen sind die Änderung des Interviewformats oder die Bereitstellung von Unterstützung in den Räumlichkeiten der DWS. Dies hat keine Auswirkungen auf Ihre Bewerbung und Ihr Rekrutierungsteam wird die Optionen mit Ihnen besprechen.#LI-EL1 #LI-03 Wir streben eine Unternehmenskultur an, in der wir gemeinsam jeden Tag das Beste geben. Dazu gehören verantwortungsvolles Handeln, wirtschaftliches Denken, Initiative ergreifen und zielgerichtete Zusammenarbeit.Gemeinsam teilen und feiern wir die Erfolge unserer Mitarbeiter*innen. Gemeinsam sind wir die Deutsche Bank Gruppe.Wir begrüßen Bewerbungen von allen Menschen und fördern ein positives, faires und integratives Arbeitsumfeld.",
    "requirements": [],
    "location": {
      "city": "Frankfurt",
      "state": "Hessen",
      "country": "Deutschland",
      "remote_options": false
    },
    "employment_details": {
      "type": "Unbefristet",
      "schedule": "Vollzeit",
      "career_level": "Vice President",
      "salary_range": null,
      "benefits": []
    },
    "organization": {
      "name": "Deutsche Bank",
      "division": "Frankfurt",
      "division_id": 4
    },
    "posting_details": {
      "publication_date": "2025-05-27",
      "position_uri": "/index.php?ac=jobad&id=63715",
      "hiring_year": "2025"
    }
  },
  "evaluation_results": {
    "cv_to_role_match": null,
    "match_confidence": null,
    "evaluation_date": null,
    "evaluator": null,
    "domain_knowledge_assessment": null,
    "decision": {
      "apply": null,
      "rationale": null,
      "estimated_prep_time": null
    },
    "strengths": [],
    "weaknesses": []
  },
  "processing_log": [
    {
      "timestamp": "2025-07-10T12:15:05.562734",
      "action": "job_fetched",
      "processor": "enhanced_job_fetcher_v6.1",
      "status": "success",
      "details": "Successfully fetched job 63715 from Deutsche Bank API"
    },
    {
      "timestamp": "2025-07-10T12:15:05.562734",
      "action": "description_enriched",
      "processor": "web_scraper",
      "status": "success",
      "details": "Successfully fetched job description (7616 characters)"
    }
  ],
  "raw_source_data": {
    "api_response": {
      "MatchedObjectId": "63715",
      "MatchedObjectDescriptor": {
        "PositionOfferingType": [
          {
            "Name": "Unbefristet"
          }
        ],
        "PositionSchedule": [
          {
            "Name": "Vollzeit"
          }
        ],
        "PublicationChannel": [
          {
            "StartDate": "2025-05-27"
          }
        ],
        "PositionTitle": "DWS - Senior Asset Manager &amp; Team Lead Real Estate (m/f/d)",
        "PositionLocation": [
          {
            "CityName": "Frankfurt",
            "CountrySubDivisionName": "Hessen",
            "CountryName": "Deutschland"
          }
        ],
        "PositionURI": "/index.php?ac=jobad&id=63715",
        "PositionID": "63715",
        "OrganizationName": "Frankfurt",
        "PositionHiringYear": "2025",
        "UserArea": {
          "ProDivision": 4
        },
        "CareerLevel": [
          {
            "Name": "Vice President"
          }
        ],
        "PublicationStartDate": "2025-05-27"
      },
      "RelevanceScore": 0,
      "RelevanceRank": 51
    },
    "specialist_analysis": {},
    "description_source": "web_scraping"
  }
}