{
  "job_metadata": {
    "job_id": "63626",
    "version": "1.0",
    "created_at": "2025-07-10T12:18:00.238172",
    "last_modified": "2025-07-10T12:18:00.238172",
    "source": "deutsche_bank_api",
    "processor": "enhanced_job_fetcher_v6.1",
    "status": "fetched"
  },
  "job_content": {
    "title": "DWS - Senior Operations Analyst - Tax Reclaim (m/w/d)",
    "description": "DWS - Senior Operations Analyst - Tax Reclaim (m/w/d) Job ID:R0378071 Full/Part-Time: Full-time Regular/Temporary: Regular Listed: 2025-05-22 Location: Frankfurt Position Overview Über die DWSHeutzutage sind die Märkte einer ganzen Reihe von Risiken ausgesetzt - aber auch einer ganzen Reihe von Chancen. Die Chance, anders zu innovieren. Die Chance, verantwortungsvoll zu investieren. Und die Chance, etwas zu verändern.Kommen Sie zu DWS und werden Sie Teil eines branchenführenden Unternehmens mit globaler Präsenz. Hier werden Sie bestärkt, ehrgeizige Programme zu leiten, um die Zukunft des Investierens zu gestalten und unsere Kunden, lokale Gemeinschaften und die Umwelt zu unterstützen.Wir suchen kreative Denker und Innovatoren, um die Chancen von morgen zu nutzen und die bestmögliche Grundlage für die finanzielle Zukunft unserer Kunden zu schaffen. Aus diesem Grund sind wir \"Investors for a new now\".Im Gegenzug bieten wir Ihnen die Plattform, die Sie brauchen, um etwas zu bewirken, indem Sie mit einigen der größten Vordenker der Branche zusammenarbeiten.Das ist Ihre Chance, Ihre Ziele zu erreichen und eine außergewöhnliche Karriere zu führen. Das ist Ihre Chance, in Ihre Zukunft zu investieren.Lesen Sie hier mehr über DWS und wer wir sind.Das TeamDas Team Tax Reclaim ist Teil der Abteilung Tax Operations EMEA und im Bereich Investment Operations der DWS angesiedelt. Das Team ist die zentrale Steuerungseinheit innerhalb Tax Operations EMEA, in welchem die Schlüsselelemente des Prozess-, Projekt- und Vendor-Managements in Bezug auf das globale Tax Reclaim zusammenlaufen.Das Team ist dafür verantwortlich sämtliche Quellensteuervorabbefreiungs- und Quellensteuerrückforderungsprozesse nach Doppelbesteuerungsabkommen als auch nach der Rechtssache „FokusBank“ - insbesondere in Finnland, Frankreich, Deutschland, Italien, Niederlande, Norwegen, Polen, Portugal, Spanien und Schweden - für deutsche, luxemburgische und irische Wertpapierfonds der DWS - zu koordinieren. Hierbei sind Abstimmungen mit der Produktsteuerabteilung zur Ermittlung der relevanten Investmentfonds vorzunehmen, neue steuerliche Anforderungen in den jeweiligen (und ggf. neuen Ländern) in Zusammenarbeit mit der Produktsteuerabteilung und externen Verwahrstellen und Beratern zu erörtern, lokale Steuerberatungsgesellschaften zu wählen und zu mandatieren und im Rahmen einer umfassenden Prozesssteuerung die rechtzeitige Einreichung der Quellensteuervorabbefreiungs- und Quellensteuerrückforderungsanträge sicherzustellen.Darüber hinaus sind Projekte zur Steigerung der internen Prozess- und Leistungseffizienz sowie zur Risikominimierung anzustoßen und mit ggf. anderen Stakeholdern innerhalb der DWS Operations und Tech Division zu koordinieren. Weiterhin werden durch das Team Anfragen sowohl von Kunden als auch internen (Front-Office-)Abteilungen vorbereitet.Sie arbeiten in der Rolle als Senior Operations Analyst eines spezialisierten Teams mit Experten im Gebiet der internationalen Besteuerung von Investmentfonds zusammen.Aufgaben:Selbstverantwortliche Tätigkeit im Bereich Tax Reclaim einem spezialisierten Team aus Experten im Bereich der globalen Besteuerung von InvestmentfondsKoordinierung und prozessuale/operative Umsetzung von gesetzlichen Anforderungen aus DoppelbesteuerungsabkommenAbstimmung der steuerfachlichen Anforderungen und Fristen mit lokalen Steuerberatungsgesellschaften und der ProduktsteuerabteilungSicherstellung, der fristgerechten Datenbeschaffung unter Einbezug von in- und externen Stakeholdern (zB Front-Office-Einheiten, Verwahrstellen, Fondsadministratoren, etc).Entwicklung, Umsetzung und fortlaufende Prozessanalyse zur Erarbeitung von Lösungsansätzen mit dem Ziel der Überwachung und Reduzierung von operationellen Risiken sowie Steigerung der aktuellen EffizienzBeantwortung von internen (Front-/Middle- und Back-Office Abteilungen) und externen (Kunden, Regulatoren, Steuerbehörden, Steuerberatungsgesellschaften, Verwahrstellen, etc) in Bezug auf sämtliche Tax Reclaim-ProzesseUnterstützung und Orientierungshilfen für Kollegen und Funktionsteams innerhalb des eigenen Verantwortungsbereichs, mit dem Ziel, ein Umfeld der kontinuierlichen Verbesserung zu schaffen und zu pflegenAnforderungen:Kenntnisse über die operative Tätigkeit einer KVG sowie über die Zusammenhänge der beteiligten Geschäftspartner (Anleger, Verwahrstelle, KVG, Fondsmanager, Broker etc.)Routine im Umgang mit MS Office (Excel, Word, Power Point, Outlook, One Drive, Teams) - zusätzliche VBA-Kenntnisse wünschenswert, aber nicht notwendigEinschlägige Erfahrung im Bereich der Besteuerung von Investmentfonds im internationalen Kontext wünschenswert aber nicht vorausgesetztAusgeprägte Selbstverantwortung und hervorragende (eigen-)organisatorische Fähigkeiten, mit denen die Koordination der verschiedenen Stakeholder und die fristgerechte Bearbeitung der steuerlichen Anforderungen sichergestellt werden kannÜberdurchschnittliche kommunikative Fähigkeiten in Deutsch und Englisch (verhandlungssicher in Wort und Schrift)Fähigkeit unter hohen (Zeit-)Druck, den Überblick zu bewahren und qualitative Ergebnisse zu liefernHohe Auffassungsgabe zur schnellen Erfassung der zahlreichen, verschiedenen steuerlichen AnforderungenFähigkeit selbständig Lösungsvorschläge zu entwickeln und eigeninitiativ umzusetzenHerausragende analytische Fähigkeiten, strukturierte Herangehensweise bei der ProblemlösungSehr gute Kenntnisse der deutschen und englischen (Fach-) Sprache in Wort und SchriftFähigkeit, in einer sich rasant entwickelnden Umgebung zu arbeiten, mit einer sich ständig ändernden steuerlichen und regulatorischen Gesetzgebung eigeninitiativ auseinanderzusetzen und mit technischen Innovationen mitzuhaltenAusgezeichnete Teamfähigkeit, d.h. Aufgeschlossenheit und Fähigkeit, innerhalb des Teams Informationen auszutauschen sowie Fachwissen und Kompetenz zu vermittelnAbschluss einer anerkannten Hochschule oder Universität (ggf. mit Steuer- oder Wirtschaftsprüfungsschwerpunkt)Berufliche Erfahrung bei einer Steuerberatungs- oder Wirtschaftsprüfungsgesellschaft und/oder im operativen Steuerbereich einer KVG wünschenswertWir bieten Ihnen:Ohne den Ehrgeiz unserer Mitarbeiter wären unsere Erfolge nicht möglich. Und es ist uns wichtig, dass Sie gerne zur Arbeit kommen – gesund, glücklich und wertgeschätzt. Bei der DWS haben Sie Zugriff auf eine Reihe von Benefits, aus denen Sie wählen können und die speziell auf Ihren Lebensstil abgestimmt sind. Egal, ob Sie sich für die Gesundheitsversorgung oder betriebliche Vergünstigungen interessieren oder über Ihre Altersvorsorge nachdenken, es ist für jeden etwas dabei.Einige unserer Benefits:Leistungen zur körperlichen und geistigen Gesundheit, einschließlich (aber nicht beschränkt auf) der gesetzlichen Krankenversicherung (BKK), Krankengeld und Support-Hotlines für MitarbeiterFamilienfreundliche Leistungen, einschließlich großzügiger Elternzeitpakete (unterstützt alle Varianten von Familienformen) und Unterstützung bei der Suche nach Kinderbetreuungsmöglichkeiten, einschließlich des DWS-eigenen KindergartenservicesEine Vielzahl an Pensionsplänen, persönlichen Budgetkonten zur Ermöglichung von Sabbaticals oder vorzeitigem Ruhestand sowie vermögenswirksamen LeistungenDie Möglichkeit, unsere CSR-Strategie zu unterstützen, die sich auf die Bekämpfung des Klimawandels und die Erreichung größerer sozialer Gerechtigkeit konzentriert. Sie können an unsere Partnerorganisationen spenden oder sich an Corporate-Volunteering-Möglichkeiten in Ihren lokalen Gemeinden beteiligen, indem Sie uns vor Ort unterstützenLeistungen zur Mobilität, beispielsweise ein subventioniertes Deutschlandticket sowie Angebote zu Firmenwagen und JobRadDas aktuelle Hybrid-Arbeitsmodell der DWS ist darauf ausgelegt, die Balance zwischen persönlicher Zusammenarbeit und Engagement im Büro zu finden, die den Kern unserer Arbeitskultur ausmacht. Wir setzen uns für die Unterstützung flexibler und hybrider Arbeitsvereinbarungen auf der ganzen Welt ein. Abhängig von dem Standort oder der Stelle, auf die Sie sich bewerben, wird die Aufteilung zwischen der Arbeit im Büro und der Arbeit zu Hause im Rahmen Ihres Bewerbungs- und Interviewprozesses besprochen.Wir werden unsere Arbeitsumgebungen und -methoden weiterhin überprüfen und weiterentwickeln, um bestmögliche Arbeitsbedingungen für unsere Mitarbeiter zu schaffen.Wenn Sie aus irgendeinem Grund, einschließlich oder im Zusammenhang mit einer Behinderung oder einem langfristigen Gesundheitszustand, Anpassungen oder Änderungen am Bewerbungsprozess benötigen, wenden Sie sich bitte an Ihren Recruiter und teilen Sie uns mit, welche Unterstützung Sie möglicherweise benötigen. Beispiele für Anpassungen sind die Änderung des Interviewformats oder die Bereitstellung von Unterstützung in den Räumlichkeiten der DWS. Dies hat keine Auswirkungen auf Ihre Bewerbung und Ihr Rekrutierungsteam wird die Optionen mit Ihnen besprechen. #LI-VL1 #LI-02 Wir streben eine Unternehmenskultur an, in der wir gemeinsam jeden Tag das Beste geben. Dazu gehören verantwortungsvolles Handeln, wirtschaftliches Denken, Initiative ergreifen und zielgerichtete Zusammenarbeit.Gemeinsam teilen und feiern wir die Erfolge unserer Mitarbeiter*innen. Gemeinsam sind wir die Deutsche Bank Gruppe.Wir begrüßen Bewerbungen von allen Menschen und fördern ein positives, faires und integratives Arbeitsumfeld.",
    "requirements": [],
    "location": {
      "city": "Frankfurt",
      "state": "Hessen",
      "country": "Deutschland",
      "remote_options": false
    },
    "employment_details": {
      "type": "Unbefristet",
      "schedule": "Vollzeit",
      "career_level": "kein Corporate Title",
      "salary_range": null,
      "benefits": []
    },
    "organization": {
      "name": "Deutsche Bank",
      "division": "Frankfurt",
      "division_id": 4
    },
    "posting_details": {
      "publication_date": "2025-05-22",
      "position_uri": "/index.php?ac=jobad&id=63626",
      "hiring_year": "2025"
    }
  },
  "evaluation_results": {
    "cv_to_role_match": null,
    "match_confidence": null,
    "evaluation_date": null,
    "evaluator": null,
    "domain_knowledge_assessment": null,
    "decision": {
      "apply": null,
      "rationale": null,
      "estimated_prep_time": null
    },
    "strengths": [],
    "weaknesses": []
  },
  "processing_log": [
    {
      "timestamp": "2025-07-10T12:18:00.238172",
      "action": "job_fetched",
      "processor": "enhanced_job_fetcher_v6.1",
      "status": "success",
      "details": "Successfully fetched job 63626 from Deutsche Bank API"
    },
    {
      "timestamp": "2025-07-10T12:18:00.238172",
      "action": "description_enriched",
      "processor": "web_scraper",
      "status": "success",
      "details": "Successfully fetched job description (9379 characters)"
    }
  ],
  "raw_source_data": {
    "api_response": {
      "MatchedObjectId": "63626",
      "MatchedObjectDescriptor": {
        "PositionOfferingType": [
          {
            "Name": "Unbefristet"
          }
        ],
        "PositionSchedule": [
          {
            "Name": "Vollzeit"
          }
        ],
        "PublicationChannel": [
          {
            "StartDate": "2025-05-22"
          }
        ],
        "PositionTitle": "DWS - Senior Operations Analyst - Tax Reclaim (m/w/d)",
        "PositionLocation": [
          {
            "CityName": "Frankfurt",
            "CountrySubDivisionName": "Hessen",
            "CountryName": "Deutschland"
          }
        ],
        "PositionURI": "/index.php?ac=jobad&id=63626",
        "PositionID": "63626",
        "OrganizationName": "Frankfurt",
        "PositionHiringYear": "2025",
        "UserArea": {
          "ProDivision": 4
        },
        "CareerLevel": [
          {
            "Name": "kein Corporate Title"
          }
        ],
        "PublicationStartDate": "2025-05-22"
      },
      "RelevanceScore": 0,
      "RelevanceRank": 52
    },
    "specialist_analysis": {},
    "description_source": "web_scraping"
  }
}