{
  "job_metadata": {
    "job_id": "61964",
    "version": "1.0",
    "created_at": "2025-07-10T11:42:59.611001",
    "last_modified": "2025-07-10T11:42:59.611001",
    "source": "deutsche_bank_api",
    "processor": "enhanced_job_fetcher_v6.1",
    "status": "fetched"
  },
  "job_content": {
    "title": "Tax Senior Analyst (d/m/w)",
    "description": "Tax Senior Analyst (d/m/w) Job ID:R0380604 Full/Part-Time: Full-time Regular/Temporary: Regular Listed: 2025-06-16 Location: Frankfurt Position Overview Bereich & Team:Die Konzernsteuerabteilung, Group Tax, ist Teil des CFO-Bereiches der Deutschen Bank. Group Tax ist nach Regionen (Germany, UKI & Europe, APAC & MEA, und Americas) und Fachbereichen organisiert. Die Rolle des Tax Senior Specialist ist in der Abteilung mit regionaler Verantwortung für UKI & Europe angesiedelt. Neben der Regionsverantwortung für die Region UKI & Europe verantwortet der Bereich die globale Umsetzung von Pillar 2 inklusive der Erarbeitung von Richtlinien für den Gesamtkonzern sowie der Ermittlung von Besteuerungsgrundlagen zur Erfüllung der gesetzlichen Verpflichtungen gegenüber den Finanzbehörden der einzelnen Länder in Bezug auf die globale Mindeststeuer. Zur Verstärkung unseres Teams suchen wir einen Steuerspezialisten (m/w/d) mit breit gefächerten und idealerweise bankspezifischen Kenntnissen im Steuerrecht. Gemeinsam in einem internationalen Team mit erfahrenen Steuerspezialisten sind Sie für die Umsetzung der Pillar 2 Vorschriften und den damit verbundenen Tax Compliance- bzw. Erklärungspflichten verantwortlich. Darüber hinaus unterstützen Sie das Team bei der Beratung zu einer Vielfalt von steuerlichen Auswirkungen bei Transaktionen oder Geschäftsvorfällen. Die Rolle beinhaltet eine enge Abstimmung mit in- und ausländischen Kollegen der Steuerabteilung sowie den lokalen Ansprechpartnern im Finance-Bereich in den jeweiligen Ländern.AufgabenSie unterstützen bei der Erarbeitung von Richtlinien und Konzernvorgaben, inklusive von Dokumentation und Analysen, insbesondere zur Umsetzung der globalen MindestbesteuerungZusammen im Team gewährleisten Sie die Überwachung der Erfüllung gesetzlicher Verpflichtungen in Bezug auf die globale Mindestbesteuerung im In- und AuslandSie unterstützen bei der Erstellung von relevanten Analysen und Entscheidungsvorlagen für die Umsetzung der globalen Mindestbesteuerung bzw. zu den Auswirkungen der globalen Mindestbesteuerung Sie unterstützen im Rahmen grenzüberschreitender Steuerprojekte und arbeiten intensiv mit anderen Bereichen der Bank zusammenBereichsübergreifend arbeiten Sie mit unseren Fachkräften und Spezialisten im In- und Ausland an vielfältigen steuerrechtlichen ThemenSie bearbeiten allgemeine Fragestellungen Im Bereich der laufenden und transaktionenbezogenen UnternehmensteuernFähigkeiten und ErfahrungenSie verfügen über einen betriebswirtschaftlichen oder vergleichbaren Studienabschluss mit Schwerpunkt Steuern oder über ein Studium zum Diplom-Finanzwirt oder eine vergleichbare Qualifikation mit aktuellen steuerrechtlichen InhaltenIdealerweise haben sie bereits das Steuerberaterexamen erfolgreich abgelegtSie verfügen über mehrjährige Berufserfahrung im Bereich der Ertrag- oder internationalen Steuern, idealerweise in einer Bank oder einem Finanzinstitut, oder bei einer international ausgerichteten SteuerberatungsgesellschaftAls echter Teamplayer sind Sie offen und lernbereit für neue Inhalte und zeigen Verantwortungsbewusstsein, sowie eine selbständige und lösungsorientierte Arbeitsweise, auch unter hohem ZeitdruckSie verfügen über sehr gute MS-Office- (insbesondere MS Excel) und SAP-Kenntnisse, idealerweise sind Sie mit den Anwendungen GlobalTaxCenter und TaxBalance von Amana oder einem vergleichbaren Produkt vertraut.Sehr gute Deutsch- und Englischkenntnisse in Wort und Schrift runden Ihr Profil abWas wir Ihnen bietenWir bieten eine breite Palette von Leistungen, die all Ihre beruflichen und persönlichen Bedürfnisse abdecken.Emotional ausgeglichenEine positive Haltung hilft uns, die Herausforderungen des Alltags zu meistern – beruflich wie privat. Profitieren Sie von Angeboten wie Beratung in schwierigen Lebenssituationen und Angeboten zur Förderung mentaler Gesundheit.Körperlich fitMit Angeboten zur Aufrechterhaltung Ihrer persönlichen Gesundheit und einem förderlichen beruflichen Umfeld hilft Ihnen die Bank, körperlich fit zu bleiben. Profitieren Sie von Angeboten wie umfangreichen Check-up Untersuchungen, Impfangeboten und Beratung zur gesunden Lebensführung.Sozial vernetztDer Austausch mit anderen eröffnet uns neue Perspektiven, bringt uns beruflich wie persönlich voran und stärkt unser Selbstvertrauen und Wohlbefinden. Profitieren Sie von Angeboten wie Unterstützung durch den pme Familienservice, das FitnessCenter Job, flexible Arbeitszeitmodelle (bspw. Teilzeit, Jobtandem, hybrides Arbeiten) sowie einer umfangreichen Kultur der Vielfalt, Chancengleichheit und Teilhabe.Finanziell abgesichertDie Bank sichert Sie nicht nur während Ihrer aktiven Karriere, sondern auch für die Zukunft finanziell ab und unterstützt Ihre Flexibilität sowie Mobilität – egal ob privat oder beruflich. Profitieren Sie von Angeboten wie Beitragsplänen für Altersvorsorge, Bankdienstleistungen für Mitarbeiter*innen, Firmenfahrrad oder dem Deutschlandticket.Da die Benefits je nach Standort geringfügig variieren, gehen Sie bitte bei konkreten Fragen auf Ihren Recruiter / Ihre Recruiterin zu.Die Stelle wird in Voll- und in Teilzeit angeboten.Bei Fragen zum Rekrutierungsprozess steht Ihnen Evangelia Tseliou gerne zur Verfügung.Kontakt Evangelia Tseliou: +49 69 910-45463 Wir streben eine Unternehmenskultur an, in der wir gemeinsam jeden Tag das Beste geben. Dazu gehören verantwortungsvolles Handeln, wirtschaftliches Denken, Initiative ergreifen und zielgerichtete Zusammenarbeit.Gemeinsam teilen und feiern wir die Erfolge unserer Mitarbeiter*innen. Gemeinsam sind wir die Deutsche Bank Gruppe.Wir begrüßen Bewerbungen von allen Menschen und fördern ein positives, faires und integratives Arbeitsumfeld.",
    "requirements": [],
    "location": {
      "city": "Frankfurt",
      "state": "Hessen",
      "country": "Deutschland",
      "remote_options": false
    },
    "employment_details": {
      "type": "Unbefristet",
      "schedule": "Vollzeit",
      "career_level": "Assistant Vice President",
      "salary_range": null,
      "benefits": []
    },
    "organization": {
      "name": "Deutsche Bank",
      "division": "Frankfurt",
      "division_id": 8
    },
    "posting_details": {
      "publication_date": "2025-06-16",
      "position_uri": "/index.php?ac=jobad&id=61964",
      "hiring_year": "2025"
    }
  },
  "evaluation_results": {
    "cv_to_role_match": null,
    "match_confidence": null,
    "evaluation_date": null,
    "evaluator": null,
    "domain_knowledge_assessment": null,
    "decision": {
      "apply": null,
      "rationale": null,
      "estimated_prep_time": null
    },
    "strengths": [],
    "weaknesses": []
  },
  "processing_log": [
    {
      "timestamp": "2025-07-10T11:42:59.611001",
      "action": "job_fetched",
      "processor": "enhanced_job_fetcher_v6.1",
      "status": "success",
      "details": "Successfully fetched job 61964 from Deutsche Bank API"
    },
    {
      "timestamp": "2025-07-10T11:42:59.611001",
      "action": "description_enriched",
      "processor": "web_scraper",
      "status": "success",
      "details": "Successfully fetched job description (5700 characters)"
    }
  ],
  "raw_source_data": {
    "api_response": {
      "MatchedObjectId": "61964",
      "MatchedObjectDescriptor": {
        "PositionOfferingType": [
          {
            "Name": "Unbefristet"
          }
        ],
        "PositionSchedule": [
          {
            "Name": "Vollzeit"
          }
        ],
        "PublicationChannel": [
          {
            "StartDate": "2025-06-16"
          }
        ],
        "PositionTitle": "Tax Senior Analyst (d/m/w)",
        "PositionLocation": [
          {
            "CityName": "Frankfurt",
            "CountrySubDivisionName": "Hessen",
            "CountryName": "Deutschland"
          }
        ],
        "PositionURI": "/index.php?ac=jobad&id=61964",
        "PositionID": "61964",
        "OrganizationName": "Frankfurt",
        "PositionHiringYear": "2025",
        "UserArea": {
          "ProDivision": 8
        },
        "CareerLevel": [
          {
            "Name": "Assistant Vice President"
          }
        ],
        "PublicationStartDate": "2025-06-16"
      },
      "RelevanceScore": 0,
      "RelevanceRank": 43
    },
    "specialist_analysis": {},
    "description_source": "web_scraping"
  }
}