{
  "job_metadata": {
    "job_id": "60828",
    "version": "1.0",
    "created_at": "2025-07-10T12:47:18.385924",
    "last_modified": "2025-07-10T12:47:18.385924",
    "source": "deutsche_bank_api",
    "processor": "enhanced_job_fetcher_v6.1",
    "status": "fetched"
  },
  "job_content": {
    "title": "Senior Sales Specialist - Securities Services (f/m/x)",
    "description": "Senior Sales Specialist - Securities Services (f/m/x) Job ID:R0376169 Full/Part-Time: Full-time Regular/Temporary: Regular Listed: 2025-03-13 Location: Frankfurt Position Overview Details of the role and how it fits into the teamSecurities Services (SeS) is one of the key pillars of the Corporate Bank’ Institutional Clients Services franchise, providing custody, clearing and fund services solutions to financial institutions, and corporates globally.SeS’ Continental Europe Sales team is responsible for identifying new opportunities within existing clients as well as originating brand-new business from prospects. Sales individual will take a responsibility for business origination in selected markets in Continental Europe, with a major focus on growing SeS business within Western European names.The successful candidate will report to the Head of Sales for Securities Services in Continental Europe, and will be based in Frankfurt, Germany.Your key responsibilitiesIdentifying, formulating and owning specific go-to-market sales campaigns for assigned clients in Western EuropeGrow Securities Services revenue across a portfolio of assigned existing clients and targetsWorking closely with broader Securities Services team globally, and other Corporate Bank products and Deutsche Bank divisions to identify cross-sell opportunities and deliver against revenue targetsRepresenting Securities Services within and outside Deutsche Bank Group (including client forums, conferences, and road shows)Management of Salesforce Customer Relationship Management (CRM) to structure sales campaigns and maintain reliable sales pipeline with a view to increasing product sales. Assistance in the completion of client proposals and presentationsProduction of clear account plans for a portfolio of clients and briefing memos when required. Adhering to and promoting timely, transparent documentation of sales activities through call reports and the use of SalesforceYour skills and experiencesStrong track-record of sales ownership and origination. Relevant product knowledge in Post-TradeAbility to demonstrate success in developing and executing origination strategies, and tracking clients’ interactions in CRM systemsExperience of working with Financial Institutions; an extensive clients’ network in Western Europe required to haveFluent in English language is essential; fluent in German and/or French is highly welcomedExcellent communication skills, with an ability to write clearly to an executive audience and present on a variety of topics to senior stakeholdersStrong negotiation, problem-solving and stakeholder management skills, with the ability to prioritise against tight deadlines, effectively influence stakeholders and drive change in a global organizationWhat we offerWe provide you with a comprehensive portfolio of benefits and offerings to support both, your private and professional needs.Emotionally and mentally balancedA positive mind helps us master the challenges of everyday life – both professionally and privately. We offer consultation in difficult life situations as well as mental health awareness trainings.Physically thrivingWe support you in staying physically fit through an offering to maintain personal health and a professional environment. You can benefit from health check-ups; vaccination drives as well as advice on healthy living and nutrition.Socially connectedNetworking opens up new perspectives, helps us thrive professionally and personally as well as strengthens our self-confidence and well-being. You can benefit from PME family service, FitnessCenter Job, flexible working (e.g parttime, hybrid working, job tandem) as well as an extensive culture of diversity, equity and inclusion.Financially secureWe provide you with financial security not only during your active career but also for the future. You can benefit from offerings such as pension plans, banking services, company bicycle or “Deutschlandticket”.Since our offerings slightly vary across locations, please contact your recruiter with specific questions.This job is available in full and parttime.In case of any recruitment related questions, please get in touch with Felix Jablko.Contact Felix Jablko: +49 171 7742593 Wir streben eine Unternehmenskultur an, in der wir gemeinsam jeden Tag das Beste geben. Dazu gehören verantwortungsvolles Handeln, wirtschaftliches Denken, Initiative ergreifen und zielgerichtete Zusammenarbeit.Gemeinsam teilen und feiern wir die Erfolge unserer Mitarbeiter*innen. Gemeinsam sind wir die Deutsche Bank Gruppe.Wir begrüßen Bewerbungen von allen Menschen und fördern ein positives, faires und integratives Arbeitsumfeld.",
    "requirements": [],
    "location": {
      "city": "Frankfurt",
      "state": "Hessen",
      "country": "Deutschland",
      "remote_options": false
    },
    "employment_details": {
      "type": "Unbefristet",
      "schedule": "Vollzeit",
      "career_level": "Vice President",
      "salary_range": null,
      "benefits": []
    },
    "organization": {
      "name": "Deutsche Bank",
      "division": "Frankfurt",
      "division_id": 10050
    },
    "posting_details": {
      "publication_date": "2025-03-13",
      "position_uri": "/index.php?ac=jobad&id=60828",
      "hiring_year": "2025"
    }
  },
  "evaluation_results": {
    "cv_to_role_match": null,
    "match_confidence": null,
    "evaluation_date": null,
    "evaluator": null,
    "domain_knowledge_assessment": null,
    "decision": {
      "apply": null,
      "rationale": null,
      "estimated_prep_time": null
    },
    "strengths": [],
    "weaknesses": []
  },
  "processing_log": [
    {
      "timestamp": "2025-07-10T12:47:18.385924",
      "action": "job_fetched",
      "processor": "enhanced_job_fetcher_v6.1",
      "status": "success",
      "details": "Successfully fetched job 60828 from Deutsche Bank API"
    },
    {
      "timestamp": "2025-07-10T12:47:18.385924",
      "action": "description_enriched",
      "processor": "web_scraper",
      "status": "success",
      "details": "Successfully fetched job description (4668 characters)"
    }
  ],
  "raw_source_data": {
    "api_response": {
      "MatchedObjectId": "60828",
      "MatchedObjectDescriptor": {
        "PositionOfferingType": [
          {
            "Name": "Unbefristet"
          }
        ],
        "PositionSchedule": [
          {
            "Name": "Vollzeit"
          }
        ],
        "PublicationChannel": [
          {
            "StartDate": "2025-03-13"
          }
        ],
        "PositionTitle": "Senior Sales Specialist - Securities Services (f/m/x)",
        "PositionLocation": [
          {
            "CityName": "Frankfurt",
            "CountrySubDivisionName": "Hessen",
            "CountryName": "Deutschland"
          }
        ],
        "PositionURI": "/index.php?ac=jobad&id=60828",
        "PositionID": "60828",
        "OrganizationName": "Frankfurt",
        "PositionHiringYear": "2025",
        "UserArea": {
          "ProDivision": 10050
        },
        "CareerLevel": [
          {
            "Name": "Vice President"
          }
        ],
        "PublicationStartDate": "2025-03-13"
      },
      "RelevanceScore": 0,
      "RelevanceRank": 61
    },
    "specialist_analysis": {},
    "description_source": "web_scraping"
  }
}